{
    "paper_title": "Large Language Models and Mathematical Reasoning Failures",
    "authors": [
        "Johan Boye",
        "Birger Moell"
    ],
    "sections": [
        {
            "title": "Abstract",
            "content": "This paper investigates the mathematical reasoning capabilities of large language models (LLMs) using 50 newly constructed high-school-level word problems. Unlike prior studies that focus solely on answer correctness, we rigorously analyze both final answers and solution steps to identify reasoning failures. Evaluating eight state-of-the-art models - including Mixtral, Llama, Gemini, GPT-4o, and OpenAI's o1 variants - we find that while newer models (e.g., o3-mini, deepseek-r1) achieve higher accuracy, all models exhibit errors in spatial reasoning, strategic planning, and arithmetic, sometimes producing correct answers through flawed logic. Common failure modes include unwarranted assumptions, over-reliance on numerical patterns, and difficulty translating physical intuition into mathematical steps. Manual analysis reveals that models struggle with problems requiring multi-step deduction or real-world knowledge, despite possessing broad mathematical knowledge. Our results underscore the importance of evaluating reasoning processes, not just answers, and caution against overestimating LLMs' problem-solving proficiency. The study highlights persistent gaps in LLMs' generalization abilities, emphasizing the need for targeted improvements in structured reasoning and constraint handling."
        },
        {
            "title": "Start",
            "content": "Johan Boye KTH Royal Institute of Technology Stockholm, Sweden jboye@kth.se Birger Moëll KTH Royal Institute of Technology Stockholm, Sweden bmoell@kth.se 5 2 0 2 7 1 ] . [ 1 4 7 5 1 1 . 2 0 5 2 : r a"
        },
        {
            "title": "Abstract",
            "content": "This paper investigates the mathematical reasoning capabilities of large language models (LLMs) using 50 newly constructed highschool-level word problems. Unlike prior studies focusing solely on answer correctness, we rigorously analyze both final answers and solution steps to identify reasoning failures. Evaluating eight state-of-the-art modelsincluding Mixtral, Llama, Gemini, GPT-4o, and OpenAIs o1 variantswe find that while newer models (e.g., o3-mini, deepseek-r1) achieve higher accuracy, all models exhibit errors in spatial reasoning, strategic planning, and arithmetic, sometimes producing correct answers via flawed logic. Common failure modes include unwarranted assumptions, over-reliance on numerical patterns, and inability to translate physical intuition into mathematical steps. Manual scrutiny reveals that models struggle with problems requiring multi-step deduction or real-world knowledge, despite possessing broad mathematical knowledge. Our results underscore the importance of evaluating reasoning processes, not just answers, and caution against overestimating LLMs problem-solving proficiency. The study highlights persistent gaps in LLMs generalization abilities, emphasizing the need for targeted improvements in structured reasoning and constraint handling."
        },
        {
            "title": "Introduction",
            "content": "How good are large language models (LLMs) at mathematical reasoning? This question has been addressed by several authors, who have constructed data sets in order to evaluate the mathematical capabilities of LLMs, e.g. (Hendrycks et al., 2020, 2021; Cobbe et al., 2021; Chernyshev et al., 2024; Li et al., 2024). In most of these studies, only the final answer produced by the LLM on given problem was checked for correctness the questions were either multiple-choice, or the answer consisted of single number, both cases facilitating automatic evaluation. However, as it is possible to arrive at correct answer by means of shallow heuristics rather than watertight argument, it is important to also study the full solution provided by the model, much in the same way teacher would assess student exam. Of course, this method requires manual scrutiny and is therefore more time-consuming, but we argue that it is indispensable for to get proper picture of the mathematical prowess of LLMs. In this paper, we present small dataset1 of 50 newly constructed mathematical problems intended for LLM evaluation, and use it to evaluate models: mixtral8x7b (Albert Q. Jiang et al., 2024), llama3.3-70B-versatile (Hugo Touvron et al., 2023), Gemini-2.0-pro-exp (Google, 2024), GPT4o (OpenAI, 2024a), o1-preview, o1, and o3-mini (OpenAI, 2024b). Our problems are all formulated in natural language (word problems) and require no more than high-school level mathematical knowledge: basic principles of counting and divisibility, some algebra, arithmetic, probability and geometry, and some real-world knowledge, e.g. that it is impossible to walk on water, how many minutes there are in an hour, how the is opposite the dots are placed on dice (e.g. the ), and so on. We purposely excluded complicated sums or integrals written in pure mathematical notation, since there are already computer algebra systems like Mathematica that can solve large classes of such problems in precise way. Our goal was rather to focus on natural language word problems. Such mathematical word problems provide an excellent testbed for evaluating the reasoning capabilities of LLMs. Early LLMs were not explicitly trained to perform reasoning but rather to do nexttoken prediction, possibly with additional training based on techniques like RLHF (Ouyang et al., 2022). Still, these models seemed capable of per1Dataset, code, and results are available on https:// github.com/jboye12/llm-probs forming non-trivial reasoning in many instances, in particular when prompted with Chain-ofThought prompt like Lets think step by step (Wei et al., 2022). However, it is not clear how much of these apparent reasoning capabilities can be attributed to memorization of the training material combined with shallow heuristics, as opposed to having learned actual general principles of reasoning by generalizing from the training examples. Prabhakar et al. (2024) conclude that it is combination of probabilistic, noisy reasoning and memorization of the training material, and the more reasoning steps are required to get to the solution, the more likely it is that memorization will interfere with the reasoning process, leading to the wrong answer. Starting in the fall of 2024, several models were released that more explicitly combined next-token prediction with reasoning. In the announcement of their \"o1\" models, OpenAI write: In qualifying exam for the International Mathematics Olympiad (IMO), GPT-4o correctly solved only 13% of problems, while the reasoning model scored 83% (OpenAI, 2024b). This claim somewhat mirrored by our results, with the o1 model achieving 37/50 on our problem set. We still found it somewhat surprising that o1 was not better still, considering that our problems are far easier than the typical IMO problems. In the paper, we make systematic study of the reasoning failures exhibited by various models, and try to analyse their root causes."
        },
        {
            "title": "2 Related work",
            "content": "A number of researchers have created datasets to evaluate the mathematical abilities of LLMs. MATH (Hendrycks et al., 2021) contains large collection of mathematical problems from different domains, with 7 different levels of difficulty. The answer is always number. Also the MMLU (Hendrycks et al., 2020) contains mathematics section consisting of multiple-choice questions. GSM8K (Cobbe et al., 2021) contains word problems on grade-school level solvable by simple arithmetic. The answer is always number. GSM-Plus (Li et al., 2024) and GSM-symbolic (Mirzadeh et al., 2024) are both extensions of GSM8k with adversarial examples. In the latter case, the authors showed that it was possible to confuse the models by adding irrelevant numerical information to the problem formulation. In some cases, the models worked this irrelevant information into the solutions, leading to incorrect answers. U-MATH (Chernyshev et al., 2024) contains university-level problems given in mathematical notation and with figures (i.e. the input is multimodal). All these datasets are quite large, containing thousands of similar problems, and they are amenable to automatic assessment."
        },
        {
            "title": "3 Method",
            "content": "We constructed set of 50 problems. Four problems were taken from Swedish book of mathematical puzzles (Vaderlind, 1996), the rest were invented by the authors. The selection/design criterion for the problems was that they should be solvable with only high-school mathematics, although the questions themselves might be of different nature than those posed to high-school students (depending on country). Some problems had specific numerical answer, some asked for statement of the type \"It is possible/impossible to do X?\", and some asked for concrete method, algorithm, or strategy to obtain some particular goal. All problems are listed in the appendix. Each question was posed once to each model through their respective APIs2 This led to 400 answers from the models, which were assessed manually by the first author (who is also an experienced teacher), checking both the answer and the solution for correctness. If the solution was incorrect, we also wrote brief note describing the nature of the problem."
        },
        {
            "title": "4 Results",
            "content": "Model mixtral-8x7B llama-3.3-70B gemini-2.0-pro-exp gpt-4o o1-preview o1 o3-mini deepseek-r"
        },
        {
            "title": "Correct Ans",
            "content": "0 10 23 14 30 37 40 36 4 1 3 3 2 2 2 4 Sol 0 0 1 2 2 1 0 0 Table 1: The number of problems correctly solved and answered (out of 50). Ans = correct answer but wrong solution. Sol = correct solution but wrong final answer. 2The mixtral and llama models were hosted at Groq (https://groq.com) and called though the Groq API. (7,9) (7,9) (7,9) (7,9) (7,9) (7,9) (7,9) (9,7) (9,7) (9,7) (9,7) (9,7) (9,7) (9,7) (3,6) (3,6) (3,6) (3,6) (3,6) (3,6) (3,6) (1,3) (1,3) (1,3) (1,3) (1,3) (1,3) (1,3) (3,1) (3,1) (3,1) (3,1) (3,1) (3,1) (3,1) (0,0) (0,0) (0,0) (0,0) (0,0) (0,0) (0,0) (6,3) (6,3) (6,3) (6,3) (6,3) (6,3) (6,3) (7,9) (7,9) (7,9) (7,9) (7,9) (7,9) (7,9) (9,7) (9,7) (9,7) (9,7) (9,7) (9,7) (9,7) (3,6) (3,6) (3,6) (3,6) (3,6) (3,6) (3,6) (1,3) (1,3) (1,3) (1,3) (1,3) (1,3) (1,3) (3,1) (3,1) (3,1) (3,1) (3,1) (3,1) (3,1) (0,0) (0,0) (0,0) (0,0) (0,0) (0,0) (0,0) (6,3) (6,3) (6,3) (6,3) (6,3) (6,3) (6,3) Figure 1: The dogs trail (left) and how the leash wraps around the lampposts (right). 4.1 Quantitative results Table 1 summarizes the results of the various models. Correct means that the model has given the correct answer and correct solution, whereas Ans means that the model has given the right answer but an erroneous solution. This could happen as some questions have the structure Is it possible to..., where the model might answer No while providing the wrong motivation. All in all, 21 questions (5%) were answered in this way, suggesting that it is essential not just to look at the final answer when evaluating the reasoning capabilities of models. There are also few Sol instances where the reasoning is correct and model has found the key idea, but makes small calculation error leading to the wrong answer. We see from table 1 that Mixtral8x7b is the worst-performing model, getting no solutions right, followed by Llama3.370B-versatile (10/50) and gpt-4o (14/50). The later models that have been trained with an explicit problem-solving objective Google (2024), OpenAI (2024b), Guo et al. (2025) fare much better, although there is still some variation."
        },
        {
            "title": "4.2 Spatial reasoning problems",
            "content": "This is problem that confounded every model: (Problem 11): dog is on an automatically retractable leash. If the owner is standing at (0,0) and the dog runs to (5,0), the extended part of the leach is 5 metres long, but when the dog returns to its owner at (0,0), the leach is rewinded and is 0 metres long again. However, if there is lamppost at (1,3) and the dog runs from (0,0) to (5,0), then to (0,5) and then back to (0,0) again, the leash will loop around the lamppost so the extended part of the leash is now 2*sqrt(10), i.e. the distance from (0,0) to the lamppost and back again. Suppose now that there are lampposts at (1,3), (3,1), (6,3), (3,6), (9,7), and (7,9). The dog runs the following trail: (0,0) to (6,0) to (0,6) to (6,12) to (12,6) to (6,0) to (0,6) to (6,12) to (12,6) to (6,0) to (0,0). What is the length of the extended part of the leash when the dog has finished its run? Round the answer upwards to the closest integer. Figure 1 shows the dogs trail (left), and how the leash will wrap around the lampposts (right). This is an example of problem which is easy to solve for human (if allowed to use pen and paper to draw figure), since the mathematics involved is just repeated use of the distance formula. Most adults would have intuitive idea of how piece of string behaves when looped around some lampposts and then tightened, which makes it easy to come up with the picture in Figure 1. The reasoning errors committed by the models suggest that they cannot grasp the physics of the situation. o1 seemed to seize on the example in the question, and assumed that it should add the Euclidean distances from (0,0) to (some of) the lampposts and back again. deepseek-r1 comes to the same conclusion, even though in its reasoning printout (which is accessible for the user, unlike in the o1 and o3 models), deepseek seems to realize that the leash is wrapped twice around the diamond created by the four furthest lampposts, but fails to draw the right conclusion from that observation. o3-mini explains (wrongly) that the dog is running one leap clockwise around the four furthest lampposts, and then counter-clockwise, meaning that the two windings cancel each other. Somehow its conclusion is that the extented part of the leash is 2 10, just as in the example in the question. The remaining models have non-sensical explanations. Another problem where humans are helped by mental imagery is the following: (Problem 26): We want to assign number in {1 . . . 12} to each of the edges on cube so that (1) each edge is assigned different number, and (2) the sum of the four edges on one face of the cube will be the same for all faces. Determine whether this is possible or not. If it is possible, determine which number the edges on one face should add up to. (Problem 19): Suppose you have two ordinary six-sided dice which you want to place on wooden table so as few dots as possible are visible. The best way of doing this is placing them next to each other with the six dots facing downwards and the five dots facing each other. This way 2*(1+2+3+4)=20 dots will be visible altogether (the observer is allowed to walk around the table). We define v(n) to be the minimal number of dots visible on dice placed on table. You are given v(1)=15, v(2)=20, v(3)=26. What is v(37)? The correct answer is 95. The optimal placement is first to arrange 36 of the dice in 6 6 square, with 1 facing upwards on each die, 2 and 3 facing outwards on the dice in the corners, and 2 facing outwards on the dice along the edges, making 88 dots visible. The 37th die is placed with 1 facing upwards, and its 5 pressed against one of the 3s in the square of dice. The 37th die now exposes 14, but covers 3 which was previously visible. All in all, adding the 37th die will contribute an additional 7 visible dots, so v(37) = 88+7 = 95. deepseek-r1 actually nailed this problem, giving essentially the explanation above, after an extensive chain-of-thought process (>22,000 tokens). o3mini realized the 6 6 configuration, but then goes astray when placing the 37th die. o1 and gemini instead suggested putting the dice in line (which is sub-optimal), and also failed to correctly count the number of visible dots for that configuration. The remaining models tried to fit numerical formula (e.g. quadratic formula) based on the three examples given in the question, without considering the actual physics of the problem. These attempts all ended in failure. Finally, we mention the following problem, which resulted in the largest number of incorrect solutions but correct answers: correct solution would first point out that each number would appear on two faces, meaning that the total number of numbers visible on the six faces is 2(1 + . . . + 12) = 156, which entails that the sum of each face is 156/6 = 26. All models except mixtral came this far. However, the second part of the solution is to show that there is concrete assignment of numbers to edges that result in each face having the sum 26. deepseek-r1 tried to do this but came up with an erronous assignment. Only o3-mini managed to get the solution completely correct. Several models concluded that assigning numbers to the edges as described in the question is possible just because twice the sum of 1..12 is divisible by 6, or equivalently that 1 + . . . + 12 is divisible by 3. But there are many sets of 12 numbers whose sum is divisible by 3 but which cannot be assigned to the edges of cube in the way described in the question. The failure to realize this might have been due to the model having seen the problem in its training data (and knowing it to be solvable), or simply failure to consider the physical constraints of the problem."
        },
        {
            "title": "4.3 Strategy problems",
            "content": "Most LLMs were struggling with problems of strategic nature. An example was the following: (Problem 4): An ordinary tic-tac-toe board has 9 squares: (1,1) - (3,3). Now consider fric-frac-froe, which is played on an extended board where the top row has four squares (1,1)-(1,4), and the other two rows have three squares as before. The objective of fric-frac-froe is to have three markers in row, just as in ordinary tic-tac-toe. Either find winning strategy for the fric-frac-froe player who goes first, or explain why the game is draw. That is, the board looks like Figure 2. It does not take human observer long to discover winning 1 2 4 1 2 3 R1 1 R2 S2 S1 Figure 2: fric-frac-froe board. strategy, which is to play (1,3). The second player has to block at (1,2), and now the correct move is (2,2). The second player has to block at (3,1), and now (3,3) wins, since both (1,1) and (2,3) are threatened and the second player cannot block both of them. (There are also winning strategies for the first player starting with (2,2)). o1, o3-mini, gemini, and deepseek-r1 all correctly point out that the game is win for the first player, but to back up that claim they either propose strategy that would lead to draw or even loss for the first player, or gives an incomplete strategy. gemini-2.0-pro-exp comes closest to viable strategy by suggesting to start with (2,2) and follow up with (1,3). However, it proposes to play (1,3) also in the case where the second player plays (1,3) in the first move, which is clearly impossible. The remaining 4 models seem to find it obvious that the game is draw, probably influenced by the many sources in their training material describing tic-tac-toe as being draw."
        },
        {
            "title": "A problem which is a combination of strategic",
            "content": "and spatial reasoning is the following: (Problem 30): square-shaped swimming pool has its opposite corners at (0,0) and (2,2). swimmer and runner makes the following bet: They will start at the same time at (0,0). The goal of the swimmer is to swim to either (1,2) or (2,1). If he can reach either of those points and the runner is not already there when the swimmer arrives, the swimmer will win the bet, otherwise the runner will win the bet. Suppose the runner is twice as fast as the swimmer. Assuming both players are using their best strategy, who will win the bet? Explain the best strategies for the runner and the swimmer. The answer is that swimmer will win the bet. He 0 0 2 Figure 3: The swimming pool of problem 30, showing the swimmers route (dashed line) and the runners route (dotted line). has to use the right strategy, though. If the swimmer aims for (1,2) and swims there in straight 5 = 2.23 time line, he will cover the distance in units. However, the runner will already be there on his arrival, since the distance along the perimeter is 3, which will only take the runner 1.5 time units. better swimming strategy is to aim for the centre of the pool at (1,1), as illustrated in Figure 3. The runner, who cannot be sure which point the swimmer is aiming for, has to commit to start running either along the x-axis or the y-axis (the runner has no better strategy than randomly selecting between these). Lets say he starts running along the y-axis. When the swimmer reaches posi2=1.4 time units, the runner tion S1 at (1,1) after has reached position R1 at (0.8, 2). The swimmer now turns slightly right and aims for position S2 at (2,1), which he will reach in 1 additional time unit. However, the runner can only reach position R2 at (2,1.2) in that time, so the swimmer will win the bet. The only model to completely solve the problem was o1, who realized the key idea that the swimmer can change direction in the middle of the pool. deepseek-r1 concludes its output by the self-contradictory statement the swimmer will win the bet by using their best strategy to randomize between the targets, ensuring 50% chance of winning. The other models all suggest that the runner will win, focusing their explanations on the fact that the runner is quicker. No model could solve problem 22: (Problem 22): have collection of 5 triangles, T1 to T5. All the interior angles (when expressed as degrees) of T1 to T5 are distinct and are found in the set {1,2,3,4,5,6,7,8,9,10,167,168,169, 170,171}. You can now point to number in and ask an oracle which triangle this angle belongs to. What is the minimal number of such questions you have to ask before you are guaranteed to know which triangle each of the 15 numbers in belongs to? The answer, which requires careful careful analysis, is that 6 questions to the oracle are sufficient and also necessary in the worst case to know which angle is in which triangle (see Appendix for complete solution). Since the angles in triangle must add up to 180 degrees, the 5 bigger angles 167171 must be in different triangles. All the models have realized this, but they propose various incorrect numbers as the solution. o3-mini suggests (incorrectly) that it is necessary to ask the oracle about the triangle of each of 5 largest angles, plus an additional 5 questions for 5 or smaller angles, all in all 10 questions (the location of the 5 remaining angles can be deduced from the fact that the angles in triangle must add up to 180 degrees). deepseek-r1 improves on this suggestion by pointing out (correctly) that it is sufficient to ask about the location of 4 of the large angles and 4 of the smaller angles, since the angles of the fifth triangle can be deduced by the process of elimination. The strategies proposed by o3-mini and deepseek-r1 would both lead to the desired information, but they are not optimal in terms of the number of questions. o1 starts off very well by observing (correctly) that there are 8 possible groupings of the angles in into triples that add up to 180 degrees, and because you need to assign name T1...T5 to each of the triangles, there are all in all 5! 8 = 960 possibilities. o1 also concludes, by an informationtheoretic argument, that at least 5 questions to the oracle are necessary. Unfortunately, it does not consider whether 5 questions also are sufficient, but simply states (wrongly) that the necessary information can be obtained with 5 questions using suitably clever choice of which angles to query, and does not specify what that clever choice would be. o1s proposed solution is therefore incorrect. llama3.3, mixtral, gemini and o1-preview suggest respectively that 3, 4, 5, and 7 questions to the oracle are necessary and sufficient, either accompanied by an incorrect question strategy or general argument without any concrete strategy. 4.4 Numerical and set-theoretic problems Perhaps not surprisingly, the models are stronger at purely mathematical problems without any strategical element or any need for spatial reasoning. However, problem 17 proved too difficult for all models: (Problem 17): We write the prime numbers in six columns, as follows: In the first row, we write the first six primes: 2,3,5,7,11,13. In the second row, we write the next six primes in reverse order: 37,31,29,23,19,17. We keep on alternating between writing the next six primes in order on odd-numbered rows, and the next six primes in reverse order on even-numbered rows. After new row has been added, we compute the sums of all the columns. After how many rows will we see (for the first time) that the third column has the largest sum of all columns? Either answer with number, or explain why this will never happen. The correct answer is that this will first happen on line 83. However, all models claimed that it will never happen that the third column will have the largest value, citing numerical evidence from studying the first couple of lines of the constructed prime table. It is notoriously hard to reason about the additive properties of prime numbers, so perhaps the only viable to solve this problem in reasonable amount of time is to write small program and execute it, which no model attempted. far simpler problem that proved to be surprisingly difficult was this one: (Problem 7): We have two disjoint sets of numbers: A, with members, and with + 1 members. We want to construct sequence of numbers which is 2n + 1 numbers long, and every second number is selected from and every second number from B, and the sequence has to start and end with number from A. Either suggest method for doing this, or explain why such method cannot exist. possible general method is always select the smallest member from and the smallest member from B. As simple example (not given to the models), consider = {1} and = {2, 3}, where the proposed method would produce the sequence 1, 2, 1. It is trivial to see that the proposed method would always work; however, all the models except o1 and o3-mini either claimed that the problem does not have solution or gave solutions that were completely wrong, because the models all presuppose that each element could only be selected once from each set. We surmise that problem 7 is similar to some problem used in the models training material where the select-only-once criterion is essential. If we put the problem in slightly different context3, most models could solve it correctly. Another situation where strong prior assumptions seem to lead the models astray was the following: (Problem 47): We will call set of positive integers progressive if at least three of the numbers in the set belong to an arithmetic progression with common difference larger than 1. For example, set containing 2,6,42 is progressive, since these three numbers belong to the same arithmetic progression 2,4,6,8,...,40,42,... Either construct set of of positive integers which is not progressive and has at least 5 members, or explain why no such set exists. The correct answer is that no such set exists, as every non-progressive set can contain at most 2 odd and 2 even numbers. However, only o1 and o3-mini realized this. All the remaining models claimed the contrary, and stated examples like {1, 2, 4, 8, 16}, which was claimed to be nonprogressive with the motivation the differences between consecutive elements are not equal. We found this somewhat surprising, since the prompt even contained similar example with an explanation of why the set indeed is progressive. We can only assume that the pre-training probability distribution of the model strongly leads it to its answer, ignoring the example in the prompt."
        },
        {
            "title": "5 Discussion",
            "content": "Throughout the erroneous answers to the 50 example problems, we can see many traits we also see in 3The alternative formulation was: The proportion of winning lottery tickets in three different lotteries A, B, and can be found in this set: {0.1, 0.05}. Give an example of what the winning chances might be in the three lotteries. many human math and engineering students failing to solve similar problems: Making arithmetic errors Disregarding constraints in the question formulation (as several models did for problem 47 above) Adding unwarranted assumptions (as in problem 7 above) Over-reliance on preliminary numerical evidence, as in problem 17 Trying to shoe-horn problem into known solution method, as in the fric-frac-froe game, where several models seemed to assume the game to be draw, just like tic-tactoe. Failure to find key idea (the problem is just too difficult). However, the failure to add unstated but commonsense assumptions is rather unique to models, e.g. that it is impossible for the runner to run in swimming pool (this running strategy was suggested by o1-preview in problem 30). On the other hand, in particular the latest models o1, o3-mini, deepseek-r1 and gemini seem to have large base of mathematical knowledge. Throughout the solutions, we could see the models make reference to Picks theorem, the Frobenius coin problem, and Eulerian circuits, among others. Even though we have focused on faulty reasoning in this paper, state-of-the-art models (in particular the o1, o3, and deepseek models) have impressive reasoning capabilities and can solve quite difficult problems. The problem, as always with LLMs, is that also the erroneous solutions can look good at cursory inspection, in particular if the reader has limited mathematical knowledge."
        },
        {
            "title": "6 Limitations",
            "content": "The results presented in this article provide snapshot of the mathematical abilities of some stateof-the-art large language models (LLMs) in early 2025. The article provide some insights to the blind spots and shortcomings of LLMs when it comes to mathematical reasoning, but is unclear how much one can generalize from the results, due to the following: LLM technology is developing rapidly, and it is perfectly possible that state-of-the-art models can solve more problems than described here just few months from now. Daya Guo, Dejian Yang, Haowei Zhang, Junxiao Song, Ruoyu Zhang, Runxin Xu, Qihao Zhu, Shirong Ma, Peiyi Wang, Xiao Bi, et al. 2025. Deepseek-r1: Incentivizing reasoning capability in llms via reinforcement learning. arXiv preprint arXiv:2501.12948. Each model was just queried once, due to time constraints (each solution was assessed manually, which took considerable amounts of time). It is possible that in some cases, model might have produced better answer in second or third try. We do not have access to the internals of the systems, in particular, we could not scrutinize the chain-of-thought printouts from the o1, o1preview, o3-mini, and gemini-2.0-pro-exp models. 8 state-of-the-art models were tested, but there are of course more models than these, and the models also exist in several versions. Due to time contraints, we could not try all of them. The 50 problems in the problem set only covered certain sub-areas of high school mathematics. Notably, trigonometry and calculus were missing. Though we strived to invent original problems which would not appear in the training set of any model, our imagination is limited, and it is perfectly possible that some model had seen some problem (or something very similar) in its training phase."
        },
        {
            "title": "References",
            "content": "Antoine Roux Albert Q. Jiang, Alexandre Sablayrolles et al. 2024. Mixtral of experts. Preprint, arXiv:2401.04088. Konstantin Chernyshev, Vitaliy Polshkov, Ekaterina Artemova, Alex Myasnikov, Vlad Stepanov, Alexei Miasnikov, and Sergei Tilga. 2024. U-math: university-level benchmark for evaluating mathematical skills in llms. arXiv preprint arXiv:2412.03205. Karl Cobbe, Vineet Kosaraju, Mohammad Bavarian, Mark Chen, Heewoo Jun, Lukasz Kaiser, Matthias Plappert, Jerry Tworek, Jacob Hilton, Reiichiro Nakano, et al. 2021. Training verifiers to solve math word problems. arXiv preprint arXiv:2110.14168. Google. 2024. Introducing gemini 2.0: our new ai model for the agentic era. Dan Hendrycks, Collin Burns, Steven Basart, Andy Zou, Mantas Mazeika, Dawn Song, and Jacob Steinhardt. 2020. Measuring massive multitask language understanding. arXiv preprint arXiv:2009.03300. Dan Hendrycks, Collin Burns, Saurav Kadavath, Akul Arora, Steven Basart, Eric Tang, Dawn Song, and Jacob Steinhardt. 2021. Measuring mathematical problem solving with the math dataset. arXiv preprint arXiv:2103.03874. Gautier Izacard Hugo Touvron, Thibaut Lavril et al. 2023. Llama: Open and efficient foundation language models. Preprint, arXiv:2302.13971. Qintong Li, Leyang Cui, Xueliang Zhao, Lingpeng Kong, and Wei Bi. 2024. Gsm-plus: comprehensive benchmark for evaluating the robustness of llms as mathematical problem solvers. arXiv preprint arXiv:2402.19255. Iman Mirzadeh, Keivan Alizadeh, Hooman Shahrokhi, Oncel Tuzel, Samy Bengio, and Mehrdad Farajtabar. 2024. Gsm-symbolic: Understanding the limitations of mathematical reasoning in large language models. arXiv preprint arXiv:2410.05229. OpenAI. 2024a. Gpt-4 technical report. Preprint, arXiv:2303.08774. OpenAI. 2024b. Introducing openai o1-preview. Long Ouyang, Jeffrey Wu, Xu Jiang, Diogo Almeida, Carroll Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, et al. 2022. Training language models to follow instructions with human feedback. Advances in neural information processing systems, 35:2773027744. Akshara Prabhakar, Thomas L. Griffiths, and R. Thomas McCoy. 2024. Deciphering the factors influencing the efficacy of chain-of-thought: Probability, memorization, and noisy reasoning. Preprint, arXiv:2407.01687. P. Vaderlind. 1996. Fler matematiska tankenötter. Telegram bokförlag. Jason Wei, Xuezhi Wang, Dale Schuurmans, Maarten Bosma, Fei Xia, Ed Chi, Quoc Le, Denny Zhou, et al. 2022. Chain-of-thought prompting elicits reasoning in large language models. Advances in neural information processing systems, 35:2482424837. Appendix: All 50 problems 1. Let ni be the numeral obtained by writing the number 97 in base i. Then interpret n2, . . . , n9 as decimal numbers, and let be the sum of those numbers. What is modulo 97 (in base 10)? 2. We have calculator that respects the ordinary laws of arithmetic precedence (e.g., 2+3*4 will result in 14). We now randomly press (with uniform probability) one of the digits 09, then either + or *, then another random digit, then then either + or * again, and then another random digit. Finally, we press =, and note down the answer. If we keep repeating this experiment over and over, what is the expected average result? 3. On black-and-white computer screen, digits and numbers are displayed as bitmaps with 7 rows and 5 columns. For instance, an \"I\" is displayed like this: 01110 00100 00100 00100 00100 00100 The bitmap for \"I\" contains 3 ones on the first row, 1 one on the second row, etc., that is, [3,1,1,1,1,1,3] ones, counting from the first row to the last. Which letter in AZ has this number of ones: [4,2,2,4,2,2,4], counting from first row to the last? 4. An ordinary tic-tac-toe board has 9 squares: (1,1) - (3,3). Now consider fric-frac-froe, which is played on an extended board where the top row has four squares (1,1)-(1,4), and the other two rows have three squares as before. The objective of fric-frac-froe is to have three markers in row, just as in ordinary tictac-toe. Either find winning strategy for the fric-frac-froe player who goes first, or explain why the game is draw. 5. We will call binary tree with numbers at each node labeled binary tree. Either give an example of labeled binary tree of depth 3 whose pre-order traversal and post-order traversal yields the same sequence of numbers, or explain why no such tree can exist. 6. rectangle has sides with non-zero integer lengths. Adding the length of the perimeter and the area of the rectangle yields 9793. How long are the sides? 7. We have two disjoint sets of numbers: A, with members, and with n+1 members. We want to construct sequence of numbers which is 2n+1 numbers long, and every second number is selected from and every second number from B, and the sequence has to start and end with number from A. Either suggest method for doing this, or explain why such method cannot exist. 8. We have 4 points in the plane: p1, p2, p3, p4, and construct polygon by drawing line from p1 to p2, from p2 to p3, from p3 to p4, and from p4 back to p0 again. Suppose p1=(3,4), p2=(7,7), and p3=(10,3). If we want the polygon to be square, where should p4 lie? Either give the coordinates of p4, or explain why no such point can exist. 9. Let a0 be the factorial of 10001000, and let ak be the sum of digits in ak1, for > 0. After steps, ai, ai+1, ai+2, . . . will be same number, which is single digit. Which digit? 10. Let be positive integer and define the following rule : (x) = x/3 if is divisible by 3, otherwise (x) = 2x + 1. We are interested in how many times we must apply this rule before we reach the number 1. For = 4, we need 3 applications: (4) = 9, (9) = 3, (3) = 1. Let us use the notation g(x) to denote the smallest such that applications of starting from results in 1. As we saw, g(4) = 3. If no such exists, we let g(x) = 1. What is g(1) + g(2) + . . . + g(100)? 11. dog is on an automatically retractable leash. If the owner is standing at (0,0) and the dog runs to (5,0), the extended part of the leach is 5 metres long, but when the dog returns to its owner at (0,0), the leach is rewinded and is 0 metres long again. However, if there is lamppost at (1,3) and the dog runs from (0,0) to (5,0), then to (0,5) and then back to (0,0) again, the leash will loop around the lamppost so the extended part of the leash is now 2*sqrt(10), i.e. the distance from (0,0) to the lamppost and back again. Suppose now that there are lampposts at (1,3), (3,1), (6,3), (3,6), (9,7), and (7,9). The dog runs the following trail: (0,0) to (6,0) to (0,6) to (6,12) to (12,6) to (6,0) to (6,0) to (0,6) to (6,12) to (12,6) to (0,0). What is the length of the extended part of the leash when the dog has finished its run? Round the answer upwards to the closest integer. 12. We have convex polygon in the plane, with vertices in (3, 0), (1, 2.5), (8, 9.8), (12, 8.5), and (11, 0.5). How many points with integer coordinates are contained in this polygon (not counting those on the perimeter)? 13. Suppose you randomly remove 15 paper sheets from book. Each sheet has page number written on either side of the sheet. Can these page numbers add up to 2000? Explain how you reached your conclusion. 14. We have rectangular pool table with near left corner in (0,0), and the far right corner in (5,11). ball is sent off from the near left corner in the direction (1,1). How many times will the ball bounce off wall before ending up in corner? Assume that the incoming angle is equal to the outgoing angle at each bounce. 15. have fifteen dice that want to place on flat empty wooden surface in such way that as many dice as possible will have all six faces concealed to an observer. The observer is allowed to walk around the table but not to touch the dice. Determine the maximum number of dice you can conceal, and explain how to best place the dice. 16. Suppose we have ordinary clock with an hour hand and minute hand. We are interested in the angle between the hands measured from the minute hand clockwise to the hour hand. For example, the angle is 30 degrees at 1pm. At how many occasions from 1pm to 2pm (inclusive) will the angle between the hands be an integer? 17. We write the prime numbers in six columns, as follows: In the first row, we write the first six primes: 2,3,5,7,11,13. In the second row, we write the next six primes in reverse order: 37,31,29,23,19,17. We keep on alternating between writing the next six primes in order on odd-numbered rows, and the next six primes in reverse order on even-numbered rows. After new row has been added, we compute the sum of each column. After how many rows will we see (for the first time) that the third column has the largest sum of all columns? Either answer with number, or explain why this will never happen. 18. We write the powers of 2 in five columns, as follows: In the first row, we write the first five powers of 2: 1,2,4,8,16. In the second row, we write the next five powers of 2 in reverse order: 512,256,128,64,32. We keep on alternating between writing the next five powers of two in order on odd-numbered rows, and the next five powers of two in reverse order on even-numbered rows. After new row has been added, we compute the sum of each column. After how many rows will we see (for the first time) that the second column has the largest sum of all columns? Either answer with number, or explain why this will never happen. 19. Suppose you have two ordinary six-sided dice which you want to place on wooden table so as few dots as possible are visible. The best way of doing this is placing them next to each other with the six dots facing downwards and the five dots facing each other. This way 2*(1+2+3+4)=20 dots will be visible altogether (the observer is allowed to walk around the table). We define v(n) to be the minimal number of dots visible on dice placed on table. You are given v(1)=15, v(2)=20, v(3)=26. What is v(37)? 20. Let us call positive integer \"good\" if it has 7 somewhere in its decimal representation. How many of the first 10 million positive integers are good? 21. have six paper slips which have numbers written on them: respectively 2,2,3,3,5, and 7. want to select subset of the paper slips and compute the sum of those numbers. Which is the smallest integer larger than 1 which cannot be obtained this way? 22. have collection of 5 triangles, T1 to T5. All the interior angles (when expressed as degrees) of T1 to T5 are distinct and are found in the set = {1,2,3,4,5,6,7,8,9,10,167,168,169 ,170,171}. You can now point to number in and ask an oracle which triangle this angle belongs to. What is the minimal number of such questions you have to ask before you are guaranteed to know which triangle each of the 15 numbers in belongs to? 23. have the points (0,1), (3,2), and (4,1), and construct circle where the three points lie on the perimeter. If we call the centre of the circle (xc, yc), what can you say about xc relative to the x-coordinates of the three points: is it smaller, equal, or larger? What about yc relative to the y-coordinates of the three points? 24. Suppose we sort all numbers from 1 to 1000 (inclusive) in an ascending order according the digit sum of the number. 501 would appear before 129 in such sorted list, since 5+0+1 is less than 1+2+9. If and have the same digit sum, but is smaller than j, then should appear before in the sorted list. At which position in the list would you find the number 721? 25. have rectangular grid of 80x80 identical squares, and number of tiles that can be placed on the grid. The tiles come in two varieties, both varieties covering 4 squares: 2x2-tiles and 1x4-tiles. The 1x4 tiles can be placed either horisontally or vertically. Is it possible to tile the grid with 799 2x2 tiles and 801 1x4-tiles? If it is possible, suggest method. If it is not possible, explain why not. 26. We want to assign number in {1 . . . 12} to each of the edges on cube so that (1) each edge is assigned different number, and (2) the sum of the four edges on one face of the cube will be the same for all faces. Determine whether this is possible or not. If it is possible, determine which number the edges on one face should add up to. 27. Divide the area from (0,0) to (3,3) into 9 equally large squares. We now want to fill in the perimeter of these 9 squares without lifting the pen. What is the minimal length of the line you need to draw? 28. We place the numbers 19 in 3x3 grid, and add all the numbers on the rows, the columns, and the two diagonals to form one big sum. The obtained sum will depend on how we placed the numbers in the grid. What is the difference between the largest and the smallest sums obtainable in this way? 29. Some integers can be written as 6x+7y, where and are non-negative integers, but there is largest integer that cannot be written this way. Find N, and explain why all numbers larger than can be written as 6x+7y. 30. square-shaped swimming pool has its opposite corners at (0,0) and (2,2). swimmer and runner makes the following bet: They will start at the same time at (0,0). The goal of the swimmer is to swim to either (1,2) or (2,1). If he can reach either of those points and the runner is not already there when the swimmer arrives, the swimmer will win the bet, otherwise the runner will win the bet. Suppose the runner is twice as fast as the swimmer. Assuming both players are using their best strategy, who will win the bet? Explain the best strategies for the runner and the swimmer. 31. We put the numbers 132 in random order and call this sequence S. We now want generate 33 permutations T0T32 of the numbers 132 so that Ti has the same number as at exactly positions. For instance, and T1 might both have the number 17 in position 22, but not overlap in any other positions. Either describe method of how to generate T0T32, or explain why it is impossible. 32. You have collection of 8 line segments, which have the length of the first 8 odd numbers. Can you construct square using each of these line segments exactly once? 33. You have collection of 10 line segments, which have the length of the first 10 odd numbers. Can you construct square using each of these line segments exactly once? 34. You have square with the dimensions 100x100 metres, and want to place rectangle 10 metres wide and metres long on top of the square so that no piece of the rectangle extends beyond the borders of the square. What is the maximum length possible for the rectangle? Round the answer downwards to an integer. 35. pandigital number contains all digits 09 at least once. What percentage of all 10-digit pandigital numbers are divisible by 3? 36. pandigital number contains all digits 09 at least once. What percentage of all 11-digit pandigital numbers are divisible by 3? 37. We have an empty screen whose lower left corner is at (0,0) and the upper right corner at (1000,1000). We open 5 windows on the screen: 1 2 3 4 5 Window number Lower left Upper right (900,400) (700,900) (400,800) (800,800) (1000,500) How large proportion of the screen background will still be visible after having opened the windows above? (100,200) (200,100) (0, 500) (300,200) (600,100) 38. Find positive integer such that the sum of the digits in n2 is 101, or explain why no such can exist. 39. In how many ways can you tile 10x2 grid with 1x2 dominoes? (We assume that all dominoes are blank and indistinguihable). 40. We have list of 100 numbers sort in ascending order, but we want the list sorted in descending order. The only operation at our disposal is to swap to numbers at position and + 2 in the list. Determine the number of such swap operations necessary to get the list sorted in descending order, or explain why it is not possible at all. 41. man is climbing staircase with 10 steps, numbered 110. Each second, the man climbs one step with probability 0.5, or descends one step with probability 0.5. If the man is at the bottom of the stairs (step 0), then obviously he cannot descend further, so in that case he stays put with probability 0.5, or climbs one step with probability 0.5. If the man starts at step 0, which is the expected step he will be at after 10 seconds? Round to the nearest integer. 42. We select sequence of 10 random digits with repetition (i.e., the same digit can be chosen more than once) using uniform distribution. What is the probability that the product of the digits in the sequence is odd? 43. We select sequence of 10 random digits with repetition (i.e., the same digit can be chosen more than once) using uniform distribution. What is the probability that the sum of the digits in the sequence is odd? 44. We have calculator that respects the ordinary laws of arithmetic precedence (e.g., 2+3*4 will result in 14). We now randomly press (with uniform probability) one of the digits 09, then either + or *, then another random digit, then then either + or * again, and then another random digit. Finally, we press =. What is the probability that the result is odd? 45. Consider the set of strings matching the regular expression \"a+b+a+\". How many strings of length 100 match this regular expression? Only count the cases where the whole string matches the regular expression. 46. You have cardboard cylinder whose outer diameter is 100 mm. You roll paper which is 100,000 mm long and 1 mm thick on the cylinder. How many times do you need to rotate the cylinder full 360 degrees before solution is correct, and you know the ID numbers of two of the triangles. To get the remaining ID numbers, ask about 2 and 3, and by process of elimination one can also conclude the ID of the triangle containing 5. (This took 6 questions). If 4 and 6 are not in the same triangle, solution is correct, and you know the ID numbers of the triangles containing 1, 4 and 6. Then ask about 2, and you will have all necessary information. (This took 5 questions). If the first two questions reveal that 1 and 8 are not in the same triangle, ask about 9. If 1 and 9 are in the same triangle, one of solutions C, D, is correct, otherwise one of F, G, is correct. In either case, asking about 2,6, and 3 will give all the necessary information (totally 6 questions). Appendix: Detailed results Table 1 details the results of the various models. Each problem has two entries for each model: green checkmark in the leftmost position indicates that the model got the right answer to the question, and checkmark in the rightmost position means that the solution is correctly motivated. For the most part, models get either both or none of these right, but there are number of instances when the model gives correct answer but an erroneous motivation. This suggests that it is essential not just to look at the final answer when evaluating the reasoning capabilities of models. you have rolled up the whole paper? Answer with the nearest higher integer. 47. We will call set of positive integers progressive if at least three of the numbers in the set belong to an arithmetic progression with common difference larger than 1. For example, set containing 2,6,42 is progressive, since these three numbers belong to the same arithmetic progression 2,4,6,8,...,40,42,... Either construct set of of positive integers which is not progressive and has least 5 members, or explain why no such set exists. 48. Can the numbers 125 be placed in different groups such that the product of the numbers in each group is the same? Explain. 49. Suppose = a1 + a2 + . . . ak, and consider the claim \"n is divisible by if and only if each ai is divisible by d\". Is (a) the \"if\" part the claim guaranteed to be true but not the \"only if\" part, or (b) is it the other way around, or (c) are both guaranteed to be true, or (d) is neither? Explain. 50. Anna and Bert is playing the following game: First, positive integer less than 1000 is randomly generated. Anna goes first and chooses to subtract either 1 or 2 from the number. Then Bert can choose to subtract either 1 or 2 from the resulting number. Then its Annas turn again, and the players keep alternating, subtracting either 1 or 2. The player who reaches negative infinity wins. Is there winning strategy for either Anna or Bert? Explain. Appendix: Solution to problem 22 The answer is that 6 questions are sufficient and also necessary in the worst case. Careful analysis of the problem reveals that there are 8 different possible configurations, called A-H (see Figure 4)): In addition, the triangles might have different ID numbers, e.g. (1,8,171) might be any of T1 T5, so the total number of possibilities are 5! 8 = 960. The stategy for querying the oracle is described visually in Figure 4. First ask the oracle about about 1 and 8. If 1 and 8 are in the same triangle, ask about 4 and 6. If they are in the same triangle, (1,8,171) (4,6,170), (2,9,169), (3,10,167), (5,7,168) (4,9,167), (2,10,168), (3,7,170), (5,6,169) (4,7,169), (2,10,168), (3,6,171), (5,8,167) (1,9,170) (4,5,171), (2,10,168), (3,8,169), (6,7,167) (4,8,168), (2,7,171), (3,10,167), (5,6,169) (4,5,171), (2,8,170), (3, 9, 168), (6, 7, 167) (1,10,169) (4,6,170), (2,7,171), (3,9,168), (5,8,167) (4,9,167), (2,8,170),(3,6,171), (5, 7, 168) Figure 4: The possible triangles of problem 22. # 1 2 3 5 6 7 8 9 11 12 13 14 15 17 18 19 20 21 23 24 25 26 27 29 30 31 32 33 35 36 37 38 39 41 42 43 44 45 47 48 49 50 Mixtral 8x7b Llama 3.3-70B versatile Gemini 2.0-pro-exp gpt-4o o1-preview o1 o3-mini deepseek-r Figure 5: Detailed results"
        }
    ],
    "affiliations": [
        "KTH Royal Institute of Technology, Stockholm, Sweden"
    ]
}