{
    "paper_title": "Qwen3-Omni Technical Report",
    "authors": [
        "Jin Xu",
        "Zhifang Guo",
        "Hangrui Hu",
        "Yunfei Chu",
        "Xiong Wang",
        "Jinzheng He",
        "Yuxuan Wang",
        "Xian Shi",
        "Ting He",
        "Xinfa Zhu",
        "Yuanjun Lv",
        "Yongqi Wang",
        "Dake Guo",
        "He Wang",
        "Linhan Ma",
        "Pei Zhang",
        "Xinyu Zhang",
        "Hongkun Hao",
        "Zishan Guo",
        "Baosong Yang",
        "Bin Zhang",
        "Ziyang Ma",
        "Xipin Wei",
        "Shuai Bai",
        "Keqin Chen",
        "Xuejing Liu",
        "Peng Wang",
        "Mingkun Yang",
        "Dayiheng Liu",
        "Xingzhang Ren",
        "Bo Zheng",
        "Rui Men",
        "Fan Zhou",
        "Bowen Yu",
        "Jianxin Yang",
        "Le Yu",
        "Jingren Zhou",
        "Junyang Lin"
    ],
    "sections": [
        {
            "title": "Abstract",
            "content": "We present Qwen3-Omni, a single multimodal model that, for the first time, maintains state-of-the-art performance across text, image, audio, and video without any degradation relative to single-modal counterparts. Qwen3-Omni matches the performance of same-sized single-modal models within the Qwen series and excels particularly on audio tasks. Across 36 audio and audio-visual benchmarks, Qwen3-Omni achieves open-source SOTA on 32 benchmarks and overall SOTA on 22, outperforming strong closed-source models such as Gemini-2.5-Pro, Seed-ASR, and GPT-4o-Transcribe. Qwen3-Omni adopts a Thinker-Talker MoE architecture that unifies perception and generation across text, images, audio, and video, yielding fluent text and natural real-time speech. It supports text interaction in 119 languages, speech understanding in 19 languages, and speech generation in 10 languages. To reduce first-packet latency in streaming synthesis, Talker autoregressively predicts discrete speech codecs using a multi-codebook scheme. Leveraging the representational capacity of these codebooks, we replace computationally intensive block-wise diffusion with a lightweight causal ConvNet, enabling streaming from the first codec frame. In cold-start settings, Qwen3-Omni achieves a theoretical end-to-end first-packet latency of 234 ms. To further strengthen multimodal reasoning, we introduce a Thinking model that explicitly reasons over inputs from any modality. Since the research community currently lacks a general-purpose audio captioning model, we fine-tuned Qwen3-Omni-30B-A3B to obtain Qwen3-Omni-30B-A3B-Captioner, which produces detailed, low-hallucination captions for arbitrary audio inputs. Qwen3-Omni-30B-A3B, Qwen3-Omni-30B-A3B-Thinking, and Qwen3-Omni-30B-A3B-Captioner are publicly released under the Apache 2.0 license."
        },
        {
            "title": "Start",
            "content": "5 2 0 2 2 2 ] . [ 1 5 6 7 7 1 . 9 0 5 2 : r 2025-09-23 Qwen3-Omni Technical Report Qwen Team https://github.com/QwenLM/Qwen3-Omni https://huggingface.co/spaces/Qwen/Qwen3-Omni-Demo https://modelscope.cn/studios/Qwen/Qwen3-Omni-Demo"
        },
        {
            "title": "Abstract",
            "content": "We present Qwen3-Omni, single multimodal model that for the first time maintains state-of-the-art performance across text, image, audio, and video without any degradation relative to single-modal counterparts. Qwen3-Omni matches the performance of same-sized single-modal models within the Qwen series and excels particularly on audio tasks. Across 36 audio and audio-visual benchmarks, Qwen3-Omni achieves opensource state-of-the-art (SOTA) on 32 benchmarks and overall SOTA on 22, outperforming strong closed-source models such as Gemini-2.5-Pro, Seed-ASR, and GPT-4o-Transcribe. Qwen3-Omni adopts ThinkerTalker Mixture-of-Experts (MoE) architecture that unifies perception and generation across text, images, audio, and video, yielding fluent text and natural real-time speech. It supports text interaction in 119 languages, speech understanding in 19 languages and speech generation in 10 languages. The system can process audio recordings up to 40 minutes per instance for ASR and spoken-language understanding, enabling high-quality audio and audiovisual experiences across locales. It demonstrates strong instruction following and allows fine-grained customization of conversational tone and persona via user-defined system prompts. To reduce first-packet latency in streaming synthesis, the Talker autoregressively predicts discrete speech codecs using multi-codebook scheme. Leveraging the representational capacity of these codebooks, we replace computationally intensive block-wise diffusion with lightweight causal ConvNet, enabling streaming from the first codec frame. In cold-start settings (no prior context), Qwen3-Omni achieves theoretical end-to-end first-packet latency of 234 ms. To further strengthen multimodal reasoning, we introduce Thinking model that explicitly reasons over inputs from any modality. Since the research community currently lacks general-purpose audio captioning model, we fine-tuned Qwen3-Omni-30B-A3B to obtain Qwen3-Omni-30B-A3B-Captioner, which produces detailed, low-hallucination captions for arbitrary audio inputs. Qwen3-Omni-30B-A3B, Qwen3-Omni-30B-A3B-Thinking and Qwen3-Omni-30B-A3B-Captioner are publicly released under the Apache 2.0 license."
        },
        {
            "title": "Introduction",
            "content": "Humans perceive visual and auditory inputs in parallel, cognitively process these signals, and emit responses through textual expression, vocalization, and tool-mediated or bodily actions, facilitating information exchange with other organisms and demonstrating intelligence. Building on the rapid advances in the understanding and reasoning capabilities of unimodal large models (Brown et al., 2020; OpenAI, 2023; Gemini Team, 2024; Anthropic, 2023a;b; 2024; Bai et al., 2023a; Yang et al., 2024; 2025a; Touvron et al., 2023; Dubey et al., 2024; Li et al., 2023; Liu et al., 2023; Zhu et al., 2023; Bai et al., 2023b; 2025; Chu et al., 2023; 2024), natively multimodal systems have drawn substantial attention (OpenAI, 2024; Comanici et al., 2025; Xu et al., 2025). Human learning typically progresses through the coordinated use of multiple modalities, where complementary specialization and cross-modal synergy improve learning efficiency. However, contemporary LLM-centric multimodal models often exhibit modality trade-offs, with gains in one modality accompanied by degradation in others. In this report, we take step toward resolving this limitation by exploring integrated multimodal training within the prevailing LLM-based paradigm. We demonstrate that joint multimodal training can achieve parity across all modalitiesi.e., no modality-specific performance degradationwhile markedly enhancing cross-modal capabilities such as video understanding. key ingredient is mixing unimodal and cross-modal data during the early stage of text pretraining. As evidenced by Qwen3-Omni-30B-A3BBase, its text and vision performance is on par with same-sized single-modal text and vision base models across extensive benchmarks, while simultaneously exhibiting strong audio competence, audiovisual understanding, cross-modal thinking, and real-time audiovisual interaction. The development of non-degrading multimodal systems is an achievable objective. Such systems are characterized by two key properties: first, their ability to match the performance of specialized unimodal models in their respective 1 Figure 1: Qwen3-Omni is unified end-to-end model capable of processing multiple modalities, such as text, audio, image and video, and generating real-time text or speech response. Based on these features, Qwen3-Omni supports wide range of tasks, including but not limited to voice dialogue, video dialogue, and video reasoning. tasks, and second, their capacity to facilitate novel cross-modal reasoning and interaction. These latter capabilities represent significant advantage, as they are not present in traditional unimodal approaches. Qwen3-Omni builds on the ThinkerTalker architecture introduced in Qwen2.5-Omni (Xu et al., 2025) and introduces five key upgrades: (1) both the Thinker and Talker are upgraded to Mixture-of-Experts (MoE) designs; (2) we replace Whisper audio encoder with our AuT (Audio Transformer) encoder, trained from scratch on 20 million hours of supervised audio, yielding stronger general-purpose audio representations. AuT employs block-wise window attention to enable real-time prefill caching; (3) on the speech generation side, we adopt multi-codebook representation, whose increased capacity supports faithful modeling of diverse voices, paralinguistic cues, and acoustic phenomena; (4) the Talker shifts from single-track to multi-track codec modeling, autoregressively predicting multiple codebook layers via MTP modules, while the waveform stage (Code2Wav) replaces block-wise DiT with lightweight convolutional network (ConvNet); and (5) the input and output audio code rates are reduced to 12.5 Hz, with the output codec enabling single-frame, immediate speech synthesis. Taken together, these changes enable low-latency speech interaction under high concurrency in industrial-scale deployments. Compared with Qwen2.5-Omni, Qwen3-Omni introduces four major improvements: (1) support for audio understanding on inputs exceeding 40 minutes; (2) expanded language coverage to 119 written languages, 19 and 10 spoken languages for understanding and generation respectively ; (3) Thinking model enabling full-modality reasoning, including audiovideo and audio-only scenarios; and (4) improved streaming performance with end-to-end latency as low as 234 ms. Critically, Qwen3-Omni maintains state-of-the-art performance on text and visual modalities without degradation relative to same-size single-model Qwen counterparts. Across 36 audio and audio-visual benchmarks, it achieves open-source SOTA on 32 and sets the SOTA on 22, outperforming strong closed-source systems such as Gemini 2.5 Pro, Seed-ASR, and GPT-4o-Transcribe. The remainder of this paper is organized as follows. Section 2 presents the algorithms and architecture of Qwen3-Omni. Sections 3 and 4 describe the pretraining and post-training datasets and pipelines, respectively. Section 5 reports the experimental results. Section 6 compares Qwen3-Omni with recent Qwen models of comparable parameter scales, demonstrating multimodal performance without modalityinduced degradation. 2 Figure 2: The overview of Qwen3-Omni. Qwen3-Omni adopts the Thinker-Talker architecture. Thinker is tasked with text generation while Talker focuses on generating streaming speech tokens by receives high-level representations directly from Thinker. To achieve ultralow-latency streaming, Talker autoregressively predicts multi-codebook sequence. At each decoding step, an MTP module outputs the residual codebooks for the current frame, after which the Code2Wav renderer incrementally synthesizes the corresponding waveform, enabling frame-by-frame streaming generation."
        },
        {
            "title": "2.1 Overview",
            "content": "As shown in Figure 2, Qwen3-Omni employs Thinker-Talker architecture (Xu et al., 2025). Compared with Qwen2.5-Omni, Qwen3-Omni introduces the following changes for greater scalability and control: Both the Thinker and Talker adopt Mixture-of-Experts (MoE) architectures to support high concurrency and fast inference. Talker no longer consumes the Thinkers high-level text representations and conditions only on audio and visual multimodal features. This design is motivated by: (i) for textual content, discrete tokens and embeddings are effectively information-equivalent; and (ii) multimodal conditioning is necessary for audiovideocoordinated speech generation such as preserving prosody/timbre in speech translation. Moreover, this decoupling allows external modules (e.g., RAG, function calling, safety filters) to intervene on the Thinkers textual output and, if desired, supply text to the Talker via controlled preprocessing for streaming synthesis. Since textual representations are decoupled, the Thinker and Talker can use distinct system prompts, independently controlling the Thinkers response style and the Talkers audio style. The Talker adopts multi-codebook autoregressive scheme: Talker generates one codec frame 3 per step, while the MTP module produces the remaining residual codebooks. The Code2Wav is implemented as lightweight causal ConvNet, simplifying the final stage of audio synthesis. During training and inference, the Talker directly ingests high-dimensional multimodal features from the Thinker and shares access to the full conversational history. As result, the system operates as cohesive single model, enabling end-to-end training and unified inference. In the following sections, we first introduce with our newly proposed AuT encoder, including its training methodology. Then, describe how Thinker processes various inputs. We then detail Talkers multicodebook streaming speech generation. Finally, we highlight series of improvements on both the understanding and generation modules aimed at achieving ultralow-latency, end-to-end streaming audio inference. 2.2 Audio Transformer (AuT) Figure 3: The overview of AuT. AuT is an attention-encoder-decoder based auto-regressive model, which is trained from scratch on 20 million hours of supervised audio. Qwen3-Omni employs the AuT encoder as the audio encoder to obtain general purpose audio representations at token rate of 12.5Hz. Audio Transformer (AuT) is an attention-encoder-decoder model, as is shown in Figure 3, trained from scratch on 20 million hours of supervised audio data. During training, the filter bank features of the audio are downsampled 8 times using Conv2D blocks before the attention layers, reducing the token rate to 12.5 Hz. To learn stronger and more general-purpose audio representations, AuT is trained on large-scale audio datasets with both speech recognition and audio understanding tasks. Specifically, the training data includes 80% Chinese and English pseudo-labeled ASR data, 10% ASR data from other languages, and 10% audio understanding data. To balance the efficiency of real-time prefill caching with the performance for offline audio tasks, AuT utilizes flash attention with dynamic attention window sizes, covering attention query patterns ranging from 1 to 8 seconds. In Qwen3-Omni, we employ the AuT encoder as the audio encoder, which contains approximately 0.6B parameters. 2.3 Perceivation Text, Audio, Image and Video (w/o Audio). Thinker converts text, audio, image, and video (without audio) into series of representations for input. For text inputs, we use Qwens tokenizer (Yang et al., 2025a), which applies byte-level byte-pair encoding with vocabulary of 151,643 regular tokens. For audio inputs and audio extracted from video, we resample to 16 kHz and convert the raw waveform into 128 channel mel-spectrogram with 25 ms window and 10 ms hop. We adopt AuT encoder as our audio encoder, which is trained from scratch on 20 millions hours of audio data, and each frame of the audio representation corresponds to approximately an 80 ms segment of the original audio signal. Furthermore, we employ the vision encoder from Qwen3-VL, initialized from SigLIP2-So400m (Tschannen et al., 2025) with approximately 543 million parameters, enabling handling of both image and video inputs. The vision encoder is trained on mixture of image and video data, ensuring strong image understanding and video comprehension. To preserve video information as completely as possible while aligning with the audio sampling rate, we sample video frames at dynamic frame rate. Video and Multimodal Position Embedding (TM-RoPE) Drawing inspiration from Qwen2.5-Omni, we employs Time-aligned Multimodal Rotary Position Embedding (TM-RoPE), which extends the Multimodal Rotary Position Embedding (M-RoPE) (Bai et al., 2023b) by incorporating absolute temporal information. TM-RoPE factorizes the conventional rotary position embedding into three distinct dimensions: temporal, height, and width. In the original M-RoPE formulation, temporal dependencies are modeled using the initial 16 rotary angles, which correspond to higher frequencies and exhibit stronger oscillatory patterns. While this design is effective for capturing fine-grained local temporal variations, it can impede the models ability to extrapolate over extended sequences. To address this limitation, we introduce modified allocation of rotary angles. Specifically, the temporal, height, and width dimensions are interleaved and assigned 24, 20, and 20 rotary angles, respectively. This redistribution fosters more balanced representation of both local semantics and long-range dependencies, thereby enhancing the models overall performance. The application of TM-RoPE is tailored to the specific modality of the input data. For text inputs, the three components share identical position identifiers, rendering TM-RoPE functionally equivalent to one-dimensional RoPE (Su et al., 2024). Similarly, audio inputs utilize shared position IDs but are further augmented with absolute temporal encodings, where each temporal ID corresponds to duration of 80 ms. For image data, constant temporal ID is assigned to all visual tokens, while their distinct row and column positions determine the height and width IDs. In the context of multimodal audiovisual streams, the audio component is encoded with temporal ID for every 80 ms. The video is treated as sequence of frames with monotonically increasing temporal IDs that are dynamically adjusted based on their actual timestamps to ensure consistent temporal resolution of 80 ms per ID. The height and width IDs for video frames are assigned in the same manner as for still images. To prevent positional conflicts when processing multiple modalities, the position numbering is made contiguous, with each subsequent modality commencing from one plus the maximum position ID of the preceding modality. This refined approach to positional encoding enables the model to effectively integrate and jointly model information from diverse modalities. In departure from Qwen2.5-Omni, which segments audiovisual representations into fixed 2-second chunks, Qwen3-Omni directly aligns these representations using their temporal IDs, which are explicitly anchored to absolute time. This design choice affords the model the flexibility to support streaming inputs of arbitrary duration. 2.4 Speech Generation For speech synthesis in multi-turn dialogues, our Talker module is conditioned on rich context inherited from \"Thinker\" component, comprising historical textual tokens, multimodal representations, and the current turns streamed text. This reliance on long-context information is critical, as high-fidelity speech synthesis must adapt acoustic attributes like prosody, loudness, and emotion to the ongoing discourse, principle well-established in context-aware generative models. Architecturally, our approach departs from Xu et al. (2025) by operating directly on RVQ tokens. The Talker employs hierarchical prediction scheme: the backbone ingests the aggregated codebook features of the current frame and uses linear head to predict the zeroth codebook, after which multi-token prediction (MTP) module generates all residual codebooks. This strategy enables the model to learn complete representation of acoustic details, enhancing vocal expressivity. Consequently, waveform reconstruction is simplified to lightweight causal ConvNet (Code2Wav), which significantly reduces inference latency and computational cost (FLOPs) while achieving superior audio fidelity compared to more complex DiT-based vocoders. 2.5 Designs for Streaming and Concurrency In streaming audiovisual interaction scenarios, the first-packet latency is critical factor affecting user experience, and the models concurrency capability is key to reducing service costs and improving response speed. This section discusses how Qwen3-Omni enhances concurrency and reduces first-packet latency through algorithmic and architectural optimizations. Chunked Prefilling and MoE Architecture. In Qwen3-Omni, we retain the chunked-prefilling mechanism as implemented in Qwen2.5-Omni, whose audio and vision encoders are capable of outputting chunks along the temporal dimension. During real-time interaction, Thinker and Talker modules perform 5 Table 1: The architectural design of Qwen3-Omni-30B-A3B and the end-to-end first-packet latency for Audio/Video (ms). Module Architecture Params Audio Encoder Vision Encoder Thinker Talker MTP Code2wav AuT SigLIP2-So400M MoE Transformer MoE Transformer Dense Transformer ConvNet 650M 540M 30B-A3B 3B-A0.3B 80M 200M Streaming - End-to-End First-Packet Latency: 234/547ms asynchronous prefilling: when Thinker completes prefilling the current chunk, its output high-level representations are immediately used to prefill the Talkers current chunk asynchronously, while Thinker prefills its next chunk. This approach significantly reduces the Time-To-First-Token (TTFT) for both the Thinker and the Talker. Architecturally, both Thinker and the Talker in Qwen3-Omni adopt the MoE design, which is highly effective for improving service throughput. Compared to dense models, the MoE architecture significantly decreases IO consumption arising from KV cache during processing of long sequences, thereby increasing tokens per second (TPS) during generation and enhancing concurrency. Streaming Multi-Codebook Codec Generation. To minimize the users waiting time for receiving the first generated packet, we propose left context only multi-codebook generation mechanism. As shown in Figure 2, once Talker generates the first token, the MTP module predicts the remaining tokens for the current frame. These tokens are then decoded into waveform by streaming multi-codebook codec decoder that only attends to the left context. Unlike Qwen2.5-Omni that requires waiting for sufficient block-context from the Talker before synthesis, Qwen3-Omni can output the waveform immediately after the Talker generates each token, significantly reducing first-packet latency. Lightweight MTP module and ConvNet. Both the MTP module and codec decoder are lightweight modules, which have low computational FLOPs and support batched inference, making them well-suited for high-concurrency scenarios. The MTP Module is an ultra-lightweight fixed-step autoregressive dense transformer, with low memory bandwidth requirements on inference hardware, thereby naturally enabling efficient batch processing of high throughput requests. Its fixed-step autoregressive inference mechanism allows it to effectively leverage fixed KV cache memory space for acceleration, achieving low inference latency. Meanwhile, the ConvNet-based codec decoder also achieves high throughput with low latency because its convolutional architecture enjoys extensive hardware acceleration support across diverse inference platforms, and it enables efficient batched inference. Table 2: Theoretical First-Packet Latency of Qwen3-Omni wit Different Concurrency. Qwen3-Omni-30B-A3B 1 Concurrency 4 Concurrency 6 Concurrency Thinker-Talker Tail Packet Preprocessing Latency Thinker Time-to-First-Token (TTPT) Talker Time-to-First-Token (TTPT) MTP Module Time Cost Per Token Codec Decoder Time Cost Per Code 72/160ms 88/160ms 57/210ms 14ms 3ms 94/180ms 468/866ms 145/450ms 16ms 5ms 100/200ms 673/1330ms 376/734ms 18ms 5ms Overral Latency (Audio/Video) 234/547ms 728/1517ms 1172/2284ms Thinker Token Generation Rate (TPS) Talker Token Generation Rate (TPS) 75 tokens/s 140 tokens/s 63 tokens/s 125 tokens/s 53 tokens/s 110 tokens/s Generation RTF(Real Time Factor) 0.47 0.56 0.66 Table 2 presents the theoretical first-packet latency for Qwen3-Omni under typical computational resources across varying concurrency scenarios. Experiments are conducted on the vLLM framework (Kwon et al., 2023) to process concurrent audiovisual streams, with optimizations applied via torch.compile and CUDA Graph acceleration to the MTP Module and codec decoder. Several factors influence the total first-packet latency. First, the model sizes of Thinker and Talker impact their tail packet preprocessing latency (multi-modal data preprocessing and inference for Audio and Vision Encoder) and Time-To-FirstToken (TTPT). Second, the architectures and sizes of the MTP Module and Codec Decoder affect their inference latency. Due to the sequential dependency between these components, the total first-packet 6 latency represents the sum of these individual latencies. As shown in the results, the MoE architecture of Thinker and Talker ensures that their prefill latency and TTPT remain largely unaffected under high concurrency. Meanwhile, the lightweight design of the MTP Module and Codec Decoder minimizes their computational overhead, resulting in lower impact on first-packet latency. Furthermore, after the initial packet is output and the model starts streaming audio synthesis, the 12.5Hz token rate Talker requires only one token to synthesize 80ms audio. Consequently, the Generation Real Time Factor (RTF) is calculated by dividing the sum of: (1) the time taken by Thinker and Talker to generate one token; and (2) the processing time per token for the MTP Module and Codec Decoder by 80ms. As demonstrated, the RTF consistently remains below 1 across varying concurrency levels, ensuring that users receive continuously streaming audio responses."
        },
        {
            "title": "3 Pretraining",
            "content": "Table 3: Languages and dialects support of Qwen3-Omni-30B-A3B. Modality # Langs Languages Text Speech Input Speech Output 119 19 See Qwen3 for the full list. ar, de, en, es, fr, id, it, ja, ko, ms, nl, pt, ru, th, tr, ur, vi, yue, zh de, en, es, fr, it, ja, ko, pt, ru, zh Qwen3-Omni is pre-trained on diverse dataset that encompasses multiple languages and dialects as shown in Table 3 and modalities, including image-text, video-text, audio-text, video-audio, videoaudio-text, and pure text corpora. Unlike Qwen2.5-Omni, which uses single prompt for each task, we employ wider range of natural language prompts to enhance both the generalization ability and instruction-following capabilities. To achieve robust performance across all modalities, our training strategy incorporates both unimodal and cross-modal data from the early pretraining stage. The pre-training of Qwen3-Omni is structured into three distinct stages. In the first stage, we lock the LLM parameters and focus on training the vision and audio encoders, utilizing vast corpus of audio-text and image-text pairs to enhance semantic understanding within the LLM. In the second stage, we unfreeze all parameters and train with wider range of multimodal data for more comprehensive learning. In the final stage, we use data with sequence length of 32,768 to enhance the models ability to understand complex long-sequence data: (1) Encoder Alignment Stage (S1): During the initial pretraining phase, the LLM component of Qwen3-Omni is initialized with parameters from Qwen3 (Yang et al., 2025a), while the vision encoder is adopted from Qwen3-VL, and the audio encoder is initialized with AuT. The two encoders are trained separately on the fixed LLM, with both initially focusing on training their respective adapters before training the encoders. We abandon the stage used in Bai et al. (2025); Xu et al. (2025) where the encoder and adapter are trained jointly while keeping the LLM frozen, because this approach may cause the encoder to compensate for the limitations of the frozen LLM, which can lead to degraded perception capabilities. (2) General Stage (S2): The second phase of pretraining utilizes large-scale dataset containing approximately 2 trillion tokens, with the following distribution across modalities: text (0.57 trillion), audio (0.77 trillion), image (0.82 trillion), video (0.05 trillion), and video-audio (0.05 trillion). During this stage, the introduction of more diverse multimodal data and tasks enhances the models understanding and interaction capabilities in auditory, visual, textual, and audiovisual information. (3) Long Context Stage (S3): In the final pre-training phase, we increased the maximum token length from 8,192 to 32,768 and also raised the proportion of long audio and long video in the training data. Experimental results indicate that these adjustments lead to significant improvements in the models ability to understand long sequence data."
        },
        {
            "title": "4 Post-training",
            "content": "4.1 Thinker The post-training phase comprises three-stage training process for Thinker, enabling Qwen3-Omni to possess instruction-following capabilities. The dataset, designed in the ChatML (OpenAI, 2022) format, includes pure text-based dialogue data, visual modality conversation data, audio modality conversation data, and mixed-modality conversation data. 7 In the first stage, we introduce lightweight Supervised Fine-Tuning (SFT) to bridge the gap between pretrained representations and downstream task requirements through targeted instruction optimization. SFT deliberately diverges from the pretraining data schema while maintaining architectural consistency with the pretrained model, enabling efficient knowledge transfer and preserving the completeness of the pretrained features. The second stage adopts the Strong-to-Weak Distillation pipeline as described in Qwen3 (Yang et al., 2025a) to further improve model performance. This distillation process consists of two main phases: (1) Off-policy Distillation: In the initial phase, outputs generated by teacher models are combined to provide response distillation. This helps lightweight student models acquire fundamental reasoning abilities, establishing strong foundation for subsequent on-policy training. (2) On-policy Distillation: In the second phase, the student model generates the responses based on sampled prompts. These on-policy sequences are then used for fine-tuning, where the students predicted logits are aligned with those of teacher model (Qwen3-32B or Qwen3-235B-A22B) by minimizing the KL divergence. Finally, we leverage GSPO (Zheng et al., 2025) to comprehensively enhance the models capabilities and stability across various modalities, including text, image, video, and audio. To provide feedback for the aforementioned modalities, we employ two different types of rewards: Rule-based Reward: For verifiable multimodal tasks (e.g., mathematics, coding, instruction following), the reward signal is derived from set of predefined rules. Well-designed rule-based rewards can assess the correctness of model outputs with high precision, preventing issues like reward hacking. Model-based Reward: To assess performance on multimodal tasks that lack objective, predefined evaluation metrics, we adopt an LLM-as-a-judge protocol. The role of the automated evaluator is filled by Qwen3 for general tasks, while the specialized vision-language model, Qwen2.5-VL, is used for visually-grounded tasks. To ensure more robust and grounded assessment, the LLM evaluator is furnished with the corresponding ground-truth or reference answer for given query, where applicable. 4.2 Talker We introduce four-stage training process for Talker, enabling Qwen3-Omni to generate speech response simultaneously with text. All training data is structured in the ChatML format to ensure consistency with Thinker. In the first stage, we leverage hundreds of millions of speech data with multimodal context to train Talker, establishing monotonic mapping from multimodal representation to speech. In the second stage, we perform Continual Pretraining (CPT) with high-quality data, which alleviates hallucinations caused by noisy data in the first stage and significantly improve the quality of generated speech. Concurrently, we perform long-context training that enhances Talkers ability to process extended and complex inputs and generate contextually appropriate speech response. In the third stage, to improve the generalization of multilingual speech generation and system stability, we construct preference pairs from diverse multilingual speech samples and optimize the model using Direct Preference Optimization (DPO) (Rafailov et al., 2023). Finally, we apply speaker fine-tuning on the aforementioned base model, enabling Talker to adopt specific voices while refining the naturalness, expressiveness, and controllability of its speech response. 4.3 Captioner Captioning is foundational task in multimodal understanding, integral to the training and evaluation of large multimodal models. However, the vast majority of existing research has concentrated on visual captioning, largely neglecting the audio modality. This omission is significant, as auditory perception is crucial component of human sensory experience and interaction with the world. To address this gap and facilitate more comprehensive research in multimodal perception, we introduce the Qwen3-Omni-30BA3B-Captioner. This model was developed by fine-tuning the Qwen3-Omni-30B-A3B on large-scale dataset of detailed audio descriptions. The resulting system generates detailed, low-hallucination captions for arbitrary audio inputs. The Appendix 9.2 provides qualitative results that demonstrate our models captioning capabilities across diverse acoustic scenarios."
        },
        {
            "title": "5 Evaluation",
            "content": "A comprehensive evaluation was performed on suite of models, including Qwen3-Omni-30B-A3BInstruct, Qwen3-Omni-30B-A3B-Thinking, and two in-house developed variants, designated Qwen3Omni-Flash-Instruct and Qwen3-Omni-Flash-Thinking. These Flash models were designed to improve both computational efficiency and performance efficacy, integrating new functionalities, notably the support for various dialects. The evaluation results are divided into two main categories: understanding (XText) and speech generation (XSpeech). 5.1 Evaluation of XText In this section, we evaluate Qwen3-Omnis ability to comprehend various multimodal inputs (text, audio, vision, and audiovisual video) and generate textual responses. TextText Our evaluation of Qwen3-Omni on text text primarily focuses on general tasks, reasoning ability, coding ability, alignment tasks, agent, and multilingual tasks. Specifically, we utilize MMLURedux (Gema et al., 2024) and GPQA (Rein et al., 2023) for general tasks, AIME25 (AIME, 2025) and ZebraLogic (Lin et al., 2025) for reasoning evaluation, MultiPL-E (Cassano et al., 2023) for coding, IFEval (Zhou et al., 2023), Creative Writing V3 (Paech, 2024) and WritingBench (Wu et al., 2025b) for alignment tasks, BFCL-v3 (Yan et al., 2024) for agent evaluation, MultiIF (He et al., 2024) and PolyMath (Wang et al., 2025c) for multilingual tasks. AudioText The evaluation can be categorized into basic audio tasks, including Automatic Speech Recognition (ASR), Speech-to-Text (S2TT), and Music Understanding, as well as advanced audio tasks, including Voice Chatting and Audio Reasoning. For music understanding, we use RUL-MuchoMusic (Zang et al., 2025) for comprehensive evaluation of the music understanding capabilities of the model. We utilize MMAU (Sakshi et al., 2024) and MMSU (Wang et al., 2025a) for audio reasoning tasks, VoiceBench (Chen et al., 2024b) for voice-chatting tasks. We also employ multiple datasets including GTZAN (Tzanetakis & Cook, 2002), four subsets of MTG-Jamendo (MTG, Bogdanov et al. (2019)), and MagnaTagATune (Law et al., 2009) to evaluate the models capabilities across various music information retrieval tasks including genre identification, emotion and theme recognition, instrument recognition and music keyword annotation. We follow the evaluation set composition in MARBLE (Yuan et al., 2023) for GTZAN, MTG-Jamendo and MagnaTagATune. VisionText The evaluation of the models vision-to-text capabilities encompasses suite of benchmarks targeting diverse and challenging tasks. To assess performance in general visual question answering, the model is evaluated on MMStar (Chen et al., 2024a), HallusionBench (Guan et al., 2024), and MM-MT-Bench (Agrawal et al., 2024). For the specialized domain of mathematical and STEM reasoning, we utilize MathVista (Lu et al., 2024), MathVision (Wang et al., 2024a), MMMU (Yue et al., 2023), and MMMU-Pro (Yue et al., 2024). The models proficiency in document understanding is measured using the AI2D (Kembhavi et al., 2016) and ChartQA (Masry et al., 2022) benchmarks. Furthermore, the models numerical reasoning and counting abilities are specifically tested on CountBench (Paiss et al., 2023). To evaluate performance on dynamic visual data, we report results on three long video understanding benchmarks: Video-MME (Fu et al., 2024), LVBench (Wang et al., 2024b), and MLVU (Zhou et al., 2025a). AudioVisual VideoText To evaluate the models ability to process dynamic multi-modal information, we first assessed its performance on the WorldSense benchmark (Hong et al., 2025). This benchmark is designed to measure the integration of visual and auditory signals, foundational capability for operating in complex, open-world environments. To further examine the models higher-order cognitive functions, we then evaluated its performance on two audiovisual reasoning benchmarks: DailyOmni (Zhou et al., 2025b) and VideoHolmes (Cheng et al., 2025). 5.1.1 Performance of TextText We compare Qwen3-Omni with other leading large language models (thinking or instruct). According to Table 4 and 5, notably, despite smaller parameter count, Qwen3-Omni-30B-A3B-Instruct surpasses the performance of the larger open-source model Qwen3-235B-A22B Non-Thinking and the formidable closed-source model GPT-4o-0327 across suite of benchmarks, including GPQA, AIME25, ZebraLogic, WritingBench, and PolyMath. Concurrently, Qwen3-Omni-30B-A3B-Thinking demonstrates performance comparable to that of Gemini-2.5-Flash-Thinking and Qwen3-235B-A22B Non-Thinking. Furthermore, Qwen3-Omni-30B-A3B exhibits textual capabilities on par with its text-only counterparts, namely the Qwen3-30B-A3B-Instruct-2507 and Qwen3-30B-A3B-Thinking-2507. 9 Table 4: Text Text performance of Qwen3-Omni-Instruct and other non-reasoning baselines. The highest scores are shown in bold. GPT-4oQwen3-235B-A22B Non Thinking Qwen3-30B-A3B -Instruct-2507 Qwen3-Omni-30B-A3B -Instruct Qwen3-Omni-Flash -Instruct GeneralTasks Reasoning MMLU-Redux GPQA AIME25 ZebraLogic Code MultiPL-E Alignment Tasks IFEval Creative Writing v3 WritingBench Agent BFCL-v3 Multilingual Tasks MultiIF PolyMATH 91.3 66.9 26.7 52. 82.7 83.9 84.9 75.5 66.5 70.4 25.5 89.2 62.9 24.7 37. 79.3 83.2 80.4 77.0 68.0 70.2 27.0 89.3 70.4 61.3 90. 83.8 84.7 86.0 85.5 65.1 67.9 43.1 86.6 69.6 65.0 76. 81.4 81.0 80.6 82.6 64.4 64.0 37.9 86.8 69.7 65.9 76. 81.5 81.7 81.8 83.0 65.0 64.7 39.3 Table 5: Text Text performance of Qwen3-Omni-Thinking and other reasoning baselines. The highest scores are shown in bold. Gemini-2.5-Flash Thinking Qwen3-235B-A22B Thinking Qwen3-30B-A3B -Thinking-2507 Qwen3-Omni-30B-A3B -Thinking Qwen3-Omni-Flash -Thinking General Tasks MMLU-Redux GPQA Reasoning AIME25 LiveBench 20241125 Code MultiPL-E Alignment Tasks IFEval Arena-Hard v2 Creative Writing v3 WritingBench Agent BFCL-v3 Multilingual Tasks MultiIF PolyMATH 92.1 82.8 72.0 74. 84.5 89.8 56.7 85.0 83.9 68.6 74.4 49.8 5.1.2 Performance of AudioText 92.7 71. 81.5 77.1 79.9 83.4 61.5 84.6 80.3 70.8 71.9 54.7 91.4 73. 85.0 76.8 81.3 88.9 56.0 84.4 85.0 72.4 76.4 52.6 88.8 73. 73.7 71.8 80.6 85.1 55.1 82.5 85.5 63.2 72.9 47.1 89.7 73. 74.0 70.3 81.0 85.2 57.8 83.6 85.9 64.5 73.2 48.7 We compare Qwen3-Omni with other leading specialist and generalist models on ASR & S2TT, voicechatting, audio reasoning, and music understanding benchmarks. For brevity, we defer the results of the Qwen3-Omni-Thinking model on ASR & S2TT and music understanding to the Appendix 9.1. Table 6: Transcription performance for AudioText tasks (ASR & S2TT), comparing Qwen3-OmniInstruct with the baselines. The highest scores are shown in bold. Wenetspeech netmeeting Librispeech clean other CV15-en CV15-zh Fleurs-en Fleurs-zh Fleurs-avg (19 lang)a Seed -ASR Voxtral -Mini Voxtral -Small GPT-4o -Transcribe Gemini-2.5 -Pro Qwen2.5 -Omni Qwen3-Omni -30B-A3B-Instruct Qwen3-Omni -Flash-Instruct EN & ZH ASR (wer) 4.665.69 24.3031.53 20.3326.08 15.3032.27 14.4313.47 5.917. 4.695.89 4.625.75 1.582.84 1.884.12 1.563.30 1.393. 2.893.56 1.743.45 1.222.48 1.272.44 - - 3.40 2.69 9.47 24.67 3.96 12. 7.79 19.30 3.77 7.98 10.01 9.84 3.32 2.44 9.89 8.00 2.94 2.71 7.61 5.13 3.77 2.54 Multilingual ASR (wer) - 15.67 8.09 4.48 5.55 14.04 MIR-1K (vocal-only)b Opencpop-test 6.45 2.98 Fleurs-en2xxc Fleurs-xx2en Fleurs-zh2xx Fleurs-xx2zh - - - - 23.33 31.01 30.35 27.54 17.03 28.75 Lyric ASR (wer) 11.87 7.93 S2TT (BLEU) - - - - 18.73 16.06 37.85 32.81 22.05 34.82 9.85 6. 39.25 35.41 26.63 37.50 8.15 2.84 29.22 28.61 17.97 27.68 6.05 4.31 2.72 2.20 5.33 5.90 1. 37.50 31.08 25.17 33.13 5.94 4.28 2.74 2.19 5.31 5.85 2.02 36.22 30.71 25.10 31.19 These 19 languages include Arabic, Cantonese, Chinese, Dutch, English, French, German, Indonesian, Italian, Japanese, Korean, Malay, Portuguese, Russian, Spanish, Thai, Turkish, Urdu, Vietnamese. Transcription is converted into Simplified Chinese. The results encompass translations across 15 languages: Arabic, Cantonese, Chinese, English, French, German, Indonesian, Italian, Japanese, Korean, Portuguese, Russian, Spanish, Thai, Vietnamese. For notation, en2xx denotes translation from English into each of the other 14 target languages, where xx ranges over the remaining language codes. 10 As shown in Table 6, Qwen3-Omni-Instruct achieves state-of-the-art En & Zh ASR and lyric ASR performance on Librispeech, Wenetspeech, Fleurs, CommonVoice, Opencpop-test and MIR-1K (vocal). It also delivers better or comparable performance with other specialist or generalist models like VoxtralSmall and Gemini-2.5-Pro on Multilingual ASR and S2TT. These results show strong performance of Qwen3-Omni in speech recognition and speech translation. Additionally, on VoiceBench shown in Table 7, Qwen3-Omni-Thinking achieves an impressive average score of 89.5, surpassing all other audio language models except Gemini-2.5-Pro (89.6). This showcases our models strong capabilities in speech interaction. Qwen3-Omni also demonstrates impressive performance in audio reasoning, outperforming the powerful closed-source models Gemini-2.5-Pro and Gemini-2.5-Flash on the MMAU benchmark, as well as Gemini-2.5-Flash and GPT-4o-Audio on MMSU. These results demonstrate the powerful capabilities of Qwen3-Omni in general audio understanding and reasoning. Table 7: Voice interaction and audio reasoning performance for AudioText tasks, comparing Qwen3Omni with the baselines. The highest scores are shown in bold. GPT-4o -Audio Gemini-2.5 -Flash Gemini-2.5 -Pro Qwen2.5 -Omni Qwen3-Omni -30B-A3B-Instruct Qwen3-Omni -30B-A3B-Thinking Qwen3-Omni -Flash-Instruct Qwen3-Omni -Flash-Thinking AlpacaEval CommonEval WildVoice SD-QA MMSU OpenBookQA BBH IFEval AdvBench Overall MMAU-v05.15.25 MMSU 95.6 89.8 91.6 75.5 80.3 89.2 84.1 76.0 98.7 86.8 62.5 56. 96.1 88.3 92.1 84.5 66.1 56.9 83.9 83.8 98.9 83.4 71.8 70.2 94.3 88.4 93.4 90.1 71.1 92.3 92.6 85.7 98.1 89.6 77.4 77.7 VoiceBench 94.8 90.8 91.6 76.9 68.1 89.7 80.4 77.8 99.3 85. Audio Reasoning 77.5 69.0 89.9 76.7 77.7 56.4 61.7 80.9 66.7 53.5 99.2 73.6 65.5 62.6 96.4 90.5 90.5 78.1 83.0 94.3 88.9 80.6 97.2 88.8 75.4 70. 95.4 91.0 92.3 76.8 68.4 91.4 80.6 75.2 99.4 85.6 77.6 69.1 96.8 90.9 90.9 78.5 84.3 95.0 89.6 80.8 98.9 89.5 76.5 71.3 For music understanding, we compare Qwen3-Omni-Instruct with both generalist audio language models and specialist models in Table 8. For multi-label classification tasks on MTG-Jamendo and MagnaTagATune, we use micro F1 to compare with BERT-like music specialists instead of AP/AUROC, as language models output discrete label sets without calibrated per-label probabilities/scores required by ranking-based metrics. It is shown in Table 8 that Qwen3-Omni-Instruct achieve state-of-the-art performance on RUL-MuchoMusic. On GTZAN, MTG-Jamendo, and MagnaTagATune, the scores of Qwen3-Omni-Instruct also significantly surpass other audio language models, including Gemini-2.5-Pro and GPT-4o-Audio, as well as self-supervised music specialist models probed on the respective datasets. These results demonstrate the superior capabilities of Qwen3-Omni-Instruct across variety of music understanding tasks. Table 8: Music understanding performance for AudioText tasks, comparing Qwen3-Omni-Instruct with baselines. The highest scores are shown in bold. Best Specialist Models GPT-4o -Audio Gemini-2.5 -Pro Qwen2.5 -Omni Qwen3-Omni -30B-A3B-Instruct Qwen3-Omni -Flash-Instruct RUL-MuchoMusic GTZAN Acc. MTG Genre Micro F1 MTG Mood/Theme Micro F1 MTG Instrument Micro F1 MTG Top50 Micro F1 MagnaTagATune Micro F1 47.6 (Audio Flamingo 3) (Goel et al., 2025) 87.9 (CLaMP 3) (Wu et al., 2025a) 35.8 (MuQ-MuLan) (Zhu et al., 2025) 10.9 (MuQ-MuLan) (Zhu et al., 2025) 39.8 (MuQ-MuLan) (Zhu et al., 2025) 33.2 (MuQ-MuLan) (Zhu et al., 2025) 41.6 (MuQ) (Zhu et al., 2025) 36.1 76.5 25. 11.3 34.2 25.0 29.2 49.4 81. 32.6 14.1 33.0 26.1 28.1 47. 81.7 32.5 8.9 22.6 21.6 30. 52.0 93.0 39.0 21.0 40.5 36. 44.3 52.1 93.1 39.5 21.7 40. 36.9 46.8 5.1.3 Performance of Vision Text To comprehensively evaluate the capabilities on Vision Text, we compare Qwen3-Omni-Instruct with the Qwen2.5-VL-72B and other good-performing closed-source vision-language models. As illustrated in 11 Table 9, Qwen3-Omni-Instruct demonstrates comparable performance to Qwen2.5-VL-72B, and attains better results on Math & STEM related tasks like MMMU-Prooverall, MathVistamini, and MATH-Visionfull, than other vision language models including GPT4-o and Gemini-2.0-Flash. These results reveal the excellent capability of our model on image understanding and reasoning tasks. To assess its capabilities, we evaluated the performance of Qwen3-Omni-Thinking against several stateof-the-art reasoning models. The comparative results, summarized in Table 10, indicate that our proposed model achieves significant advancements. For instance, on Math and STEM benchmarks, it outperforms the Qwen3-Omni-Instruct baseline by 4.4 points. It is also noteworthy that our Qwen3-Omni-30B-A3BThinking model attains performance level on par with substantially larger baselines, which highlights its excellent balance of effectiveness and computational efficiency. limitation of the current model is its suboptimal performance on long video benchmarks. This deficiency stems from two architectural constraints: limited capacity for positional extrapolation and restricted context length. Addressing these constraints is key objective for future work. Table 9: Vision Text performance of Qwen3-Omni-Instruct and other non-reasoning baselines. The highest scores are shown in bold. Datasets GPT4-o Gemini-2.0-Flash Qwen2.5-VL 72B Qwen3-Omni-30B-A3B -Instruct Qwen3-Omni-Flash -Instruct General Visual Question Answering MMStar HallusionBench MM-MT-Bench MMMUval MMMU-Prooverall MathVistamini MATH-Visionfull AI2Dw.M. ChartQAtest Avg. CountBench Video-MMEw/o sub LVBench MLVU 64.7 55.0 7.7 69.1 51.9 63.8 30.4 84.6 86.7 87.9 71.9 30.8 64.6 71.4 56.3 6. 71.3 56.1 71.4 48.6 86.7 64.6 91.2 72.4 57.9 71.0 70.8 55.2 7.6 Math & STEM 70.2 51.1 74.8 38.1 Documentation Understanding 88.7 89.5 Counting 93.6 Video Understanding 73.3 47.3 74.6 68.5 59.7 7.4 69.1 57.0 75.9 56.3 85.2 86.8 90.0 70.5 50.2 75. 69.3 60.4 7.6 69.8 58.2 77.4 57.3 86.4 87.1 90.0 71.4 51.1 75.7 Table 10: Vision Text performance of Qwen3-Omni-Thinking and other reasoning baselines. The highest scores are shown in bold. Datasets Gemini-2.5-Flash -Thinking InternVL-3.5-241B-A28B Qwen3-Omni-30B-A3B -Thinking Qwen3-Omni-Flash -Thinking General Visual Question Answering MMStar HallusionBench MM-MT-Bench MMMUval MMMU-Prooverall MathVistamini MATH-Visionfull AI2Dw.M. ChartQAtest Avg. CountBench Video-MMEw/o sub LVBench MLVU 75.5 61.1 7. 76.9 65.8 77.6 62.3 88.6 88.6 79.6 64.5 82.1 77.9 57.3 Math & STEM 77.7 82.7 63.9 Documentation Understanding 87.3 88.0 Counting Video Understanding 72.9 78.2 12 74.9 62.8 8.0 75.6 60.5 80.0 62.9 86.1 89.5 88. 69.7 49.0 72.9 75.5 63.4 8.0 75.0 60.8 81.2 63.8 86.8 89.3 92.5 69.8 49.5 73. 5.1.4 Performance of AudioVisual VideoText As is shown in Table 11, the experimental results validate the efficacy of Qwen3-Omni across diverse audiovisual tasks. For general understanding, Qwen3-Omni-Instruct achieves state-of-the-art performance on the WorldSense benchmark, surpassing other Omni models by substantial margin. This outcome demonstrates its effectiveness in foundational multimodal integration. Moreover, the model exhibits enhanced performance on complex reasoning tasks, as illustrated in Table 12, particularly on benchmarks that necessitate reasoning over interconnected audio and visual information. These findings collectively suggest that Qwen3-Omni possesses considerable potential for advanced perception and reasoning in real-world contexts. Table 11: AudioVisual Text performance of Qwen3-Omni-Instruct and other non-reasoning baselines. The highest scores are shown in bold. Datasets Previous Open-source SoTA Gemini-2.5-Flash Qwen2.5-Omni Qwen3-Omni-30B-A3B -Instruct Qwen3-Omni-Flash -Instruct WorldSense 47.1(Yang et al., 2025b) 50.9 45. 54.0 54.1 Table 12: AudioVisual Text performance of Qwen3-Omni-30B-A3B-Thinking and other reasoning baselines. The highest scores are shown in bold. Datasets Previous Open-source SoTA Gemini-2.5-Flash -Thinking Qwen3-Omni-30B-A3B -Thinking Qwen3-Omni-Flash -Thinking DailyOmni 69.8(Tang et al., 2025) VideoHolmes 55.6(Tang et al., 2025) 72.7 49.5 75.8 57.3 76.2 57. 5.2 Evaluation of XSpeech In this section, we evaluate the speech generation capabilities of Qwen3-Omni. Due to the lack of relevant assessments, the evaluation of speech generation focuses primarily speech generation given texts, similarity to text-to-speech (TTS), on following three aspects: Zero-Shot Speech Generation: We assess the content consistency (WER) and speaker similarity (SIM) of our model in zero-shot speech generation on SEED (Anastassiou et al., 2024). Multilingual Speech Generation: We assess the content consistency and speaker similarity of our model in zero-shot multilingual speech generation on MiniMax multilingual test set (Zhang et al., 2025). Cross-Lingual Speech Generation: We assess the content consistency of our model in zero-shot cross-lingual speech generation on CV3-Eval (Du et al., 2025). 5.2.1 Evaluation of Zero-Shot Speech Generation We compare the Qwen3-Omni with state-of-the-art zero-shot TTS systems. As shown in Table 13, Qwen3Omni demonstrates highly competitive performance, highlighting its robust speech understanding and generation capabilities developed through pretraining and continual pretraining. Additionally, with reinforcement learning (RL) optimization, Qwen3-Omni yields significant improvements in generation stability, which achieves the best performance in the test-en set. Table 13: Zero-Shot Speech Generation on Seed-TTS Test Set. The highest scores are shown in bold. Datasets Model Performance SEED test-zh test-en Content Consistency Seed-TTSICL (Anastassiou et al., 2024) 1.11 2.24 Seed-TTSRL (Anastassiou et al., 2024) 1.00 1.94 2.27 2.62 MaskGCT (Wang et al., 2024c) 1.97 2.19 E2 TTS (Eskimez et al., 2024) 1.56 1.83 F5-TTS (Chen et al., 2024c) 1.20 1.98 Spark TTS (Wang et al., 2025b) 1.45 2.57 CosyVoice 2 (Du et al., 2024) 0.71 1.45 CosyVoice 3 (Du et al., 2025) 1.42 2.33 Qwen2.5-Omni-7B (Xu et al., 2025) 1.07 1.39 Qwen3-Omni-30B-A3B 13 5.2.2 Evaluation of Multilingual Speech Generation Qwen3-Omni supports speech generation across 10 languages. We evaluate its performance against both the MiniMax-Speech and ElevenLabs Multilingual v2 models for multilingual speech generation. As shown in Table 14, Qwen3-Omni surpasses these models by significant margin for languages such as Chinese, English, and French, while delivering competitive results in the remaining languages. These findings indicate that Qwen3-Omni generates cloned speech with consistent stability and human-like voice across all evaluated languages. Table 14: Multilingual Speech Generation on MiniMax Multilingual Test Set. The highest scores are shown in bold. Language Content Consistency Speaker Similarity Qwen3-Omni -30B-A3B MiniMax ElevenLabs Qwen3-Omni -30B-A3B MiniMax ElevenLabs Chinese English German Italian Portuguese Spanish Japanese Korean French Russian 0.716 1.069 0.777 1.067 1.872 1.765 3.631 1.670 2.505 3.986 2.252 2.164 1.906 1.543 1.877 1.029 3.519 1.747 4.099 4.281 16.026 2.339 0.572 1.743 1.331 1.084 10.646 1.865 5.216 3.878 0.772 0.773 0.738 0.742 0.770 0.744 0.763 0.778 0.689 0. 0.780 0.756 0.733 0.699 0.805 0.762 0.776 0.776 0.628 0.761 0.677 0.613 0.614 0.579 0.711 0.615 0.738 0.700 0.535 0.676 5.2.3 Evaluation of Cross-Lingual Speech Generation Qwen3-Omni supports not only multilingual voice cloning but also cross-lingual voice cloning. We evaluate its performance against CosyVoice2 and CosyVoice3 for cross-lingual speech generation. As shown in Table 15, Qwen3-Omni outperforms CosyVoice3 in any-to-en (any language to English) and any-to-ko (any language to Korean) voice cloning. Notably, in any-to-ja (any language to Japanese) tasks, Qwen3-Omni achieves comparable performance to CosyVoice3 even without text normalization, despite CosyVoice3 converting all Japanese characters into phonetic kana. These results highlight Qwen3-Omnis superiority in cross-lingual speech generation, demonstrating its adaptability across diverse linguistic contexts. Table 15: Cross-Lingual Speech Generation on CosyVoice3 Cross-Lingual Test Set. The highest scores are shown in bold. Language Qwen3-Omni-30B-A3B CosyVoice3 CosyVoice en-to-zh ja-to-zh ko-to-zh zh-to-en ja-to-en ko-to-en zh-to-ja en-to-ja ko-to-ja zh-to-ko en-to-ko ja-to-ko 5.37 3.32 0.99 2.76 3.31 3.34 8.29 7.53 4.24 5.13 4.96 6.23 5.09 3.05 1.06 2.98 4.20 4.19 7.08 6.80 3.93 14.4 5.87 7.92 13.5 48.1 7.70 6.47 17.1 11.2 13.1 14.9 5.86 24.8 21.9 21."
        },
        {
            "title": "6 Evaluating Non-Degradation Across Modalities",
            "content": "A standardized data integration methodology is rendered impractical by the heterogeneous nature of different modalities, each requiring distinct pre-training objectives and optimization techniques. To ensure fair and rigorous evaluation, we therefore designed controlled comparative study. Our approach involved pre-training three models with matched parameter counts: text-only baseline, vision-only 14 baseline, and multimodal Omni model. To isolate the effects of multimodality, all confounding variables were meticulously controlled. Specifically, the Omni model was trained on the identical text and vision corpora as the unimodal baselines. Moreover, we aligned critical training parameters across all models, including learning rate schedules, batch sizes, and the effective number of training epochs for each modality, which was normalized by adjusting data sampling ratios. Consequently, the sole differentiating factor in our experiment was the Omni models inclusion of supplementary audio and audio-visual data during its pre-training phase. The results are shown in Table 16, we evaluate comprehensive benchmarks covering variety of modalities, including the text modality (general tasks, math & STEM tasks, coding tasks, multilingual tasks), the visual modality (college-level problems, OCR-related tasks), and the video modality (video understanding tasks). The experimental results not only demonstrate that mixing unimodal and cross-modal data during the early stage of text pretraining can achieve better performance across all modalities, but also indicate that joint multimodal training enables mutual enhancement between different modalities, leading to improved performance in single modalities as well. This fully showcases the versatility and robustness of Qwen3-Omni across diverse evaluation criteria. Due to the prohibitive experimental cost, we could not conduct comprehensive sweep across all model scales. Based on Table 16 and our internal experiments, we observe: (1) early multimodal integration during pretraining allows language models to be co-trained with vision or audio without any degradation in language capability; (2) the inclusion of the text modality substantially improves performance in the vision and audio. In constrast, we do not observe measurable gains in language ability from adding visual or audio signals; (3) empirically, adding audio data consistently improves vision performance on the MMMU benchmark and OCR-related tasks Table 16: We compare the performance of 30A3 models that are contemporaneous and identical in size in Qwen series. To ensure experimental rigor, all models were trained under the same schedule, using identical datasets for their respective modalities and exactly matched training compute (FLOPs). General Tasks Datasets MMLU MMLU-Redux MMLU-Pro SuperGPQA BBH Math & STEAM Tasks GSM8K MATH Coding Tasks Multilingual Tasks College-level Problems EvalPlus MultiPL-E MBPP CRUX-O MGSM INCLUDE MMMUval General Visual Question Answering MMStar RealWorldQAavg OCR-related Tasks AI2D TextVQAval DocVQAtest InfoVQAtest ChartQAtest Avg OCRBench Video Understanding Tasks Video-MMEw/o sub MVBench LVBench"
        },
        {
            "title": "7 Conclusion",
            "content": "Qwen3-30B-A3B -Base-202507 Qwen3-VL-30B-A3B -Base-202507 Qwen3-Omni-30B-A3B -Base-202507 81.24 80.17 61.81 38.24 83.79 90.83 60.84 69.70 65.75 72.60 66. 78.75 65.17 - - - - - - - - - - - - - - - - - - - - - - - - - 57.22 67.2 73.98 85.88 81.67 95.19 81.17 87.12 85. 69.22 71.87 48.61 81.69 80.60 61.57 40.14 83.53 91.36 60.42 73.96 64.79 72.60 69.06 79.93 64.73 59. 69.6 71.89 86.62 81.65 95.27 83.31 87.52 86.0 69.25 69.50 51.07 In this paper, we introduce Qwen3-Omni-30B-A3B, Qwen3-Omni-30B-A3B-Thinking, Qwen3-OmniFlash-Instruct, and Qwen3-Omni-Flash-Thinking models. Qwen3-Omni-30B-A3B matches or surpasses 15 the latest same-size unimodal Qwen models on text and vision benchmarks. Notably, on audio processing and dialogue benchmarks, it attains state-of-the-art performance among open-source systems on 32 benchmarks and is comparable to, or better than, the strong proprietary counterpart Gemini-2.5-Pro. The Qwen3-Omni-30B-A3B Thinking variant achieves further gains on complex tasks spanning text, vision, and audio-visual reasoning. Beyond accuracy, the model supports 119 text languages, 19 languages for speech recognition and 10 languages for speech synthesis, and enables audio understanding and interactive sessions up to 40 minutes. Thanks to its streaming architecture and multi-codebook design, Qwen3-Omni at the 30B-A3B scale still delivers an end-to-end first-packet latency of 234 ms. Research fields often cycle between specialization and integration. In this context, we believe Qwen3Omni represents milestone: to our knowledge, it provides the first evidence that fully integrated, end-to-end multimodal training can be achieved without degrading core language capability and other modalities. We are eager to share these findings with the community and hope they will stimulate further research. For practical usage, Qwen3-Omni-30B-A3B offers strong text and vision capabilities, robust and reliable ASR, interactive speech support in over 20 languages, very low first-packet latency for interactive use, and stable, naturalistic speech synthesis. Crucially, it exhibits advantages over cascaded pipelines, including stronger cross-modal reasoning, lower end-to-end latency, and lower system complexity and cost. In future work, we will further advance the model along multiple axes, including multi-speaker ASR, video OCR, audiovisual proactive learning, and enhanced support for agent-based workflows and function calling."
        },
        {
            "title": "8 Authors",
            "content": "Core Contributors: Jin Xu, Zhifang Guo, Hangrui Hu, Yunfei Chu, Xiong Wang, Jinzheng He, Yuxuan Wang, Xian Shi, Ting He, Xinfa Zhu, Yuanjun Lv, Yongqi Wang, Dake Guo, He Wang, Linhan Ma, Pei Zhang, Xinyu Zhang, Hongkun Hao, Zishan Guo, Baosong Yang, Bin Zhang, Ziyang Ma, Xipin Wei, Shuai Bai, Keqin Chen, Xuejing Liu, Peng Wang, Mingkun Yang, Dayiheng Liu, Xingzhang Ren, Bo Zheng, Rui Men, Fan Zhou, Bowen Yu, Jianxin Yang, Le Yu, Jingren Zhou, Junyang Lin Contributors1: An Yang, Anfeng Li, Bei Chen, Beichen Zhang, Bin Lin, Binyuan Hui, Bohan Wang, Buxiao Wu, Chenfei Wu, Cheng Chen, Chen Qiang, Chenhan Yuan, Chenhao Li, Chenxu Lv, Chujie Zheng, Daren Chen, Dayiheng Liu, Dake Guo, Fei Huang, Gezhengyang Zhu, Guangdong Zhou, Hang Zhang, Hongjian Tu, Humen Zhong, Jialong Zuo, Jianhong Tu, Jianwei Zhang, Jiayi Leng, Jing Zhou, Jingren Zhou, Kai Dang, Kexin Yang, Kun Yan, Laiwen Zheng, Lei Xie, Lianghao Deng, Lingchen Meng, Mei Li, Miao Hong, Mingfeng Xue, Minsheng Li, Mingze Li, Peiyang Zhang, Peng Liu, Pengfei Wang, Ruibin Yuan, Rui Hu, Ruiyang Xu, Qidong Huang, Qin Zhu, Que Shen, Shen Li, Shixuan Liu, Sibo Song, Siqi Zhang, Song Chen, Su Hao, Tianyi Tang, Wenbin Ge, Wentao Yao, Wei Ding, Wei Wang, Xiaodong Deng, Xiaotong Chen, Xiao Li, Xian Yang, Xinyao Niu, Xudong Guo, Xin Le, Xuechun Wang, Xutong Jin, Xuancheng Ren, Yang Fan, Yang Liu, Yang Su, Yantao Liu, Yi Wu, Yichang Zhang, Yilei Chen, Yiming Dong, Yinger Zhang, Yizhong Cao, Yuchong Sun, Yuezhang Wang, Yuhao Wang, Yuqiong Liu, Yuanzhi Zhu, Yuxiang Chen, Yuxuan Cai, Yuxuan Liu, Zeyu Cui, Zheng Li, Zhenghao Xing, Zhenru Zhang, Zihan Qiu, ZiYue Jiang, Zhaohai Li, Zhi Li, Zhibo Yang, Zhihai Wang, Zhipeng Zhou 1Alphabetical order."
        },
        {
            "title": "9 Appendix",
            "content": "9.1 More Evaluation on Speech and Music Understanding This section reports the performance of the Qwen3-Omni-thinking model on tasks pertaining to ASR/S2TT and Music. As shown in Table 17 and 18, in the domains of ASR/S2TT and Music understanding, the Qwen3-Omni-Thinking model is outperformed by its Instruct counterpart, which indicates that for these predominantly perception-based tasks, the engagement of sophisticated reasoning processes fails to yield performance gains. In fact, it may even introduce higher propensity for hallucinations. Table 17: Transcription performance for AudioText tasks (ASR & S2TT), comparing Qwen3-OmniThinking with the baselines. The highest scores are shown in bold. Seed -ASR Voxtral -Mini Voxtral -Small GPT-4o -Transcribe Gemini-2.5 -Pro Qwen2.5 -Omni Qwen3-Omni -30B-A3B-Thinking Qwen3-Omni -Flash-Thinking EN & ZH ASR (wer) Wenetspeech netmeeting Librispeech clean other CV15-en CV15-zh Fleurs-en Fleurs-zh Fleurs-avg (19 lang)a 4.66 5.69 24.3031.53 20.3326.08 15.3032. 14.4313.47 5.917.65 6.168.17 1.58 2.84 1.884.12 1.563. 1.393.75 2.893.56 1.743.45 2.224.38 - - 3.40 2.69 9.47 24.67 3.96 12. 7.79 19.30 3.77 7.98 10.01 9.84 3.32 2.44 9.89 8.00 2.94 2.71 7.61 5.13 3.77 2.54 10.44 6.25 3.75 2.73 Multilingual ASR (wer) - 15.67 8.09 4.48 5.55 14. 8.63 MIR-1K (vocal-only)b Opencpop-test 6.45 2.98 Fleurs-en2xxc Fleurs-xx2en Fleurs-zh2xx Fleurs-xx2zh - - - - 23.33 31. 30.35 27.54 17.03 28.75 Lyric ASR (wer) 11.87 7.93 S2TT (BLEU) - - - - 9.85 6. 39.25 35.41 26.63 37.50 8.15 2.84 29.22 28.61 17.97 27.68 18.73 16.06 37.85 32.81 22.05 34.82 11.15 6. 36.24 30.50 23.74 34.51 6.858.42 1.824.01 10.52 6.61 3.67 2.57 8.88 10.47 4. 36.04 30.22 23.77 34.49 These 19 languages include Arabic, Cantonese, Chinese, Dutch, English, French, German, Indonesian, Italian, Japanese, Korean, Malay, Portuguese, Russian, Spanish, Thai, Turkish, Urdu, Vietnamese. Transcription is converted into Simplified Chinese. The results encompass translations across 15 languages: Arabic, Cantonese, Chinese, English, French, German, Indonesian, Italian, Japanese, Korean, Portuguese, Russian, Spanish, Thai, Vietnamese. For notation, en2xx denotes translation from English into each of the other 14 target languages, where xx ranges over the remaining language codes. Table 18: Music understanding performance for AudioText tasks, comparing Qwen3-Omni-Thinking with baselines. The highest scores are shown in bold. Best Specialist Models GPT-4o -Audio Gemini-2.5 -Pro Qwen2.5 -Omni Qwen3-Omni -30B-A3B-Thinking Qwen3-Omni -Flash-Thinking RUL-MuchoMusic GTZAN Acc. MTG Genre Micro F1 MTG Mood/Theme Micro F1 MTG Instrument Micro F1 MTG Top50 Micro F1 MagnaTagATune Micro F1 47.6 (Audio Flamingo 3) (Goel et al., 2025) 87.9 (CLaMP 3) (Wu et al., 2025a) 35.8 (MuQ-MuLan) (Zhu et al., 2025) 10.9 (MuQ-MuLan) (Zhu et al., 2025) 39.8 (MuQ-MuLan) (Zhu et al., 2025) 33.2 (MuQ-MuLan) (Zhu et al., 2025) 41.6 (MuQ) (Zhu et al., 2025) 36.1 76.5 25.3 11. 34.2 25.0 29.2 49.4 81.0 32. 14.1 33.0 26.1 28.1 47.3 81. 32.5 8.9 22.6 21.6 30.1 48. 89.0 32.5 14.3 36.4 29.1 32. 48.4 89.0 33.0 15.4 36.4 29. 32.6 9.2 Qualitative Results from Qwen3-Omni-30B-A3B-Captioner In this section, we illustrate the performance of our finetuned Qwen3-Omni-30B-A3B-Captioner through three representative case studies. The selected scenarios are designed to test the models proficiency in: (1) analyzing expressive speech, (2) interpreting complex auditory scenes and sound effects, and (3) captioning composite audio that includes speech, music, and ambient sounds. For reproducibility, the original audio samples can be accessed from our public GitHub repository."
        },
        {
            "title": "Analysis of Expressive Speech",
            "content": "The audio clip opens in studio setting, marked by faint, persistent electronic hiss and subtle low-frequency hum, indicating professional but not entirely noise-free recording conditions. The male speaker, whose voice is delivered in clear, energetic, and highly theatrical manner, begins with an assertive  (Right!), delivered with sharp, rising intonation that immediately establishes performative, self-aware He continues,  (This is me, Taiyi Zhenren, tone. admired by thousands), using exaggerated emphasis and pronounced rising inflection on  (admired by thousands) to convey mock grandeur and comic bravado. His articulation is crisp, and his voice is rich in midrange frequencies, suggesting close-micd recording with touch of digital reverb for dramatic effect. After brief, deliberate pause, the speaker shifts to more self-deprecating yet still playful register:  (Although Im bit chubby, it still cant hide my impressive handsomeness). Here, the tone becomes lighter and more conversational, with subtle downward inflection on  (chubby) and playful, rising emphasis on  (impressive handsomeness), underscoring the comedic contrast between modesty and self-praise. The delivery is marked by expressive inflection and clear articulation, maintaining consistent presence in the mix. Throughout the speech, the recording remains clean and undistorted, with no background noises, environmental cues, or audience sounds. The voice is centrally positioned in the stereo field, and the use of reverb and EQ creates sense of theatricality and spatial depth, while the electronic hiss and hum are subtle but present, hinting at professional studio equipment and post-processing. The clip concludes with sudden, complete cut to silence, with no trailing sounds or fade-out, indicating deliberate and precise edit. In summary, this audio features single male speaker delivering self-introductory monologue in Mandarin, portraying the legendary Taoist figure Taiyi Zhenren in The performance blends exaggerated bravado with comedic, over-the-top manner. self-deprecating humor, and employing dramatic inflection, professional studio production to create memorable, entertaining character portrayal. The absence of background noise and the clean, intentional editing reinforce the clips crafted, theatrical nature, making it suitable for online content, podcasts, or digital entertainment aimed at modern, culturally literate audience. expressive pacing,"
        },
        {
            "title": "Analysis of Complex Scene Sound Effect",
            "content": "The audio clip is highly produced, cinematic soundscape, lasting 25 seconds, designed to evoke intense drama and imminent danger. It begins with deep, resonant musical drone and sharp, metallic clank, immediately establishing mood of tension and foreboding. slow, rhythmic, and ominous beat joins, layered with swelling orchestral strings and synthetic textures that build suspense and sense of scale. Around the 9-second mark, the soundscape explodes with the thunderous, mechanical roar of massive engine, its deep, percussive pulses dominating the mix. This is accompanied by high-pitched, metallic screech, suggesting immense machinery in motion or under strain. The orchestral music intensifies, becoming more urgent and climactic, with the addition of high-frequency electronic whine that adds to the feeling of technological threat. At the 15-second point, colossal, explosive impact occurs, characterized by sharp, high-frequency crack followed by deep, resonant boom. The sound of shattering and debris fills the space, with reverberation suggesting vast, hard-walled environmentperhaps hangar, tunnel, or industrial facility. The orchestral music reaches its peak, becoming chaotic and overwhelming, before abruptly ceasing at the 19-second mark. Immediately after the impact, the focus shifts to the sounds of single person: heavy, strained breathing, the rustle of heavy fabric, and low groan. These sounds, recorded with close-mic clarity and natural reverberation, indicate the individual is recovering from exertion or injury, likely amidst the aftermath of the catastrophic event. There are no spoken words, but the vocalizations and physical sounds strongly suggest the presence of male character. Throughout the clip, there are no voices, dialogue, or environmental cues that would suggest specific culture, language, or geographic setting. The orchestral and electronic musical elements are universal to modern action, sci-fi, and thriller genres, and the production values are consistent with contemporary Hollywood or AAA video game trailers. In summary, the audio is tightly crafted, non-verbal scene of catastrophic eventlikely crash, explosion, or mechanical disasterin vast, industrial or futuristic setting, immediately followed by the physical and emotional aftermath of single survivor. The absence of speech, combined with the orchestration, sound design, and spatial cues, positions the clip as generic but highly effective trailer or scene cue for dramatic, action-oriented media product. Analysis of Mixed Speech, Audio, and Music The audio begins with deep, resonant metallic clang, immediately followed by powerful, low-frequency rumble that evokes the sound of massive engine or heavy machinery. The space is acoustically vast, with long reverberation tails and faint, high-pitched whine, suggesting colossal, metallic environment such as spaceship hangar or vast industrial chamber. mechanical whirring sound emerges, layered with metallic clanking and grinding, creating the impression of large vehicle or portal activating. These sounds are punctuated by sharp, high-frequency crackle, reminiscent of electrical arcs or energy discharges, further reinforcing the technological setting. The mechanical noises intensify, with rapid, high-pitched metallic screeches and impacts that imply the movement or collision of massive metal components. Suddenly, the mechanical sounds fade, and the ambient rumble persists, revealing subtle, high-frequency hisspossibly from an air filtration system or atmospheric turbulencewhile the vastness of the space remains evident through lingering echoes. female voice, distant and high-pitched, emerges with plaintive, childlike tone, asking, \"Are we there yet?\" Her speech is slightly muffled and reverberant, indicating she is physically separated from the microphone, likely inside the vehicle or machinery. This is followed by deeper, gravelly male voice, close to the microphone, responding with gruff, impatient tone: \"We get there when we get there.\" His voice is clear and assertive, contrasting with the females, and the exchange is typical of familial banter. The mechanical rumble swells again, joined by whooshing sound as if air is rushing past, and rapid metallic clatter signals the rapid movement of machinery or vehicles. The environment is further emphasized by sharp, high-frequency crackle, suggesting an energy surge or system overload. third male voice, energetic and friendly, calls out from moderate distance: \"How you doing, honey?\" His tone is warm and affectionate, with slight echo, and the use of \"honey\" implies familial relationship. Immediately after, the female voice, now closer and more urgent, responds with high-pitched, exasperated tone: \"Do have to answer?\" Her delivery is quick, sharp, and filled with playful annoyance, reflecting familiar and comfortable dynamic among the group. As the mechanical sounds subside, low-frequency hum remains, and the audio This consists of single transitions into brief, synthesized musical sting. sustained note from low-frequency synthesizer, likely bass or synth pad, which is cut off abruptly, suggesting the end of the scene or transition to another segment. Throughout, the audio is of high fidelity, with no distortion or noise, and each sound is distinct and well-defined. The spatial characteristicsdistance, direction, and reverberationcontribute to vivid sense of large, metallic, and technological environment. The dialogue is clear and expressive, with emotional tones ranging from impatience and warmth to playful annoyance. The use of \"honey\" and the familial banter reinforce the impression of close-knit group, likely family members, engaged in shared journey within science fiction or fantasy context. In summary, the audio presents dynamic, high-fidelity soundscape of massive, metallic environmentpossibly spaceship or futuristic vehiclewhere group of family members engage in playful banter as they travel together. Mechanical sounds, spatial cues, and expressive dialogue combine to create vivid sense of place and character, culminating in synthesized musical sting that signals narrative transition. The scene is rich in emotional nuance and technological detail, firmly situating the listener within science fiction or fantasy setting."
        },
        {
            "title": "References",
            "content": "Pravesh Agrawal, Szymon Antoniak, Emma Bou Hanna, Baptiste Bout, Devendra Chaplot, Jessica Chudnovsky, Diogo Costa, Baudouin De Monicault, Saurabh Garg, Theophile Gervet, Soham Ghosh, Amlie Hliou, Paul Jacob, Albert Q. Jiang, Kartik Khandelwal, Timothe Lacroix, Guillaume Lample, Diego Las Casas, Thibaut Lavril, Teven Le Scao, Andy Lo, William Marshall, Louis Martin, Arthur Mensch, Pavankumar Muddireddy, Valera Nemychnikova, Marie Pellat, Patrick Von Platen, Nikhil Raghuraman, Baptiste Rozire, Alexandre Sablayrolles, Lucile Saulnier, Romain Sauvestre, Wendy Shang, Roman Soletskyi, Lawrence Stewart, Pierre Stock, Joachim Studnia, Sandeep Subramanian, Sagar Vaze, Thomas Wang, and Sophia Yang. Pixtral 12b, 2024. URL https://arxiv.org/abs/2410.0 7073. AIME. AIME problems and solutions, 2025. URL https://artofproblemsolving.com/wiki/index.php/A IME_Problems_and_Solutions. Philip Anastassiou, Jiawei Chen, Jitong Chen, Yuanzhe Chen, Zhuo Chen, Ziyi Chen, Jian Cong, Lelai Deng, Chuang Ding, Lu Gao, et al. Seed-tts: family of high-quality versatile speech generation models. arXiv preprint arXiv:2406.02430, 2024. Anthropic. Introducing Claude, 2023a. URL https://www.anthropic.com/index/introducing-claude. Anthropic. Claude 2. Technical report, Anthropic, 2023b. URL https://www-files.anthropic.com/pro duction/images/Model-Card-Claude-2.pdf. Anthropic. The Claude 3 model family: Opus, Sonnet, Haiku. Technical report, Anthropic, AI, 2024. URL https://www-cdn.anthropic.com/de8ba9b01c9ab7cbabf5c33b80b7bbc618857627/Model_Card_Claude_ 3.pdf. Jinze Bai, Shuai Bai, Yunfei Chu, Zeyu Cui, Kai Dang, Xiaodong Deng, Yang Fan, Wenbin Ge, Yu Han, Fei Huang, Binyuan Hui, Luo Ji, Mei Li, Junyang Lin, Runji Lin, Dayiheng Liu, Gao Liu, Chengqiang Lu, Keming Lu, Jianxin Ma, Rui Men, Xingzhang Ren, Xuancheng Ren, Chuanqi Tan, Sinan Tan, Jianhong Tu, Peng Wang, Shijie Wang, Wei Wang, Shengguang Wu, Benfeng Xu, Jin Xu, An Yang, Hao Yang, Jian Yang, Shusheng Yang, Yang Yao, Bowen Yu, Hongyi Yuan, Zheng Yuan, Jianwei Zhang, Xingxuan Zhang, Yichang Zhang, Zhenru Zhang, Chang Zhou, Jingren Zhou, Xiaohuan Zhou, and Tianhang Zhu. Qwen technical report. CoRR, abs/2309.16609, 2023a. Jinze Bai, Shuai Bai, Shusheng Yang, Shijie Wang, Sinan Tan, Peng Wang, Junyang Lin, Chang Zhou, and Jingren Zhou. Qwen-VL: frontier large vision-language model with versatile abilities. CoRR, abs/2308.12966, 2023b. Shuai Bai, Keqin Chen, Xuejing Liu, Jialin Wang, Wenbin Ge, Sibo Song, Kai Dang, Peng Wang, Shijie Wang, Jun Tang, et al. Qwen2. 5-vl technical report. arXiv preprint arXiv:2502.13923, 2025. Dmitry Bogdanov, Minz Won, Philip Tovstogan, Alastair Porter, and Xavier Serra. The mtg-jamendo dataset for automatic music tagging. ICML, 2019. Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, et al. Language models are few-shot learners. In NeurIPS, 2020. Federico Cassano, John Gouwar, Daniel Nguyen, Sydney Nguyen, Luna Phipps-Costin, Donald Pinckney, Ming-Ho Yee, Yangtian Zi, Carolyn Jane Anderson, Molly Q. Feldman, Arjun Guha, Michael Greenberg, and Abhinav Jangda. MultiPL-E: scalable and polyglot approach to benchmarking neural code generation. IEEE Trans. Software Eng., 49(7):36753691, 2023. Lin Chen, Jinsong Li, Xiaoyi Dong, Pan Zhang, Yuhang Zang, Zehui Chen, Haodong Duan, Jiaqi Wang, Yu Qiao, Dahua Lin, et al. Are we on the right way for evaluating large vision-language models? arXiv:2403.20330, 2024a. Yiming Chen, Xianghu Yue, Chen Zhang, Xiaoxue Gao, Robby Tan, and Haizhou Li. Voicebench: Benchmarking llm-based voice assistants. arXiv preprint arXiv:2410.17196, 2024b. Yushen Chen, Zhikang Niu, Ziyang Ma, Keqi Deng, Chunhui Wang, Jian Zhao, Kai Yu, and Xie Chen. F5tts: fairytaler that fakes fluent and faithful speech with flow matching. arXiv preprint arXiv:2410.06885, 2024c. Junhao Cheng, Yuying Ge, Teng Wang, Yixiao Ge, Jing Liao, and Ying Shan. Video-holmes: Can MLLM think like holmes for complex video reasoning? CoRR, abs/2505.21374, 2025. 21 Yunfei Chu, Jin Xu, Xiaohuan Zhou, Qian Yang, Shiliang Zhang, Zhijie Yan, Chang Zhou, and Jingren Zhou. Qwen-Audio: Advancing universal audio understanding via unified large-scale audio-language models. CoRR, abs/2311.07919, 2023. Yunfei Chu, Jin Xu, Qian Yang, Haojie Wei, Xipin Wei, Zhifang Guo, Yichong Leng, Yuanjun Lv, Jinzheng He, Junyang Lin, et al. Qwen2-audio technical report. arXiv preprint arXiv:2407.10759, 2024. Gheorghe Comanici, Eric Bieber, Mike Schaekermann, Ice Pasupat, Noveen Sachdeva, Inderjit Dhillon, Marcel Blistein, Ori Ram, Dan Zhang, Evan Rosen, et al. Gemini 2.5: Pushing the frontier with advanced reasoning, multimodality, long context, and next generation agentic capabilities. arXiv preprint arXiv:2507.06261, 2025. Zhihao Du, Yuxuan Wang, Qian Chen, Xian Shi, Xiang Lv, Tianyu Zhao, Zhifu Gao, Yexin Yang, Changfeng Gao, Hui Wang, et al. Cosyvoice 2: Scalable streaming speech synthesis with large language models. arXiv preprint arXiv:2412.10117, 2024. Zhihao Du, Changfeng Gao, Yuxuan Wang, Fan Yu, Tianyu Zhao, Hao Wang, Xiang Lv, Hui Wang, Chongjia Ni, Xian Shi, Keyu An, Guanrou Yang, Yabin Li, Yanni Chen, Zhifu Gao, Qian Chen, Yue Gu, Mengzhe Chen, Yafeng Chen, Shiliang Zhang, Wen Wang, and Jieping Ye. Cosyvoice 3: Towards in-the-wild speech generation via scaling-up and post-training. CoRR, abs/2505.17589, 2025. Abhimanyu Dubey, Abhinav Jauhri, Abhinav Pandey, Abhishek Kadian, Ahmad Al-Dahle, Aiesha Letman, Akhil Mathur, Alan Schelten, Amy Yang, Angela Fan, Anirudh Goyal, Anthony Hartshorn, Aobo Yang, Archi Mitra, Archie Sravankumar, Artem Korenev, Arthur Hinsvark, Arun Rao, Aston Zhang, Aurlien Rodriguez, Austen Gregerson, Ava Spataru, Baptiste Rozire, Bethany Biron, Binh Tang, Bobbie Chern, Charlotte Caucheteux, Chaya Nayak, Chloe Bi, Chris Marra, Chris McConnell, Christian Keller, Christophe Touret, Chunyang Wu, Corinne Wong, Cristian Canton Ferrer, Cyrus Nikolaidis, Damien Allonsius, Daniel Song, Danielle Pintz, Danny Livshits, David Esiobu, Dhruv Choudhary, Dhruv Mahajan, Diego Garcia-Olano, Diego Perino, Dieuwke Hupkes, Egor Lakomkin, Ehab AlBadawy, Elina Lobanova, Emily Dinan, Eric Michael Smith, Filip Radenovic, Frank Zhang, Gabriel Synnaeve, Gabrielle Lee, Georgia Lewis Anderson, Graeme Nail, Grgoire Mialon, Guan Pang, Guillem Cucurell, Hailey Nguyen, Hannah Korevaar, Hu Xu, Hugo Touvron, Iliyan Zarov, Imanol Arrieta Ibarra, Isabel M. Kloumann, Ishan Misra, Ivan Evtimov, Jade Copet, Jaewon Lee, Jan Geffert, Jana Vranes, Jason Park, Jay Mahadeokar, Jeet Shah, Jelmer van der Linde, Jennifer Billock, Jenny Hong, Jenya Lee, Jeremy Fu, Jianfeng Chi, Jianyu Huang, Jiawen Liu, Jie Wang, Jiecao Yu, Joanna Bitton, Joe Spisak, Jongsoo Park, Joseph Rocca, Joshua Johnstun, Joshua Saxe, Junteng Jia, Kalyan Vasuden Alwala, Kartikeya Upasani, Kate Plawiak, Ke Li, Kenneth Heafield, Kevin Stone, and et al. The Llama 3 herd of models. CoRR, abs/2407.21783, 2024. Sefik Emre Eskimez, Xiaofei Wang, Manthan Thakker, Canrun Li, Chung-Hsien Tsai, Zhen Xiao, Hemin Yang, Zirun Zhu, Min Tang, Xu Tan, et al. E2 tts: Embarrassingly easy fully non-autoregressive zero-shot tts. In 2024 IEEE Spoken Language Technology Workshop (SLT), pp. 682689. IEEE, 2024. Chaoyou Fu, Yuhan Dai, Yondong Luo, Lei Li, Shuhuai Ren, Renrui Zhang, Zihan Wang, Chenyu Zhou, Yunhang Shen, Mengdan Zhang, et al. Video-mme: The first-ever comprehensive evaluation benchmark of multi-modal llms in video analysis. arXiv:2405.21075, 2024. Aryo Pradipta Gema, Joshua Ong Jun Leang, Giwon Hong, Alessio Devoto, Alberto Carlo Maria Mancino, Rohit Saxena, Xuanli He, Yu Zhao, Xiaotang Du, Mohammad Reza Ghasemi Madani, et al. Are we done with mmlu? CoRR, abs/2406.04127, 2024. Gemini Team. Gemini 1.5: Unlocking multimodal understanding across millions of tokens of context. Technical report, Google, 2024. URL https://storage.googleapis.com/deepmind-media/gemini/gemi ni_v1_5_report.pdf. Arushi Goel, Sreyan Ghosh, Jaehyeon Kim, Sonal Kumar, Zhifeng Kong, Sang-gil Lee, Chao-Han Huck Yang, Ramani Duraiswami, Dinesh Manocha, Rafael Valle, et al. Audio flamingo 3: Advancing audio intelligence with fully open large audio language models. arXiv preprint arXiv:2507.08128, 2025. Tianrui Guan, Fuxiao Liu, Xiyang Wu, Ruiqi Xian, Zongxia Li, Xiaoyu Liu, Xijun Wang, Lichang Chen, Furong Huang, Yaser Yacoob, Dinesh Manocha, and Tianyi Zhou. Hallusionbench: An advanced diagnostic suite for entangled language hallucination and visual illusion in large vision-language models. In IEEE/CVF Conference on Computer Vision and Pattern Recognition, CVPR 2024, Seattle, WA, USA, June 16-22, 2024, pp. 1437514385. IEEE, 2024. 22 Yun He, Di Jin, Chaoqi Wang, Chloe Bi, Karishma Mandyam, Hejia Zhang, Chen Zhu, Ning Li, Tengyu Xu, Hongjiang Lv, Shruti Bhosale, Chenguang Zhu, Karthik Abinav Sankararaman, Eryk Helenowski, Melanie Kambadur, Aditya Tayade, Hao Ma, Han Fang, and Sinong Wang. Multi-if: Benchmarking llms on multi-turn and multilingual instructions following. CoRR, abs/2410.15553, 2024. doi: 10.48550 /ARXIV.2410.15553. URL https://doi.org/10.48550/arXiv.2410.15553. Jack Hong, Shilin Yan, Jiayin Cai, Xiaolong Jiang, Yao Hu, and Weidi Xie. Worldsense: Evaluating real-world omnimodal understanding for multimodal llms. CoRR, abs/2502.04326, 2025. Aniruddha Kembhavi, Mike Salvato, Eric Kolve, Minjoon Seo, Hannaneh Hajishirzi, and Ali Farhadi. diagram is worth dozen images. In ECCV, 2016. Woosuk Kwon, Zhuohan Li, Siyuan Zhuang, Ying Sheng, Lianmin Zheng, Cody Hao Yu, Joseph E. Gonzalez, Hao Zhang, and Ion Stoica. Efficient memory management for large language model serving with pagedattention. In Proceedings of the ACM SIGOPS 29th Symposium on Operating Systems Principles, 2023. Edith Law, Kris West, Michael Mandel, Mert Bay, and Stephen Downie. Evaluation of algorithms using games: The case of music tagging. In ISMIR, pp. 387392, 2009. Junnan Li, Dongxu Li, Silvio Savarese, and Steven Hoi. Blip-2: Bootstrapping language-image pre-training with frozen image encoders and large language models. arXiv:2301.12597, 2023. Bill Yuchen Lin, Ronan Le Bras, Kyle Richardson, Ashish Sabharwal, Radha Poovendran, Peter Clark, and Yejin Choi. ZebraLogic: On the scaling limits of LLMs for logical reasoning. CoRR, abs/2502.01100, 2025. Haotian Liu, Chunyuan Li, Qingyang Wu, and Yong Jae Lee. Visual instruction tuning. arXiv:2304.08485, 2023. Pan Lu, Hritik Bansal, Tony Xia, Jiacheng Liu, Chunyuan Li, Hannaneh Hajishirzi, Hao Cheng, Kai-Wei Chang, Michel Galley, and Jianfeng Gao. Mathvista: Evaluating mathematical reasoning of foundation models in visual contexts. In ICLR, 2024. Ahmed Masry, Do Xuan Long, Jia Qing Tan, Shafiq Joty, and Enamul Hoque. Chartqa: benchmark for question answering about charts with visual and logical reasoning. arXiv:2203.10244, 2022. OpenAI. ChatML, 2022. URL https://github.com/openai/openai-python/blob/e389823ba013a24b4c 2ce38fa0bd87e6bccae94/chatml.md. OpenAI. GPT4 technical report. CoRR, abs/2303.08774, 2023. OpenAI. Hello GPT-4o, 2024. URL https://openai.com/index/hello-gpt-4o/. Samuel J. Paech. Creative writing v3, 2024. URL https://eqbench.com/creative_writing.html. Roni Paiss, Ariel Ephrat, Omer Tov, Shiran Zada, Inbar Mosseri, Michal Irani, and Tali Dekel. Teaching CLIP to count to ten. In IEEE/CVF International Conference on Computer Vision, ICCV 2023, Paris, France, October 1-6, 2023, pp. 31473157. IEEE, 2023. Rafael Rafailov, Archit Sharma, Eric Mitchell, Christopher D. Manning, Stefano Ermon, and Chelsea Finn. Direct preference optimization: Your language model is secretly reward model. In NeurIPS, 2023. David Rein, Betty Li Hou, Asa Cooper Stickland, Jackson Petty, Richard Yuanzhe Pang, Julien Dirani, Julian Michael, and Samuel R. Bowman. GPQA: graduate-level Google-proof Q&A benchmark. CoRR, abs/2311.12022, 2023. Sakshi, Utkarsh Tyagi, Sonal Kumar, Ashish Seth, Ramaneswaran Selvakumar, Oriol Nieto, Ramani Duraiswami, Sreyan Ghosh, and Dinesh Manocha. Mmau: massive multi-task audio understanding and reasoning benchmark, 2024. URL https://arxiv.org/abs/2410.19168. Jianlin Su, Murtadha H. M. Ahmed, Yu Lu, Shengfeng Pan, Wen Bo, and Yunfeng Liu. Roformer: Enhanced Transformer with rotary position embedding. Neurocomputing, 568:127063, 2024. Changli Tang, Yixuan Li, Yudong Yang, Jimin Zhuang, Guangzhi Sun, Wei Li, Zejun Ma, and Chao Zhang. video-salmonn 2: Captioning-enhanced audio-visual large language models. CoRR, abs/2506.15220, 2025. Hugo Touvron, Louis Martin, Kevin Stone, Peter Albert, Amjad Almahairi, Yasmine Babaei, Nikolay Bashlykov, Soumya Batra, Prajjwal Bhargava, Shruti Bhosale, et al. Llama 2: Open foundation and fine-tuned chat models. arXiv:2307.09288, 2023. Michael Tschannen, Alexey Gritsenko, Xiao Wang, Muhammad Ferjad Naeem, Ibrahim Alabdulmohsin, Nikhil Parthasarathy, Talfan Evans, Lucas Beyer, Ye Xia, Basil Mustafa, Olivier Hnaff, Jeremiah Harmsen, Andreas Steiner, and Xiaohua Zhai. Siglip 2: Multilingual vision-language encoders with improved semantic understanding, localization, and dense features. https://arxiv.org/abs/2502.14786, 2025. George Tzanetakis and Perry Cook. Musical genre classification of audio signals. IEEE Transactions on speech and audio processing, 10(5):293302, 2002. Dingdong Wang, Jincenzi Wu, Junan Li, Dongchao Yang, Xueyuan Chen, Tianhua Zhang, and Helen Meng. MMSU: massive multi-task spoken language understanding and reasoning benchmark. CoRR, abs/2506.04779, 2025a. doi: 10.48550/ARXIV.2506.04779. URL https://doi.org/10.48550/arXiv.250 6.04779. Ke Wang, Junting Pan, Weikang Shi, Zimu Lu, Mingjie Zhan, and Hongsheng Li. Measuring multimodal mathematical reasoning with math-vision dataset. arXiv:2402.14804, 2024a. Weihan Wang, Zehai He, Wenyi Hong, Yean Cheng, Xiaohan Zhang, Ji Qi, Shiyu Huang, Bin Xu, Yuxiao Dong, Ming Ding, and Jie Tang. Lvbench: An extreme long video understanding benchmark. CoRR, abs/2406.08035, 2024b. Xinsheng Wang, Mingqi Jiang, Ziyang Ma, Ziyu Zhang, Songxiang Liu, Linqin Li, Zheng Liang, Qixi Zheng, Rui Wang, Xiaoqin Feng, Weizhen Bian, Zhen Ye, Sitong Cheng, Ruibin Yuan, Zhixian Zhao, Xinfa Zhu, Jiahao Pan, Liumeng Xue, Pengcheng Zhu, Yunlin Chen, Zhifei Li, Xie Chen, Lei Xie, Yike Guo, and Wei Xue. Spark-tts: An efficient llm-based text-to-speech model with single-stream decoupled speech tokens. CoRR, abs/2503.01710, 2025b. Yiming Wang, Pei Zhang, Jialong Tang, Haoran Wei, Baosong Yang, Rui Wang, Chenshu Sun, Feitong Sun, Jiran Zhang, Junxuan Wu, Qiqian Cang, Yichang Zhang, Fei Huang, Junyang Lin, Fei Huang, and Jingren Zhou. Polymath: Evaluating mathematical reasoning in multilingual contexts. CoRR, abs/2504.18428, 2025c. doi: 10.48550/ARXIV.2504.18428. URL https://doi.org/10.48550/arXiv.250 4.18428. Yuancheng Wang, Haoyue Zhan, Liwei Liu, Ruihong Zeng, Haotian Guo, Jiachen Zheng, Qiang Zhang, Xueyao Zhang, Shunsi Zhang, and Zhizheng Wu. Maskgct: Zero-shot text-to-speech with masked generative codec transformer. arXiv preprint arXiv:2409.00750, 2024c. Shangda Wu, Zhancheng Guo, Ruibin Yuan, Junyan Jiang, Seungheon Doh, Gus Xia, Juhan Nam, Xiaobing Li, Feng Yu, and Maosong Sun. Clamp 3: Universal music information retrieval across unaligned modalities and unseen languages. arXiv preprint arXiv:2502.10362, 2025a. Yuning Wu, Jiahao Mei, Ming Yan, Chenliang Li, Shaopeng Lai, Yuran Ren, Zijia Wang, Ji Zhang, Mengyue Wu, Qin Jin, and Fei Huang. WritingBench: comprehensive benchmark for generative writing. CoRR, abs/2503.05244, 2025b. Jin Xu, Zhifang Guo, Jinzheng He, Hangrui Hu, Ting He, Shuai Bai, Keqin Chen, Jialin Wang, Yang Fan, Kai Dang, et al. Qwen2. 5-omni technical report. arXiv preprint arXiv:2503.20215, 2025. Fanjia Yan, Huanzhi Mao, Charlie Cheng-Jie Ji, Tianjun Zhang, Shishir G. Patil, Ion Stoica, and Joseph E. Gonzalez. Berkeley function calling leaderboard. https://gorilla.cs.berkeley.edu/blogs/8_berkel ey_function_calling_leaderboard.html, 2024. An Yang, Baosong Yang, Binyuan Hui, Bo Zheng, Bowen Yu, Chang Zhou, Chengpeng Li, Chengyuan Li, Dayiheng Liu, Fei Huang, et al. Qwen2 technical report. arXiv:2407.10671, 2024. An Yang, Anfeng Li, Baosong Yang, Beichen Zhang, Binyuan Hui, Bo Zheng, Bowen Yu, Chang Gao, Chengen Huang, Chenxu Lv, et al. Qwen3 technical report. arXiv preprint arXiv:2505.09388, 2025a. Qize Yang, Shimin Yao, Weixuan chen, Shenghao Fu, Detao Bai, Jiaxing Zhao, Boyuan Sun, Bowen Yin, Xihan Wei, and Jingren Zhou. Humanomniv2: From understanding to omni-modal reasoning with context. CoRR, abs/2506.21277, 2025b. Ruibin Yuan, Yinghao Ma, Yizhi Li, Ge Zhang, Xingran Chen, Hanzhi Yin, Yiqi Liu, Jiawen Huang, Zeyue Tian, Binyue Deng, et al. Marble: Music audio representation benchmark for universal evaluation. Advances in Neural Information Processing Systems, 36:3962639647, 2023. 24 Xiang Yue, Yuansheng Ni, Kai Zhang, Tianyu Zheng, Ruoqi Liu, Ge Zhang, Samuel Stevens, Dongfu Jiang, Weiming Ren, Yuxuan Sun, et al. Mmmu: massive multi-discipline multimodal understanding and reasoning benchmark for expert agi. arXiv:2311.16502, 2023. Xiang Yue, Tianyu Zheng, Yuansheng Ni, Yubo Wang, Kai Zhang, Shengbang Tong, Yuxuan Sun, Ming Yin, Botao Yu, Ge Zhang, et al. Mmmu-pro: more robust multi-discipline multimodal understanding benchmark. arXiv preprint arXiv:2409.02813, 2024. Yongyi Zang, Sean OBrien, Taylor Berg-Kirkpatrick, Julian McAuley, and Zachary Novack. Are you really listening? boosting perceptual awareness in music-qa benchmarks. arXiv preprint arXiv:2504.00369, 2025. Bowen Zhang, Congchao Guo, Geng Yang, Hang Yu, Haozhe Zhang, Heidi Lei, Jialong Mai, Junjie Yan, Kaiyue Yang, Mingqi Yang, Peikai Huang, Ruiyang Jin, Sitan Jiang, Weihua Cheng, Yawei Li, Yichen Xiao, Yiying Zhou, Yongmao Zhang, Yuan Lu, and Yucen He. Minimax-speech: Intrinsic zero-shot text-to-speech with learnable speaker encoder. CoRR, abs/2505.07916, 2025. Chujie Zheng, Shixuan Liu, Mingze Li, Xiong-Hui Chen, Bowen Yu, Chang Gao, Kai Dang, Yuqiong Liu, Rui Men, An Yang, et al. Group sequence policy optimization. arXiv preprint arXiv:2507.18071, 2025. Jeffrey Zhou, Tianjian Lu, Swaroop Mishra, Siddhartha Brahma, Sujoy Basu, Yi Luan, Denny Zhou, and Le Hou. Instruction-following evaluation for large language models. CoRR, abs/2311.07911, 2023. Junjie Zhou, Yan Shu, Bo Zhao, Boya Wu, Zhengyang Liang, Shitao Xiao, Minghao Qin, Xi Yang, Yongping Xiong, Bo Zhang, Tiejun Huang, and Zheng Liu. MLVU: benchmarking multi-task long video understanding. In IEEE/CVF Conference on Computer Vision and Pattern Recognition, CVPR 2025, Nashville, TN, USA, June 11-15, 2025, pp. 1369113701. Computer Vision Foundation / IEEE, 2025a. Ziwei Zhou, Rui Wang, and Zuxuan Wu. Daily-omni: Towards audio-visual reasoning with temporal alignment across modalities. CoRR, abs/2505.17862, 2025b. Deyao Zhu, Jun Chen, Xiaoqian Shen, Xiang Li, and Mohamed Elhoseiny. Minigpt-4: Enhancing visionlanguage understanding with advanced large language models. arXiv:2304.10592, 2023. Haina Zhu, Yizhi Zhou, Hangting Chen, Jianwei Yu, Ziyang Ma, Rongzhi Gu, Yi Luo, Wei Tan, and Xie Chen. Muq: Self-supervised music representation learning with mel residual vector quantization. arXiv preprint arXiv:2501.01108, 2025."
        }
    ],
    "affiliations": [
        "Qwen Team"
    ]
}