{
    "paper_title": "Single-minus gluon tree amplitudes are nonzero",
    "authors": [
        "Alfredo Guevara",
        "Alexandru Lupsasca",
        "David Skinner",
        "Andrew Strominger",
        "Kevin Weil"
    ],
    "sections": [
        {
            "title": "Abstract",
            "content": "Single-minus tree-level $n$-gluon scattering amplitudes are reconsidered. Often presumed to vanish, they are shown here to be nonvanishing for certain \"half-collinear\" configurations existing in Klein space or for complexified momenta. We derive a piecewise-constant closed-form expression for the decay of a single minus-helicity gluon into $n-1$ plus-helicity gluons as a function of their momenta. This formula nontrivially satisfies multiple consistency conditions including Weinberg's soft theorem."
        },
        {
            "title": "Start",
            "content": "Single-minus gluon tree amplitudes are nonzero Alfredo Guevara,1 Alexandru Lupsasca,2,3 David Skinner,4 Andrew Strominger,5 and Kevin Weil2 on behalf of OpenAI 1Institute for Advanced Study 2OpenAI 3Vanderbilt University 4Cambridge University 5Harvard University Single-minus tree-level n-gluon scattering amplitudes are reconsidered. Often presumed to vanish, they are shown here to be nonvanishing for certain half-collinear configurations existing in Klein space or for complexified momenta. We derive piecewise-constant closed-form expression for the decay of single minus-helicity gluon into 1 plus-helicity gluons as function of their momenta. This formula nontrivially satisfies multiple consistency conditions including Weinbergs soft theorem. 6 2 0 F 2 1 ] - [ 1 6 7 1 2 1 . 2 0 6 2 : r The laws of physics are succinctly encoded in scattering amplitudes, which give the quantum probabilities for any given collection of incoming particles to collide and produce any given collection of outgoing particles. These amplitudes may be systematically derived from the Feynman diagram expansion, which perturbatively sums over all possible quantum processes. Theoretical results from the Feynman diagram expansion of the Standard Model agree with experiment to an unprecedented 14 decimal places [13]. In practice, the computation of scattering amplitudes can be extremely difficult.1 Among other obstacles, the growth in the number of Feynman diagrams for an nparticle amplitude is faster than exponential in n. However, despite this apparent complexity, cancellations lead in variety of contexts to very simple final answer. This indicates that our present understanding of the quantum laws of physics is seriously incomplete and that more efficient formulation is needed. The last few decades have seen much effort in this direction and delivered promising insights; see, e.g., [410]. prominent example of this phenomenon arises in the tree-level color-ordered scattering of gluonsthe particles that mediate the strong force and comprise Yang Mills theory. Naively, the n-gluon scattering amplitude involves order n! terms. Famously, for the special case of MHV (maximally helicity violating) tree amplitudes, Parke and Taylor [11] gave simple and beautiful, closedform, single-term expression for all n. By definition, n-gluon MHV amplitudes have 2 minushelicity particles and 2 plus-helicity gluons, which for generic (complexified) kinematics at tree level is the maximally allowed number [4, 1114]. This gives them privileged role in the theory, enabling their use as efficient building blocks for the full YangMills theory. In general, 2 is actually not the maximally allowed number of plus gluons. In this paper, we show that 1 plus (or single-minus) amplitudes are in fact allowed2 with restricted half-collinear kinematics.3 The amplitude is divided into chambers whose walls are regions where sums of various subsets of the half-collinear momenta are orthogonal as described below. The (stripped) amplitudes are piecewise-constant integers in each chamber. The assignment of its value to each chamber is determined from the perturbative BerendsGiele recursion [15], which is equivalent to Feynman diagrams. Moreover, for the special kinematic region corresponding to single-minus decay into n1 plus, we give simple formula for all n. In this special region, the stripped amplitude only takes the values of +1, 1, or 0. The key formula (39) for the amplitude in this region was first conjectured by GPT-5.2 Pro and then proved by new internal OpenAI model. The solution was checked by hand using the BerendsGiele recursion and was moreover shown to nontrivially obey the soft theorem, cyclicity, KleissKuijf, and U(1) decoupling identitiesnone of which are evident from direct inspection. The structural role of these single-minus amplitudes in YangMills theory remains to be understood. We note that, while our expression is dramatic simplification of the direct Feynman-diagram expression, it is entirely possible that yet simpler expression may be obtained with clever choice of analytic continuation, variables or basis, even outside the single-minus decay channel. We suspect that there are more interesting insights to come with our methodology and hope that this paper is step on the road to more complete understanding of the inner structure of scattering amplitudes. Single-minus amplitudes also arise in self-dual Yang Mills theory (SDYM) [16], restricted sector of Yang Mills, and potentially resolve puzzle therein. In general, the tree amplitudes of the Feynman expansion are thought to be equivalent to the fully nonlinear classical theory. However, on the one hand the classical solution space of SDYM is extremely nontrivial [1719], while the tree diagrams were previously supposed to yield trivial two-point and three-point expressions. The latter seem insufficient to reproduce the former. Potentially, the single-minus tree amplitudes in SDYM found here resolve this tension. 1 The aforementioned agreement between theory and experiment required over half century of analytic and numerical work. 2 Witten [5] notes that single-minus amplitudes are supported at point in twistor space; see also [6]. 3 The half-collinear condition can be viewed as restricting the ingoing and outgoing momenta to one-dimensional null circle on the celestial torus at the boundary of Klein space. This paper is organized as follows. In Sec. I, we set up notation, describe the standard MHV amplitudes, explain how half-collinear single-minus amplitudes evade the usual no-go condition, and then derive the general BerendsGiele recursion relation. The solution passes various consistency checks, including the soft theorem, and we provide explicit formulas up to = 6 points, where there are already 32 terms. In Sec. II, we restrict to special kinematic channel denoted R1 with one ingoing minus and 1 outgoing plus gluons. There, using various identities through = 6, we find the answer can be expressed as signed product of 2 projection operators. This motivates guess for the all-n formula, which we verify directly via the BerendsGiele recursion. We derive multi-δ-function identity in App. and give more details of the single-minus specialization of the BerendsGiele recursion in App. B. Further details of our analysis, including longer general formula for the single-minus amplitude outside of R1, will appear elsewhere. Our main result immediately leads to number of extensions. The construction generalizes directly from gluon to graviton amplitudes and has simple supersymmetrization. The results should transform under the S-algebra, the Lw1+ algebra [20, 21], and their supersymmetric extensions. In the context of celestial holography, the Mellin transform of the amplitudes in some sectors is given by Lauricella functions. These results will be reported elsewhere. 2 where zij zi zj and zij zi zj. We take our polarization vectors to be ϵ = 2 r]j [rj] , ϵ+ = k]r rk , (6) where and r] are arbitrary reference spinors. We note that with our conventions (2) for fixing the little group frame, ϵ has mass dimension 1, which will affect the mass dimensions of the amplitudes given below. To avoid proliferation of factors of 2π, we normalize all δ-functions such that (cid:90) δ(x) dx = 2π, 1 + iϵ 1 iϵ ϵ0= δ(x). (7) Throughout this paper, we use the standard Feynman propagator 1/(p2 + iϵ). Other prescriptions have been considered in Klein signature [22]. To clarify our conventions, with our normalization, the n-point MHV (double-minus) color-ordered tree amplitude AMHV (1+, . . . r, . . . s, . . . , n+) is AMHV = rs4 1223 n1 (cid:32) (cid:88) (cid:33) . pk δ4 k=1 (8) In fact, for full generality, we will need to be careful about the iϵ prescription. We therefore introduce the regularized Parke-Taylor factor PTcyc = (cid:89) k=1 [k, + 1] p2 k,k+1 + iϵ = (cid:89) k=1 1 zk,k+1+iϵ sgk,k+1 , (9) A. Notation and useful identities with + 1 1, and where we have defined This subsection defines our notation4 and presents several useful identities. We use spinor-helicity variables for massless momenta [13] pα α = λα λ α, (1) where (λ, λ) are real spinors in (2, 2) Klein signature. As usual in the description of scattering, it is convenient to fix suitable Lorentz and helicity frame to perform the calculation, which can be restored at the end. With the benefit of hindsight, we write = λi = (1, zi), i] = λi = ωi(1, zi), (2) with zi and zi real and independent. We use standard brackets for contracting helicity spinors, λβ ij = λiλj = ϵαβλα , β λ λ α λj , [ij] = (cid:104)λi = ϵ α β (4) (3) (cid:105) with p2 ij = (pi + pj)2 = ij[ij]. In our parameterization, ij = zij, [ij] = ωiωj zij, (5) 4 Our conventions are close to those of [5], except for factor of 2 on the LHS of (2.7) therein. sgij = sg (cid:16) [λi λj] (cid:17) (10) in the frame (2).5 Here, sg(x) = 2Θ(x) 1 denotes the sign function and Θ(x) is the step function. The MHV tree amplitude can then be written using PTcyc as AMHV = irs4 PTcyc δ4 (cid:32) (cid:88) (cid:33) . pk k= (11) Away from walls where k+1 = 0, we may ignore the iϵ prescription and (11) reduces to (8). It will also be useful to define an incomplete or open chain Parke-Taylor factor as PT1n = n1 (cid:89) k=1 [k, + 1] p2 k,k+1 + iϵ = n1 (cid:89) k=1 1 zk,k+1+iϵ sgk,k+ . (12) This incomplete factor PT1n is what naturally appears in App. inside the BerendsGiele recursion as the denominator of the off-shell current with momentum p1n: the cyclic factor is opened because one leg is off-shell. 5 Without fixing frame, we would take sgij = sg([ij]irjr), , the difference where is any fixed reference spinor. In AMHV in choices of can be absorbed by ϵ. I. SINGLE-MINUS AMPLITUDES In this section, we first explain why the standard argument that the single-minus n-particle tree amplitudes vanish in fact fails when all the external particles become collinear. We then present recursion relation, derived in App. B, that determines these amplitudes for all n. A. The half-collinear regime The kinematic locus we call the half-collinear regime is defined by ij = i, {1, . . . , n}. (13) In (2,2) signature, this is compatible with nonzero [ij], unlike in Minkowski space.6 In the frame (2), this locus implies all zij = 0 but does not restrict the ωi or zi. We will now show that single-minus tree amplitudes can be nonzero in the half-collinear regime. This can be demonstrated by exposing the loophole in the powercounting argument that single-minus amplitudes vanish. We choose polarization vectors for the gluons as in (6) ϵ 1 = 2 r]1 [r1] , ϵ+ = 2 r[a ra for 2, (14) where r] and are arbitrary reference spinors. Now, for generic kinematics, if we choose = 1, then we find that all the polarization vectors are orthogonal. As such, the amplitude can be nonzero only if they are contracted with momenta in the numerator. Powers of momenta in the numerator appear only from vertices, and there are at most 2. These are insufficent to contract with all the polarization vectors. Hence, single-minus amplitudes vanish for generic kinematics. The loophole in the argument is that we cannot choose = 1 if 1a = 0 for any a, as the polarization vectors ϵ+ would become singular. Therefore, we cannot conclude that the amplitude vanishes on the locus where 1a = 0. In fact, the single-minus 3-point amplitude (also anti-MHV) is known to have factor δ(12)δ(13) restricting to this locus. Moreover, it can be shown by induction that the n-point amplitude may only be supported when all ij = 0. To express the fact that it is supported in the halfcollinear regime, the single-minus tree-level n-gluon amplitude An(1, 2+, . . . , n+) can be written as An = i2n r1n+1 r2r3 rn A1n (cid:89) a=2 δ(1a) (cid:32) (cid:88) (cid:33) . riλi δ2 i=1 (15) 6 The half-collinear regime also makes sense for complex momenta. We believe single-minus amplitudes also exist with complex momenta; it would be interesting to understand their continuation. 3 Here, we introduced the stripped amplitude A1n. The δfunctions imposing 1a = 0 simply ensure the full amplitude is supported only in the half-collinear regime, while the δ-functions in λ enforce the remaining components of momentum conservation. The prefactor ensures that An has the correct little-group scaling for single-minus amplitude. The collinear δ-functions ensure that this prefactor and the λ δ-functions are independent of the reference spinor r, as long as it is chosen so that r1 = 0. The interest is in the stripped amplitude A1n, which carries no helicity weight and depends only on kinematics. In the frame (2) and picking = (0, 1), A1n is function only of {λi}, and (15) becomes7 (cid:32) (cid:88) (cid:89) An = i2nA1n δ(z1a) δ (cid:33) . λi (16)"
        },
        {
            "title": "We will sometimes use the shorthand",
            "content": "a=2 i=1 δ1n = i1n n1 (cid:89) k=1 δ(zk,k+1) (17) to denote these half-collinear δ-functions. B. The recursion relation The first main result of this paper is the recursion relation presented in (21) below. This relation determines all n-particle single-minus tree amplitudes. Solving it is equivalent to, but slightly simpler than, summing the Feynman diagrams for these amplitudes. For any ordered list = (q, . . . , p), we first define the λi using the frame (2).8 We list momentum λS = (cid:80) then define the preamplitude AS by taking iS Aq = 1, Aqp = 0, (18) when = 1 and = 2, and extending recursively to 3 via Aqp = (cid:88) o.p. VλS1 λSA (cid:89) a=1 ASa , (19) where the sum is over all ordered partitions of (q p) = (S1S2 SA) into 3 parts. 7 Some readers may find more intuitive an alternative expression, λ, λ (cid:112)ωλ, which renders the obtained in the frame λ 1 ω polarizations (14) dimensionless and gives An scaling as ωn: An i2n (cid:12) (cid:12) (cid:12) (cid:12) ω1 ω2ω3 ωn (cid:12) (cid:12) A1n (cid:12) (cid:12) (cid:89) a=2 δ(z1a) δ (cid:112)ωiλi (cid:33) . (cid:32) (cid:88) i=1 8 In generic frame, λS = (cid:80) λiir for any reference spinor r. The dependence of both this expression and the sign functions on drops out on the support of the collinear δ-functions. iS Here, the vertex term VλS1 λSk is defined by 2. Reflection symmetry: 4 Vλ1λn = sgk,k+1 Θ n1 (cid:89) k= (cid:104)λ1k (cid:104)λk λk+1m (cid:105) λk+1 (cid:105) , (20) in the case where each block Sa contains only one ele- = 1. Having determined AS, the ment. We also take Vλ1 stripped amplitude A1n itself is then given by A1n = (cid:88) o.p. (cid:99)PTλS1 λSA (cid:89) a=1 ASa , (21) where the ordered partition now has 1 parts, while (cid:99)PTλ1λn = Vλ1λn Vλ1λn , (22) where Vλ1λn is given by (20) with + sign within the argument of Θ. We may refer to this object as on-shell ParkeTaylor, as it is related to PT1n by standard LSZ reduction procedure fleshed out in App. B. It is also useful to note that the incomplete ParkeTaylor factor PT1n, the collinear δ-functions and the are related via the useful identity vertex function Vλ1λn PT1n δ1n Vλ1λn (cid:104)λ1j (cid:105) λj+1n p2 1n + iϵ n1 (cid:88) = j=1 PT1j PTj+1n, which follows from master identity given in App. A. C. Consistency checks It follows from the definition (15) that the stripped amplitudes A12n satisfy the following properties: 1. Cyclicity: A12n = A2n1. (24) A12n = (1)nAn21. (25) 3. U(1) decoupling: A12n + A13n2 + A1423 + . . . = 0. (26) 4. KleissKuijf (KK) relations. For instance, at = 5, A12345 + A12354 + A12435 + A14235 = 0. (27) (The general form of these relations can be found, e.g., in [13]). 5. Weinbergs soft theorem:9 1 lim ωn0 A1n = (cid:1)A1n1 . (cid:0)sgn1,n + sgn1 It is far from evident that all these properties are obeyed by the solution of the recursion relation (21). Nonetheless, we have verified by explicit calculation that they do indeed hold. Details of this calculation will appear elsewhere. (28) D. Concrete examples From (21), the 3-point to 6-point single-minus stripped (23) amplitudes are, using sgi,jk = sg (cid:16)(cid:104)λi, λj + λk (cid:105)(cid:17) , etc., (29) (30) (31) A123 = sg12, A1234 = 1 (sg23 sg41 + sg12 sg34); A12345 = (cid:104) 1 4 sg51 sg34 sg2,34 + sg51 sg23 sg23,4 sg51 sg2,34 sg23,4 + sg45 sg23 sg1,23 + sg45 sg12 sg12,3 sg45 sg1,23 sg12, + sg51 sg45 sg12,34 + sg12 sg34 sg12,34 (cid:105) , A123456 = (cid:104) 1 sg1,23 sg12,3 sg123,4 sg56 + sg1,23 sg123,4 sg23 sg56 + sg1,234 sg12,34 sg123,4 sg56 sg1,234 sg12,34 sg34 sg56 sg1,234 sg123,4 sg23 sg56 sg1,234 sg2,34 sg23,4 sg56 + sg1,234 sg2,34 sg34 sg56 + sg1,234 sg23 sg23,4 sg56 + sg12 sg12,3 sg123,4 sg56 sg12 sg12,34 sg123,4 sg56 + sg12 sg12,34 sg34 sg56 + sg12 sg345,6 sg45,6 sg56 sg1,23 sg12,3 sg45 sg45,6 + sg1,23 sg23 sg45 sg45,6 + sg12 sg12,3 sg45 sg45,6 sg12 sg3,45 sg34,5 sg345,6 + sg12 sg3,45 sg345,6 sg45 + sg12 sg34 sg34,5 sg345,6 sg2,34 sg23,4 sg234,5 sg61 + sg2,34 sg234,5 sg34 sg61 + sg2,345 sg23,45 sg234,5 sg61 sg2,345 sg23,45 sg45 sg61 sg2,345 sg234,5 sg34 sg61 sg2,345 sg3,45 sg34,5 sg61 + sg2,345 sg3,45 sg45 sg61 + sg2,345 sg34 sg34,5 sg61 + sg23 sg23,4 sg234,5 sg61 sg23 sg23,45 sg234,5 sg61 + sg23 sg23,45 sg45 sg61 + sg345,6 sg45 sg45,6 sg61 + sg23 sg45,6 sg56 sg61 + sg34 sg345,6 sg56 sg61 (cid:105) . (32) Clearly more concise formula is needed! of the previous section dramatically simplify to II. AMPLITUDES IN THE FIRST REGION This section presents the next main result of this paper: simple formula for the n-point single-minus amplitudes (21) with partially restricted kinematics within the halfcollinear regime. A123R1 = A1234R1 = A12345R1 = 1 2 1 4 1 8 (sg12 + sg23), (sg12 + sg23)(sg34 + sg41), (sg12 + sg23)(cid:0)sg34 + sg1,23 (sg45 + sg51), (cid:1) A123456R1 = 1 16 (cid:0)sg45 + sg1,234 (sg12 + sg23)(cid:0)sg34 + sg1,23 (cid:1)(sg56 + sg61). (cid:1) 5 (35) (36) (37) (38) A. Restricted kinematics within the half-collinear regime This suggests the possibility that there may exist shorter formula for all n. We define the kinematic region R1 by the condition that, with λ α = ω(1, z), there exists at least one SO(2, 2) frame in which C. General formula ω1 < 0, ωa > 0, {2, . . . , n}. (33) conjecture that extends the pattern (35)(38) to all n-particle amplitudes in region R1 is This region is fully consistent with the half-collinear regime where all ij = 0 and further restricts the kinematics within that regime. Unlike in Minkowski signature, we note that in Klein signature, there is no invariant meaning to particle having positive frequency. Nonetheless, R1 is SO(2, 2)-invariant because we only ask that there exists some frame in which (33) holds. Geometrically, it amounts to requiring that there exists some straight line through the origin in R2 such that λ1 lies on one side and all other λa lie on the other. R1 describes single ingoing self-dual gluon decaying to 1 outgoing anti-self-dual gluons, where ingoing/outgoing refers to the frame in which the inequalities (33) hold. Interestingly, we will see that the amplitudes dramatically simplify in R1, where certain sign functions become independent of the frequencies ωk. In particular, sgij = sg zij, sg1j = sg zj1 i, 2. (34) Note however that the ωk cannot be eliminated from expressions such as sg2,34. B. Concrete examples In region R1, using (34), momentum conservation and spinor identities, one may show that the long expressions 9 Through (16), this is seen to follow from the conventional form (cid:18) An 1r nr [n,1] p2 n,1+iϵ n1,r nr [n,n1] p2 n,n1+iϵ (cid:19) An1. A1n (cid:12) (cid:12)R1 = 1 2n2 n1 (cid:89) m= (cid:0)sgm,m+1 + sg1,2m (cid:1). (39) How sensible is this guess? Regarding requirements (24) (28), the region R1 is clearly not cyclically invariant, as it singles out particle 1. However, we can trivially construct cyclically invariant answer by using cyclicity to extend (39) to other regions Rk where only particle has ωk < 0. The remaining four conditions, when combined with cyclicity, do impose quite nontrivial constraints within R1. These constraints are all obeyed by our solution (39). In fact, in this form, it is direct to check the soft theorem (28) in the last label, and with some more work, in any other label but 1. The simplified form (21) has simple interpretation: in R1, each factor is 1 2 (1 1) {1, 0, 1}, so A1nR1 is piecewise-constant and jumps across codimension-one walls where the relevant brackets change sign. The product form simply makes those walls explicit. The rest of this work is devoted to proving that the conjecture (39) is correct. The proof uses ideas from time-ordered perturbation theory and proceeds in three parts. First, one shows that in R1, Vλ2λn (cid:12) (cid:12) (cid:12)R1 = 0, (40) whilst Vλ2λn that with (40), the recursion (21) collapses to become remains nonzero. Second, one must show A1n (cid:12) (cid:12)R1 = Vλ2λn (cid:12) (cid:12) (cid:12)R1 . (41) Finally, one must show that in R1, Vλ2λn final formula (39). We briefly sketch each step below. reduces to our 1. Vanishing of We wish to show that within R1, Vλ2λn = (42) for 3. This can be interpreted as causality condition10 in R1 in the frame in which (33) holds. Importantly, all the ωs appearing in this expression are positive. This will force at least one of the arguments of the Θ-functions to be negative, implying (42). For each cut j, write leftand right-partial sums as (cid:88) λL = λa = ΩL(1, zL), λR = a=2 (cid:88) a=j+1 λa = ΩR(1, zR), (43) (44) with ΩL,R > 0 and zL,R weighted averages of the zs on each side. Then (cid:104)λR (cid:104)λj+1 λL λj (cid:105) (cid:105) = ΩLΩR zR,L, = ωjωj+1 zj+1,j. (45) (46) Since ΩLΩR > 0 and ωjωj+1 > 0, the sign of the ratio in the Θ-factor in (20) is the sign of zR,L/zj+1,j. weighted-variance identity implies that as runs from 2 to n, there must be at least one cut for which zR,L has the same sign as the adjacent increment zj+1,j. For that j, the ratio is positive, so the corresponding factor Θ(positive) = 0, and thus the whole product in (20) vanishes. 2. Collapsing the recursion We have in fact shown something slightly more general: for every consecutive {2, . . . , n} with 2, VλS1 λSk = 0. Then, from (19), we find that on R1, AS (cid:12) (cid:12) (cid:12)R = 0, (47) (48) while singletons remain, Ai = 1. This collapses the recursion. Using the cyclicity of the color-ordered amplitude, we may write A1n = A2n1. (49) 10 It is very reminiscent of the largest-time equation in time-ordered perturbation theory [23]. 6 Now apply the recursion (21) to A2n1, i.e., partition the ordered set (2, 3, . . . , n). By (48), the only nonzero contribution is the all-singleton partition (23 n), so A2n1 (cid:12) (cid:12) (cid:12)R = (cid:99)PTλ2 λ3λn (cid:12) (cid:12) (cid:12)R1 . (50) But since Vλ2λn this list. Therefore, = 0, we have (cid:99)PT = = for A1n (cid:12) (cid:12) (cid:12)R1 = A2n1 (cid:12) (cid:12) (cid:12)R1 = Vλ2λn . (51) This proves the collapse of the recursion (21) to (41). 3. Evaluating Vλ2λn Last but not least, we reorganize the vertex in terms of sign functions. Recall that Vλ2λn (cid:104)λ2m (cid:104)λm sgm,m+1 Θ Vλ2λn (cid:89) n=2 = is defined as (cid:105) . (52) λm+1n (cid:105) λm+1 By momentum conservation, λm+1n = λ1 λ2m, and using the antisymmetry of the bracket, (52) becomes Vλ2λn = n1 (cid:89) m= sgm,m+1 Θ (cid:104)λ1 (cid:104)λm (cid:105) λ2m λm+1 . (cid:105) (53) Using the relation between the sg and Θ functions, one readily finds that Vλ2λn = 1 2n2 n1 (cid:89) (cid:16) m= sgm,m+1 + sg (cid:16)(cid:104)λ1 λ2m (cid:105)(cid:17)(cid:17) . (54) Combining (51) with (54) recovers exactly our final result (39). ACKNOWLEDGMENTS We are grateful to Nima Arkani-Hamed, Freddy Cachazo, Juan Maldacena, Mark Spradlin and Anastasia Volovich for useful discussions. AL was supported in part by NSF grant AST-2307888, the NSF CAREER award PHY-2340457, and the Simons Foundation grant SFI-MPS-BH-00012593-09. AG acknowledges the Roger Dashen membership at the IAS, and additional support from DOE grant DE-SC0009988. AS & DS are supported in part by the Simons Collaboration for Celestial Holography. DS is also supported by the STFC (UK) grant ST/X000664/1. AS is supported by the Black Hole Initiative and DOE grant DE-SC/0007870, and is grateful for the hospitality of OpenAI where this project was completed. Consider the well-known identity Appendix A: The master identity (cid:20) a1 (b2 + iϵ) + a2 (b1 + iϵ) (cid:21) δ(a1b1 + a2b2) = 2 [sg(a1) + sg(a2)]δ(b1)δ(b2), (A1) 7 which readily follows from writing 1 we use manipulations from time-ordered perturbation theory to derive powerful generalization of this identity: 2 δ(b), where the δ-function is normalized as in (7). In this appendix, b+iϵ = PV 1 (cid:32) (cid:88) δ k=1 akbk (cid:33) (cid:88) i=1 ai j=i(bj + iϵ) (cid:81) = 1 (2i)n1 (cid:34) (cid:88) sg(ai1) + (cid:88) i1<i2<i3 sg(ai1 ai2ai3) + (cid:88) i1<<i sg(ai1ai2ai3 ai4 ai5) + . . . (cid:35) (cid:89) i=1 δ(bi). (A2) For example, when = 3, this generalizes the identity (A1) to LHS = δ (cid:32) 3 (cid:88) (cid:33)(cid:20) aibi a1 (b2 + iϵ)(b3 + iϵ) + a2 (b1 + iϵ)(b3 + iϵ) + a3 (b1 + iϵ)(b2 + iϵ) (cid:21) = RHS = [sg(a1) + sg(a2) + sg(a3) + sg(a1) sg(a2) sg(a3)]δ(b1)δ(b2)δ(b3). i=1 1 4 (A3) (A4) To establish the generalized identity (A2), we prove its Fourier transform, that is, the corresponding identity in the time domain where we may think of the bi as energies. We then have the following: (cid:90) dnb ei (cid:80) tkbk δ (cid:32) (cid:88) (cid:33) (cid:88) akbk k=1 i= ai j=i(bj + iϵ) (cid:81) (cid:88) (cid:90) (cid:90) dγ = i=1 dnb ei (cid:80)(tkγak)bk ai j=i(bj + iϵ) (cid:81) = (2πi)n (cid:88) (cid:90) i=1 dγ δ(ti γai)ai (cid:89) j=i Θ(tj + γaj) (A5) = (2πi)n1(2π) (cid:90) dγ (cid:88) i=1 γ Θ(ti + γai) (cid:89) j=i = (2πi)n1(2π) (cid:34) (cid:89) i=1 Θ(ai) (cid:35) Θ(ai) . (cid:89) i=1 Finally, Fourier transforming in ti yields Θ(tj + γaj) = (2πi)n1(2π) (cid:34) (cid:89) (cid:35)γ= Θ(ti + γai) (A6) i=1 γ= (A7) (cid:32) (cid:88) δ k=1 akbk (cid:33) (cid:88) i=1 ai j=i(bj + iϵ) (cid:81) = i1n (cid:89) i= Θ(ai)δ(bi) i1n (cid:89) i=1 Θ(ai)δ(bi), (A8) which recovers the master identity after using Θ(x) = 1+sg(x) 2 . Appendix B: Derivation of recursion relation This appendix derives the BerendsGiele recursion relation [15] for the off-shell currents in YangMills theory. In turn, this implies recursion formula for the planar form factors of the theory. In QFT, n-point scattering amplitudes can be computed from form factors FS with one leg off-shell and 1 legs on-shell. For color-ordered gluon amplitude, the ordering is inherited from the corresponding form factor. 1. BerendsGiele Recursion 8 To avoid notational clutter, we have here taken the last particle to be negative helicity (as opposed to the first one in the main text). The final on-shell formula is insensitive to this choice. We thus write A1n = lim p2 ip2 F1n1 δ4 (cid:32) (cid:88) (cid:33) , pi i= pn = n1 (cid:88) i=1 pi. (B1) These planar coefficients satisfy the BerendsGiele (BG) recursion, equivalent to summing over Feynman diagrams with one leg off-shell. When the rest of the (on-shell) legs are plus-helicity gluons, it is known that this recursion is equal to the one in Self-Dual YangMills theory (SDYM) [16, 24], which reads F1m = 1 p2 1m + iϵ m1 (cid:88) j=1 (cid:104)λ1j λj+1m (cid:105) F1j Fj+1m, (B2) where p1m = (cid:80)m its classical solutions. i=1 pi and λ1m = (cid:80)m i=1 λi. This is essentially the equation of motion of the theory and determines 2. General form factor The form factor recursion (B2) is solved by means of our two-dimensional preamplitudes AS in (19), by replacing one vertex by PT where PT refers to the incomplete Parke-Taylor factor (12). Let (S1 SA) be an ordered partition of the word (1 m), and write the block momenta Ka = (cid:80) λi. We claim the solution to the recursion (B2) is iSa F1m = (cid:88) o.p. PTK1KA (cid:16) ASa δSa (cid:17) , (cid:89) a= (B3) where the sum is over all possible ordered partitions of (1 m) into blocks Sa, as well as over the number = 1, . . . , of blocks. As in the main text, δSa denotes the product of δ(zi,i+1) internal to the block Sa. To see this, we first establish (23), which we quote again here for the benefit of the reader: PT1n δ1n Vλ1λn = (cid:105) (cid:104)λ1j λj+1n p2 1n + iϵ n1 (cid:88) j=1 PT1j PTj+1n. (B4) Away from the half-collinear regime, we have δ1n = 0, the iϵs on the RHS may be neglected, and this identity is standard algebraic identity for Parke-Taylor factors. The iϵs are important in the half-collinear limit and the general identity (B4) follows from (A2) with the values (cid:104)λ1r λr+1n br = p2 ar = λℓ+1 (cid:104)λℓ (cid:105) (cid:89) (B5) (cid:105) , r,r+1, ℓ=r for = 1, . . . , 1, while an = (cid:81) ℓ[ℓ, ℓ + 1] and bn = p2 1...n. Next, we will verify (B3) is solution by inserting it into the RHS of (B2). For each term in the sum over in (B2), we now have sums over all ordered partitions (1 j) = (L1 LB) and (j + 1 m) = (R1 RC): F1m = m1 (cid:88) (cid:88) j=1 o.p. (cid:105) (cid:104)λ1j λj+1m p2 1m + iϵ PTL1L2LB PTR1R2RC AL1 ALB AR1 ARC δL1 δLB δR1 δRC , (B6) where we have abused notation slightly, denoting both the set and its block momentum by the same letter La or Rb. Note that λ1j = (cid:80) λRk . The second line depends only on the total partition (S1 SA) = (L1 LBR1 RC), with = + C, and does not know about the separation into left and right. For fixed such partition, the j-sum is exactly the PT recursion (B4): it produces (i) PT for the combined partition, and (ii) contact term δ . λLk and λj+1m = (cid:80) k In equations, we have F1m = = = (cid:88) n.t.p. (cid:88) n.t.p. (cid:88) n.t.p. AS1 ASA δS1 δSA (cid:88) B+C=A (cid:104)λ1j λj+1m p2 1m + iϵ (cid:88) (cid:105) PTL1LB PTR1RC AS1 ASAVS1S2SA AS1 ASA δS1 δSAPTS1S2SA δ1m AS1 ASA δS1 δSAPTS1S2SA + δ1m A1m, n.t.p. (B7) (B8) (B9) where n.t.p. denotes nontrivial partitions (having more than one block). The PT piece reproduces the nontrivial A-block contribution on the LHS of (B3). The contact piece δ precisely stitches blocks together by -vertex, and the resulting sum over nontrivial partitions is the recursion (19) for the preamplitudes. The final term in the third line is the missing 1-term partition, thus recovering (B3). 3. LSZ Reduction The single-minus amplitude is obtained by putting the last leg on-shell, as in (B1). On the support of the collinear δ-functions inside each block of the form factor (B3), every block momentum Ka is null. The only remaining singular factor is the PT term associated to adjacent channels. The on-shell limit of PT factor is evaluated using the master identity in App. A, resulting in PTK1Kk δ4 p2 lim p2 n0 (cid:32) (cid:88) a=1 (cid:33) Ka + pn = (cid:99)PTK1Kk δ1k,nδ2 (cid:88) = (VK1Kk VK1Kk )δ1k,nδ λj (cid:88) λj . (B10) After stripping off the universal momentum-conservation support (here, (cid:80)n (B10) yield, after some algebra, the final result (21): i= λi = 0, so λn = (cid:80)n1 i=1 λi), (B3) and A1n = (cid:88) (1n1)=S1...Sk (cid:99)PTλS1 λSk (cid:89) a=1 ASa . (B11) [1] T. Aoyama, T. Kinoshita, and M. Nio, Revised and Improved Value of the QED Tenth-Order Electron Anomalous Magnetic Moment, Phys. Rev. 97 no. 3, (2018) 036001, arXiv:1712.06060 [hep-ph]. [2] L. Morel, Z. Yao, P. Cladé, and S. Guellati-Khélifa, Determination of the fine-structure constant with an accuracy of 81 parts per trillion, Nature 588 no. 7836, (2020) 6165. [3] X. Fan, T. G. Myers, B. A. D. Sukra, and G. Gabrielse, Measurement of the Electron Magnetic Moment, Phys. Rev. Lett. 130 no. 7, (2023) 071801, arXiv:2209.13084 [physics.atom-ph]. [4] L. J. Dixon, Calculating scattering amplitudes efficiently, in Theoretical Advanced Study Institute in Elementary Particle Physics (TASI 95): QCD and Beyond, pp. 539584. 1, 1996. arXiv:hep-ph/9601359. [5] E. Witten, Perturbative gauge theory as string theory in twistor space, Commun. Math. Phys. 252 (2004) 189258, arXiv:hep-th/0312171. [6] R. Roiban, M. Spradlin, and A. Volovich, On the tree level matrix of Yang-Mills theory, Phys. Rev. 70 (2004) 026009, arXiv:hep-th/0403190. [7] Z. Bern, L. J. Dixon, and V. A. Smirnov, Iteration of planar amplitudes in maximally supersymmetric Yang-Mills theory at three loops and beyond, Phys. Rev. 72 (2005) 085001, arXiv:hep-th/0505205. [8] R. Britto, F. Cachazo, B. Feng, and E. Witten, Direct proof of tree-level recursion relation in Yang-Mills theory, Phys. Rev. Lett. 94 (2005) 181602, arXiv:hep-th/0501052. [9] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, A. B. Goncharov, A. Postnikov, and J. Trnka, Grassmannian Geometry of Scattering Amplitudes. Cambridge University Press, 4, 2016. arXiv:1212.5605 [hep-th]. [10] N. Arkani-Hamed and J. Trnka, The Amplituhedron, JHEP 10 (2014) 030, arXiv:1312.2007 [hep-th]. [11] S. J. Parke and T. R. Taylor, An amplitude for n-gluon scattering, Phys. Rev. Lett. 56 (1986) 24592460. [12] M. T. Grisaru and H. N. Pendleton, Some Properties of Scattering Amplitudes in Supersymmetric Theories, Nucl. Phys. 124 (1977) 8192. 10 [13] H. Elvang and Y.-t. Huang, Scattering Amplitudes, arXiv:1308.1697 [hep-th]. [14] Z. Bern, L. J. Dixon, D. C. Dunbar, and D. A. Kosower, One loop point gauge theory amplitudes, unitarity and collinear limits, Nucl. Phys. 425 (1994) 217260, arXiv:hep-ph/9403226. [15] F. A. Berends and W. T. Giele, Recursive Calculations for Processes with Gluons, Nucl. Phys. 306 (1988) 759808. [16] D. Cangemi, Selfdual Yang-Mills theory and one loop like - helicity QCD multi - gluon amplitudes, Nucl. Phys. 484 (1997) 521537, arXiv:hep-th/9605208. [17] R. S. Ward and R. O. Wells, Twistor Geometry and Field Theory. Cambridge University Press, Cambridge, 1990. [18] R. S. Ward, On self-dual gauge fields, Physics Letters 61 no. 2, (1977) 8182. [19] M. F. Atiyah, N. J. Hitchin, V. G. Drinfeld, and Y. I. Manin, Construction of instantons, Physics Letters 65 no. 3, (1978) 185187. [20] A. Guevara, E. Himwich, M. Pate, and A. Strominger, Holographic symmetry algebras for gauge theory and gravity, JHEP 11 (2021) 152, arXiv:2103.03961 [hep-th]. [21] A. Strominger, w1+ Algebra and the Celestial Sphere: Infinite Towers of Soft Graviton, Photon, and Gluon Symmetries, Phys. Rev. Lett. 127 no. 22, (2021) 221601, arXiv:2105.14346 [hep-th]. [22] N. Arkani-Hamed, F. Cachazo, C. Cheung, and J. Kaplan, The S-Matrix in Twistor Space, JHEP 03 (2010) 110, arXiv:0903.2110 [hep-th]. [23] S. Caron-Huot, Loops and trees, JHEP 05 (2011) 080, arXiv:1007.3224 [hep-ph]. [24] W. A. Bardeen, Self-dual yang-mills theory, integrability and multiparton amplitudes, Progress of Theoretical Physics Supplement 123 (02, 1996) 18. https://doi.org/10.1143/PTPS.123.1."
        }
    ],
    "affiliations": [
        "Cambridge University",
        "Harvard University",
        "Institute for Advanced Study",
        "OpenAI",
        "Vanderbilt University"
    ]
}