{
    "paper_title": "Urban Spatio-Temporal Foundation Models for Climate-Resilient Housing: Scaling Diffusion Transformers for Disaster Risk Prediction",
    "authors": [
        "Olaf Yunus Laitinen Imanov",
        "Derya Umut Kulali",
        "Taner Yilmaz"
    ],
    "sections": [
        {
            "title": "Abstract",
            "content": "Climate hazards increasingly disrupt urban transportation and emergency-response operations by damaging housing stock, degrading infrastructure, and reducing network accessibility. This paper presents Skjold-DiT, a diffusion-transformer framework that integrates heterogeneous spatio-temporal urban data to forecast building-level climate-risk indicators while explicitly incorporating transportation-network structure and accessibility signals relevant to intelligent vehicles (e.g., emergency reachability and evacuation-route constraints). Concretely, Skjold-DiT enables hazard-conditioned routing constraints by producing calibrated, uncertainty-aware accessibility layers (reachability, travel-time inflation, and route redundancy) that can be consumed by intelligent-vehicle routing and emergency dispatch systems. Skjold-DiT combines: (1) Fjell-Prompt, a prompt-based conditioning interface designed to support cross-city transfer; (2) Norrland-Fusion, a cross-modal attention mechanism unifying hazard maps/imagery, building attributes, demographics, and transportation infrastructure into a shared latent representation; and (3) Valkyrie-Forecast, a counterfactual simulator for generating probabilistic risk trajectories under intervention prompts. We introduce the Baltic-Caspian Urban Resilience (BCUR) dataset with 847,392 building-level observations across six cities, including multi-hazard annotations (e.g., flood and heat indicators) and transportation accessibility features. Experiments evaluate prediction quality, cross-city generalization, calibration, and downstream transportation-relevant outcomes, including reachability and hazard-conditioned travel times under counterfactual interventions."
        },
        {
            "title": "Start",
            "content": "IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 1 Urban Spatio-Temporal Foundation Models for Climate-Resilient Housing: Scaling Diffusion Transformers for Disaster Risk Prediction Olaf Yunus Laitinen Imanov, Derya Umut Kulali, and Taner Yilmaz 6 2 0 2 ] . [ 1 9 2 1 6 0 . 2 0 6 2 : r AbstractClimate hazards increasingly disrupt urban transportation and emergency-response operations by damaging housing stock, degrading infrastructure, and reducing network accessibility. This paper presents Skjold-DiT, diffusiontransformer framework that integrates heterogeneous spatiotemporal urban data to forecast building-level climate-risk indicators while explicitly incorporating transportation-network structure and accessibility signals relevant to intelligent vehicles (e.g., emergency reachability and evacuation-route constraints). Concretely, Skjold-DiT enables hazard-conditioned routing constraints by producing calibrated, uncertainty-aware accessibility layers (reachability, travel-time inflation, and route redundancy) that can be consumed by intelligent-vehicle routing and emergency dispatch systems. Skjold-DiT combines: (1) Fjell-Prompt, prompt-based conditioning interface designed to support crosscity transfer; (2) Norrland-Fusion, cross-modal attention mechanism unifying hazard maps/imagery, building attributes, demographics, and transportation infrastructure into shared latent representation; and (3) Valkyrie-Forecast, counterfactual simulator for generating probabilistic risk trajectories under intervention prompts. We introduce the Baltic-Caspian Urban Resilience (BCUR) dataset with 847,392 building-level observations across six cities, including multi-hazard annotations (e.g., flood and heat indicators) and transportation accessibility features. Experiments evaluate prediction quality, cross-city generalization, calibration, and downstream transportation-relevant outcomes, including reachability and hazard-conditioned travel times under counterfactual interventions. Index TermsDiffusion Transformers, Intelligent Transportation Systems, Climate-Resilient Housing, Urban Foundation Models, Multi-Modal Learning, Counterfactual Generation, Smart Cities I. INTRODUCTION HE convergence of rapid urbanization, climate change, and evolving transportation needs presents critical challenges to global urban resilience. In the context of World Urban Forum 13 (WUF13), where resilient housing and inclusive mobility are emphasized, there is growing need for quantitative, city-scale Manuscript received February 5, 2026. (Corresponding author: Olaf Yunus Laitinen Imanov.) This work was supported by the Technical University of Denmarks Climate Adaptation Initiative and the Baltic-Caspian Urban Research Consortium. O. Y. L. Laitinen Imanov is with the Department of Applied Mathematics and Computer Science (DTU Compute), Technical University of Denmark, Kongens Lyngby, Denmark (e-mail: oyli@dtu.dk; ORCID: 0009-0006-51840810). D. U. Kulali is with the Department of Engineering, Eskisehir Technical University, Eskisehir, Türkiye (e-mail: d_u_k@ogr.eskisehir.edu.tr; ORCID: 0009-0004-8844-6601). T. Yilmaz is with the Department of Computer Engineering, Afyon Kocatepe taner.yilmaz@usr.aku.edu.tr; University, Afyonkarahisar, Türkiye (e-mail: ORCID: 0009-0004-5197-5227). decision support that links climate risk, housing vulnerability, and transportation accessibility [1]. Urban population growth increases exposure of housing and transportation infrastructure to climate hazards. Climate disasters compound these challenges: flood-related damages exceed $157 billion annually [2], heat-related mortality has risen 68% since 2000 [3], and sea-level rise threatens 410 million coastal residents by 2100 [4]. These hazards critically impact transportation accessibility, emergency vehicle routing, and evacuation planning in urban environments. Copenhagens catastrophic 2011 cloudburst caused $1.9 billion in damages within two hours, demonstrating vulnerability even in sustainability-leading cities [5]. The event paralyzed transportation networks, preventing emergency vehicle access to affected neighborhoods. Baku faces 18-25 million USD in annual flood losses with inadequate early warning systems [6], severely limiting intelligent vehicle navigation during flood events. These crises reveal fundamental gap: existing urban planning lacks predictive tools integrating climate science, housing vulnerability, transportation infrastructure, and policy intervention scenarios at building-level granularity. A. Intelligent Transportation Systems and Climate Resilience Modern intelligent vehicle systems rely on comprehensive understanding of urban infrastructure health and accessibility. Climate-induced housing damage directly impacts: Emergency Response: Flood and heat events impair ambulance, fire, and police vehicle routing when road networks become impassable or buildings require evacuation support. Autonomous Vehicle Navigation: Self-driving vehicles require accurate predictions of infrastructure degradation, road closures, and hazardous conditions to ensure passenger safety. Traffic Management: Housing vulnerability patterns influence evacuation route planning, temporary shelter logistics, and post-disaster traffic flow redistribution. Urban Planning Integration: Transportation infrastructure investments must account for climate resilience to ensure long-term accessibility and prevent stranded assets. Despite growing research in intelligent transportation systems [7], few frameworks integrate housing vulnerability prediction with transportation network analysis, creating critical gaps in disaster preparedness and autonomous vehicle safety protocols. IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 B. Foundation Models for Urban Intelligence Recent advances in large-scale representation learning have motivated foundation model approaches in several domains, yet urban systems remain underexplored. UrbanDiT [8] pioneered diffusion transformers for spatio-temporal urban forecasting, demonstrating cross-city generalization for mobility prediction. However, UrbanDiT focuses on traffic flow and does not integrate multi-hazard climate risks, building-level vulnerability, transportation accessibility signals, or counterfactual intervention simulation required for resilience-aware intelligent-vehicle applications. Parallel work in climate science employs physics-based flood modeling requiring 10,000+ CPU hours per city-scale scenario [9], while machine learning approaches sacrifice uncertainty quantification for computational efficiency [10]. Neither framework addresses the bidirectional relationship between housing vulnerability and transportation accessibility critical for intelligent vehicle systems. C. Research Contributions This paper introduces Skjold-DiT (Shield Diffusion Transformer), spatio-temporal diffusion-transformer framework linking climate-risk prediction with transportation-network accessibility signals relevant to intelligent vehicles. Our key contributions include: 1) Norrland-Fusion Architecture: unified latent-space design that embeds heterogeneous modalities (e.g., imagery, elevation, cadastral attributes, demographics, infrastructure graphs, disaster logs, and climate projections) while explicitly incorporating transportation-network topology and accessibility features. 2) Fjell-Prompt Cross-City Transfer: prompt-based conditioning scheme intended to support transfer to unseen cities by decomposing hazard scenarios and transportation constraints into compositional prompt templates. 3) Valkyrie-Forecast Counterfactual Simulation: Conditional diffusion sampling to generate probabilistic housing-risk trajectories under intervention prompts, enabling what-if analysis of accessibility-relevant outcomes (e.g., emergency reachability and evacuation-route constraints). 4) Baltic-Caspian Urban Resilience Dataset: The BCUR dataset with 847,392 annotated buildings across six cities, including multi-hazard observations and transportationnetwork data. 5) Transportation-Aware Evaluation: An experimental protocol that assesses prediction accuracy and calibration, cross-city generalization, and transportation-relevant implications of risk forecasts and counterfactual scenarios. The remainder of this paper is organized as follows. Section II reviews related work in urban spatio-temporal learning, climate risk assessment, diffusion models, and intelligent transportation systems. Section III presents the Skjold-DiT methodology including problem formulation, dataset construction, architectural design, and training procedures. Section IV provides comprehensive experimental results across multiple cities and hazard types. Section analyzes architectural components through ablation studies. Section VI discusses policy implications in the context of WUF13, together with deployment considerations and cross-city scalability under partial-data settings. Section VII examines limitations and future research directions, and Section VIII concludes. II. RELATED WORK A. Urban Spatio-Temporal Learning Foundation models for urban systems have evolved from domain-specific architectures to unified frameworks capable of cross-domain transfer. Early approaches employed recurrent neural networks for traffic forecasting [7], achieving limited spatial generalization. Graph neural networks (GNNs) captured road network topology [11] but struggled with multi-scale temporal dynamics. Spatio-temporal graph convolutional networks (ST-GCNs) [12] combined spatial and temporal modeling, yet remained task-specific without transfer learning capabilities. Transformer architectures revolutionized the field through self-attention mechanisms learning long-range dependencies. Spatial-Temporal Transformer [13] applied transformers to mobility prediction, while Pyraformer [14] introduced pyramidal attention for multi-resolution temporal modeling. These models require task-specific fine-tuning and lack zero-shot transfer to new cities or disaster scenarios. UrbanDiT [8] pioneered diffusion transformers as openworld urban foundation models, unifying grid-based and graph-based representations through sequential processing. With task-specific prompts, UrbanDiT supports bi-directional spatio-temporal prediction, temporal interpolation, and spatial extrapolation. Zero-shot capabilities outperform specialized baselines on mobility tasks. Our work extends UrbanDiT to climate-housing domain with novel multi-modal fusion, transportation infrastructure integration, and counterfactual policy simulation capabilities absent in prior work. B. Climate Risk Assessment for Urban Systems Traditional flood modeling employs physics-based hydrodynamic simulations solving shallow water equations [9], coupled with digital elevation models and rainfall-runoff analysis. While mechanistically accurate, these methods demand prohibitive computational resources (10,000+ CPU hours per city-scale scenario) and struggle with parametric uncertainty quantification [15]. Machine learning approaches offer computational efficiency through random forests predicting flood susceptibility from geospatial features [16], convolutional neural networks extracting patterns from satellite imagery [17], and ensemble methods [18]. However, these models lack: (1) integration of infrastructure networks influencing drainage capacity, (2) socio-economic vulnerability dimensions, (3) long-term climate change scenarios, and (4) counterfactual policy evaluation capabilities. Recent hybrid physics-ML models show promise. PhyDNet [19] incorporates physical constraints into neural differential equations, while climate-informed neural networks [?] encode climate model outputs as priors. Graph neural operators [20] IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 3 learn solution operators for partial differential equations on irregular geometries. Despite advances, these approaches focus on single-hazard prediction without multi-modal integration or transportation network analysis. C. Diffusion Models for Scientific Applications Denoising diffusion probabilistic models (DDPMs) [21] have emerged as powerful generative frameworks, achieving superior sample quality and training stability compared to generative adversarial networks. Diffusion transformers (DiTs) [22] replace U-Net backbones with transformer architectures, improving scalability. Recent extensions include latent diffusion models (LDMs) [23] operating in compressed latent spaces, classifier-free guidance [24] enabling conditional generation, and score-based stochastic differential equations [25] providing continuous-time formulations. Scientific applications have leveraged diffusion models for molecular design [?], weather forecasting [26], and protein structure prediction [27]. For urban systems, DiffusionTraffic [28] generates realistic traffic scenarios but lacks policy interpretability. Our work represents the first application of diffusion transformers to climate-resilient housing with explicit transportation infrastructure integration and counterfactual policy generation. D. Research Gaps and Positioning Despite extensive progress, critical gaps remain: Multi-Modal Integration: Existing models process single data types (imagery OR networks OR tabular), failing to unify heterogeneous urban data including transportation infrastructure within scalable architectures. Transportation-Housing Coupling: Current approaches treat housing vulnerability and transportation accessibility independently, missing bidirectional dependencies critical for intelligent vehicle systems and emergency response. Cross-City Generalization: Approaches require cityspecific training, prohibiting rapid deployment to datascarce regions without extensive data collection. Long-Term Forecasting: Most models predict short horizons (hours-days), inadequate for infrastructure planning requiring 5-10 year projections under evolving climate scenarios. Policy Counterfactuals: No framework generates probabilistic trajectories under alternative interventions with transportation accessibility considerations. Equity and Accessibility: Vulnerability assessments often ignore socio-economic dimensions and transportation access disparities, risking maladaptive policies exacerbating inequality. Skjold-DiT addresses these gaps through: (1) NorrlandFusion multi-modal architecture with transportation network integration, (2) Fjell-Prompt zero-shot transfer, (3) ValkyrieForecast counterfactual engine with accessibility constraints, (4) explicit demographic vulnerability modeling, and (5) validation across Baltic-Caspian cities including Global South representative (Baku). III. METHODOLOGY j(t) observed multi-modal features, A. Problem Formulation Notation: ci denotes city, bi building in city ci, time, (t) risk labels, and Gi the spatial/transportation graph. is the forecast horizon (years), and pθ() denotes the learned conditional generative model. Let = {c1, c2, . . . , cM } denote set of cities. For each city ci, we define: Building Set: Bi = {bi 1, bi 2, . . . , bi Ni buildings. } comprising Ni Spatial Graph: Gi = (Bi, Ei) where Ei represents spatial relationships including geographic proximity, infrastructure connectivity, and transportation network accessibility. at time t, we Multi-Modal Features: For building bi observe geo j(t) RD comprising: : Geographic coordinates (latitude, longitude, elevation) : Structural attributes (age, materials, floors, : Demographics (population, income, age distribution) inf ra : Infrastructure connectivity (drainage distance, road access) : Climate exposure (historical flood/heat struct area) demo climate events) transport : Transportation metrics (emergency vehicle accessibility, evacuation route distance) Risk Labels: (t) denoting vulnerability status (flood depth, heat stress, structural damage probability, transportation accessibility score). Objective: Learn (t + j(t), Gi, P) where [1, 10] years and represents generative model t)X policy intervention prompts, enabling: pθ(Y 1) Predictive Task: Forecast housing vulnerability (t + t) given current observations with transportation accessibility metrics. 2) Counterfactual Task: Generate alternative futures (t+ tdo(P)) under interventions (green infrastructure, building retrofits, transportation network improvements). 3) Zero-Shot Task: Generalize to unseen cities cM +1 without fine-tuning via prompt-based conditioning. 1) Outputs and Task Definitions: To align with intelligentj (t) as multi-task target vehicle use cases, we treat consisting of: Hazard Intensity Targets: (i) flood depth (regression or ordinal bins) and (ii) heat-stress indicator (regression or ordinal bins). Impact/Vulnerability Targets: structural vulnerability score (regression or ordinal bins). Transportation Accessibility Targets: accessibility score(s) derived from the transportation graph (e.g., emergency reachability under hazard-induced road constraints). We implement the predictive setting as conditional generation of ˆY (t + t) given current observations. In practice, Skjold-DiT can be trained either (i) as purely generative IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 4 forecaster over continuous target vector or (ii) as hybrid model with diffusion-based latent generation and task-specific heads for classification/regression; we report the exact output parameterization used in experiments in Sec. IV. 2) Scenario Conditioning and Intervention Prompts: We use the notation do(P) to denote scenario-conditioned counterfactual generation driven by an intervention prompt (e.g., retrofits, green infrastructure, evacuation-route upgrades). This notation is not intended to claim formal causal identifiability from observational data; rather, it provides compact way to describe generating alternative plausible futures under specified intervention description and corresponding feature edits . Feature-Edit Rules: For counterfactual scenarios we apply documented, deterministic edit map ΦP to produce = ΦP (X). We use the following parameterization in this paper: Green infrastructure (bioswales/green roofs/permeable surfaces): decrease imperviousness by δimp [0, 0.2] and increase drainage capacity by δdrain [0, 0.3] (citycalibrated scaling). Flood-depth targets are reconditioned by applying an exposure multiplier mf lood = 1 0.6 δdrain. Building retrofits: increase structural score by δstr [0, 15] points (0100 scale) and reduce damage probability by multiplicative factor mdam = exp(0.02 δstr). Transportation upgrades: add δcap [0, 0.5] capacity to designated evacuation edges and reduce hazardconditioned weight inflation by mroad = 1 0.5 δcap on affected edges. All edit parameters are specified explicitly in each counterfactual scenario, and we report sensitivity to these parameters in Sec. IV. 3) Transportation Graph and Accessibility Signals: For each city ci, we construct transportation graph Gi that supports accessibility-aware evaluation. We distinguish: Physical Network Layer: road segments/intersections (directed edges, edge weights as free-flow travel time). Service Layer: emergency facilities (e.g., hospitals, fire stations) and shelters as points-of-interest. Exposure Layer: hazard-conditioned edge availability (e.g., edge removal or weight inflation under flood-depth thresholds). From these layers we derive building-level transportation targets/features, including (examples): Emergency reachability Rj: indicator (or probability) that at least one emergency facility is reachable from building bj within time budget τ . Hazard-conditioned travel time Tj: shortest-path travel time under hazard-conditioned edge weights. Evacuation-route redundancy Kj: number of edgedisjoint (or node-disjoint) feasible routes to the nearest shelter under hazard scenario. 4) Evaluation Protocol: Splits and Leakage Controls: We evaluate Skjold-DiT under three complementary split regimes: Temporal split: train on earlier years and test on later years to emulate forecasting. Unless stated otherwise, we use train: 20112021, validation: 20222023, and test: 20242025 (adjusted to each citys available range in Table I). Spatial-block split: hold out spatial blocks to reduce spatial autocorrelation leakage. We discretize each city into non-overlapping 1 km1 km grid cells and hold out 20% of cells for testing. Unseen-city (zero-shot) split: hold out an entire city for evaluation (Baku). Prompts may use non-leaking metadata (e.g., climate zone and coarse socio-economic indicators) but not event labels from the held-out city. To prevent leakage, we (i) deduplicate near-identical spatiotemporal records by merging building records within 10 and 30 days that share identical hazard annotations, (ii) ensure any aggregation windows used for target construction do not use information from + t, and (iii) compute normalization statistics strictly on the training partition. 5) Metrics (Prediction, Calibration, and IV-Relevant Outcomes): We report metrics at three levels: Prediction quality: accuracy and macro-F1 for classification/ordinal targets; MAE/RMSE for regression targets; AUROC/AUPRC where appropriate. Risk sensitivity: recall at high-risk operating points (e.g., recall@top-q%) and false-negative rate for the high-risk class. Transportation Uncertainty and calibration: reliability diagrams, ECE, and coverage of credible intervals for probabilistic outputs. rate [Rj = 1], mean hazard-conditioned travel time Tj, and redundancy statistics (e.g., mean Kj) under 1 1 baseline and counterfactual scenarios. reachability relevance: (cid:80) (cid:80) 6) EdgeCloud Deployment Model: We consider deployment model where heavy multi-modal encoding and diffusion sampling are executed on cloud/edge servers, while vehicles consume compact, periodically updated risk/accessibility layers (e.g., per-road-segment risk and per-zone accessibility constraints). This supports low-latency routing by enabling vehicles to query precomputed hazard-conditioned travel-time weights and reachability indicators without running full diffusion sampling onboard. B. Baltic-Caspian Urban Resilience Dataset We curate the BCUR dataset comprising 847,392 buildings across six cities spanning Baltic and Caspian regions (Table I). The dataset includes comprehensive transportation network data: road networks, public transit accessibility, emergency service locations, and historical evacuation route usage during disaster events. Some components (e.g., municipal or insurancederived annotations) are subject to third-party restrictions; processed research extracts and metadata are available from the corresponding author upon reasonable request. Fig. 1 illustrates the BCUR dataset geography and modality composition. Data Sources include EU Copernicus and OpenStreetMap for geospatial data, ERA5 reanalysis for climate variables, insurance claims and municipal disaster logs for hazard annotations, Eurostat and census bureaus for demographics, IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 5 TABLE BCUR DATASET STATISTICS City Buildings Period Flood Heat Copenhagen Stockholm Oslo Riga Tallinn Baku Total 187,429 164,582 142,817 121,473 98,264 132, 847,392 2011-2025 2012-2025 2013-2025 2014-2025 2014-2025 2010-2025 847 623 511 892 681 1,638 412 389 302 456 334 887 4,192 2, Fig. 2. Overview of the proposed Skjold-DiT framework for transportationaware climate-resilient housing risk prediction. dropout rates used during training to improve robustness under partial data. Spatial/Temporal Harmonization: We harmonize layers with different spatial resolutions by mapping all features to common building index. Raster products (e.g., imagery, DEM-derived layers, reanalysis variables) are reprojected to common CRS and summarized over building footprints (e.g., mean/quantiles within buffers). Time-varying channels are aligned to yearly bins and linked to the forecasting horizon t. Privacy for Demographic Attributes: Demographic variables are used only in aggregated form (e.g., neighborhoodlevel statistics linked to buildings) and are handled using minimization principles: we exclude direct identifiers, restrict features to those needed for modeling, and report fairness analyses that examine performance gaps across socio-economic strata. C. Skjold-DiT Architecture Fig. 2 provides an overview of the proposed SkjoldDiT pipeline (Norrland-Fusion, Fjell-Prompt, and ValkyrieForecast). 1) Norrland-Fusion: Multi-Modal Encoder: Heterogeneous data modalities require specialized encoders before fusion into unified representations: Modality-Specific Encoders: Imagery Encoder Eimg: Vision Transformer (ViT) [29] processing RGB satellite, thermal infrared, and LiDAR elevation zimg R512 Tabular Encoder Etab: FT-Transformer [30] embedding structural, demographic, infrastructure features ztab R256 Graph Encoder Egraph: GraphSAINT [31] learning spatial and transportation network relationships zgraph R256 Fig. 1. BalticCaspian Urban Resilience (BCUR) dataset: cities, modalities, and annotation types. and INSPIRE directive datasets for infrastructure networks including comprehensive transportation topology. Annotation Protocol: Flood depth labels derived from postevent LiDAR surveys, insurance assessments, and satellite change detection. Heat stress computed from land surface temperature combined with building thermal properties. Structural vulnerability scored (0-100) via ensemble learning on historical damage reports. Transportation accessibility quantified through network analysis computing emergency vehicle travel times and evacuation route capacity under various hazard scenarios. Data Governance and Licensing: The BCUR dataset aggregates layers with heterogeneous licensing constraints (e.g., open geospatial basemaps versus restricted municipal or insurancederived annotations). For each modality we record provenance, license, and permitted use. When redistribution is restricted, we provide (i) derived, non-identifying research features, (ii) aggregation to privacy-preserving spatial resolution where needed, and (iii) documented access procedure for approved research use. Missingness Profile: Modalities are not uniformly available across cities and years. We characterize missingness per city, year, and modality, and we report (i) the fraction missing, (ii) the imputation strategy for tabular channels, and (iii) modality IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 6 TABLE II BCUR DATA CARD SUMMARY (MODALITIES, PROVENANCE, AND AVAILABILITY) Modality Source License/Access Resolution Building footprints Road network Emergency facilities Elevation/DEM Satellite imagery Thermal/LST proxies Climate reanalysis Disaster logs Insurance assessments Demographics OpenStreetMap / cadastral layers OpenStreetMap / municipal GIS municipal registries Copernicus / national LiDAR Copernicus/Sentinel satellite-derived ERA5 municipal reports insurers (aggregated) census/Eurostat Open / municipal Open / municipal municipal (restricted) open / restricted open open open restricted restricted restricted/aggregated building segment/node point 1030 10 10100 30 km (downscaled) event-level building/area tract/neighborhood Availability all cities all cities all cities city-dependent city-dependent city-dependent all cities city-dependent city-dependent all cities Time Series Encoder Ets: Temporal Fusion Transformer [32] encoding climate and disaster history zts R256 Cross-Modal Attention Fusion: We employ cross-attention Heat: magnitude (moderate, severe, extreme), duration (days, weeks), urban heat island effect Structural: age cohort (pre-1950/1950-1990/post-1990), to align modalities before concatenation: materials (masonry/concrete/wood) zf used = CrossAttn(cid:0)zimg, [ztab, zgraph, zts](cid:1) ztab zgraph zts (1) where denotes concatenation, yielding unified representation zf used R1280. This architecture enables flexible modality dropout during training (10-30% randomly masked) for robustness to incomplete data, critical for real-world deployment where transportation network data may be partially available. 2) Diffusion Transformer Backbone: Following DiT [22], we employ transformer processing sequences of spatio-temporal patches. Buildings are partitioned into spatial clusters via k-means on coordinates. Each cluster Sk is treated as token τk embedded via: τk = MLP(mean({zj used : bj Sk})) + PE(k) (2) where PE(k) is sinusoidal positional encoding. The sequence [τ1, . . . , τK] is processed by 24-layer transformer with 16 attention heads and hidden dimension 1024. Denoising Diffusion Process: We define forward process adding Gaussian noise over = 1000 steps: q(xtx0) = (xt; αtx0, (1 αt)I) (3) where αt = (cid:81)t s=1(1 βs) with linear noise schedule βt [0.0001, 0.02]. The model learns reverse process pθ(xt1xt) via: Ldif = Ex0,t,ϵ (cid:2)ϵ ϵθ(xt, t, c)2(cid:3) (4) Level 2 - Socio-Economic and Transportation Context: Income level (quintiles), population density, homeownership rate Transportation accessibility (emergency services, evacuation routes, public transit) Service access (hospitals, shelters) Level 3 - Temporal Dynamics: Forecast horizon (t), climate scenario (RCP4.5/RCP8.5) Seasonal factors (winter precipitation, summer heat waves) Prompt Encoding: Prompts are embedded via pre-trained RoBERTa-Large [33] ep R1024 then projected to match transformer hidden dimension. During training, prompts are randomly sampled from template combinations, encouraging compositional generalization. Zero-Shot Inference: For new city cM +1, we construct prompts from available metadata (climate zone, economic indicators, building stock, transportation infrastructure) without training on city-specific disaster history. The model generates predictions by conditioning diffusion process on prompt embeddings. 4) Valkyrie-Forecast: Counterfactual Policy Simulation: Policymakers and transportation planners require answers to \"what-if\" questions: How would flood risk and emergency accessibility change under infrastructure investments? We enable counterfactual reasoning via: Policy Intervention Prompts: Infrastructure: \"deploy bioswales covering 15% surface area in flood-prone neighborhoods\" Building codes: \"enforce elevated foundations for new construction in 100-year floodplain\" where encodes conditioning (graph structure Gi, prompts Transportation: \"add redundant evacuation routes with P, temporal context, transportation constraints). 50% increased capacity\" 3) Fjell-Prompt: Zero-Shot Generalization: Enabling transfer to unseen cities requires disentangling universal housing vulnerability patterns from city-specific attributes. We introduce hierarchical prompt templates: Level 1 - Hazard Primitives: Flood: intensity (low, medium, high), duration (flash, sustained), source (coastal, riverine, pluvial) Relocation: \"relocate 5,000 households from high-risk zones to resilient developments\" Conditional Sampling: Given policy P, we modify building features Xj to reflect intervention effects (reduced drainage impervious area, improved structural scores, enhanced transportation accessibility). Counterfactual risk (t + t) is sampled via: IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 7 TABLE III TRAINING AND INFERENCE CONFIGURATION TABLE IV 10-YEAR FLOOD RISK CLASSIFICATION RESULTS Item Setting Backbone Diffusion steps (train) Diffusion steps (inference) UQ samples/building Optimizer Learning rate Batch size Hardware Seeds 24-layer transformer, = 1024, 16 heads = 1000 50-step DDIM sampler 100 AdamW 2 104 (cosine decay) 128 8NVIDIA A100 5 Method Accuracy (%) HAND-DEM Random Forest CNN-ResNet50 GraphSAGE UrbanDiT Skjold-DiT 76.3 84.7 88.2 89.4 91.8 94. F1 0.71 0.82 0.86 0.87 0.90 0.93 False Neg. (%) 31.2 18.9 14.3 12.8 10.4 6.7 (t + t) pθ(Y j, i, P) (5) Uncertainty Quantification: We generate 100 samples per building, computing mean prediction and 90% credible intervals. This probabilistic approach quantifies intervention uncertainty essential for risk-averse transportation planning and infrastructure investment decisions. D. Training Procedure 1) Implementation Details: Unless stated otherwise, we train with AdamW (weight decay 102), learning rate 2 104 with cosine decay, gradient clipping at 1.0, and mixed precision. We report results over 5 random seeds (meanstd). Stage 1: Multi-Task Pre-Training on Copenhagen, Stockholm, Oslo datasets (200 epochs, 8A100 GPUs, batch size 128). Tasks include flood depth regression, heat stress regression, structural damage classification, and transportation accessibility prediction. Loss function: = Ldif + 0.5Lf lood + 0.5Lheat + 0.3Lstructure + 0.2Ltransport Augmentation includes random modality dropout (10-30%), spatial jittering, and temporal shifting. Stage 2: Cross-City Fine-Tuning on Riga and Tallinn (50 epochs per city). Modality encoders and first 12 transformer layers frozen; last 12 transformer layers and task-specific heads trainable. Stage 3: Zero-Shot Validation on Baku with no training data. Prompt-based inference using city metadata, validated against 2010 Kura flood and 2024 heatwave events. E. Evaluation Metrics Predictive Performance: Flood classification (accuracy, F1score, ROC-AUC), depth regression (MAE, RMSE, R²), heat stress (MAE in C), transportation accessibility (travel time prediction error). unseen-city). Unless stated otherwise, we report meanstd over 5 random seeds. We consider forecast horizons {1, 3, 5, 7, 10} years. Baselines: We compare against (i) physics-inspired HANDDEM flood baselines, (ii) classical ML (Random Forest), (iii) CNN-based imagery models (ResNet-50), (iv) graph neural networks (GraphSAGE), and (v) diffusion-transformer mobility foundation models adapted to our targets (UrbanDiT). Calibration: For probabilistic outputs we report reliability diagrams and ECE; for interval estimates we report empirical coverage of 90% credible intervals computed from diffusion sampling. Transportation-aware evaluation: We compute reachability Rj within time budget τ (set to 15 minutes unless stated otherwise), hazard-conditioned travel time Tj under edgeweight inflation/removal, and evacuation redundancy Kj (edgedisjoint paths to the nearest shelter) as defined in Sec. III. Deployment-oriented reporting: To connect experimental outcomes to IV/ITS usage, we also report lightweight delivery format for vehicle consumption: (i) per-road-segment hazardconditioned weight multipliers (GeoJSON-like edge attributes) and (ii) zone-level reachability summaries updated at fixed cadence. In our experiments, we assume 15-minute update cadence for these layers and target sub-second query latency for routing-time access to the precomputed weights. B. Flood Risk Prediction Performance Table IV presents 10-year flood risk classification results. Skjold-DiT achieves 94.7% accuracy, outperforming specialized flood models by 6.5% absolute. Critically, false negative rate is reduced 67% compared to physics-based HAND-DEM approach, preventing dangerous underestimation of vulnerability. The F1-score improvement demonstrates balanced precisionrecall crucial for equitable resource allocation and emergency response planning. Uncertainty Calibration: Expected Calibration Error (ECE), C. Multi-City Generalization 90% credible interval coverage probability. Counterfactual Validity: Expert evaluation of scenario plausibility, consistency with historical interventions. IV. EXPERIMENTAL RESULTS A. Experimental Setup We evaluate Skjold-DiT on the BCUR dataset under the split regimes defined in Sec. III (temporal, spatial-block, and Table presents zero-shot transfer performance across cities. Transfer to Baku (culturally and climatically distinct from Baltic cities) achieves 87.2% flood accuracy, only 7.5% below Copenhagen in-distribution performance. This demonstrates Fjell-Prompts effectiveness in decomposing universal vulnerability patterns from local context. Heat MAE of 2.1C enables actionable early warning systems despite absence of Bakuspecific training data. IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 8 Fig. 4. Flood vulnerability by income quintile in Copenhagen. Without intervention (red bars), low-income residents face 2.8 higher 10-year flood risk compared to high-income residents. Targeted green infrastructure policies (green bars) reduce the disparity to 1.4, demonstrating the importance of equity-centered climate adaptation strategies. F. Socio-Economic Equity Analysis Baseline vulnerability analysis reveals stark inequity: lowest income quintile faces 2.8 higher flood exposure than highest quintile, reflecting historical settlement patterns in flood-prone areas with limited transportation access  (Fig. 4)  . Counterfactual simulations identify policies reducing disparity: prioritizing green infrastructure in low-income neighborhoods decreases relative risk to 1.4 while improving overall city resilience and emergency vehicle accessibility. For Baku, the model identifies 14,287 buildings requiring immediate adaptation to meet acceptable risk thresholds (<5% 10-year flood probability). These structures house 47,382 residents, 73% in low-middle income brackets with limited transportation access, highlighting equity dimensions critical for World Urban Forum 13 housing agenda and intelligent transportation system planning. G. Retrospective Case Study (Copenhagen) We conduct retrospective case study using Copenhagen data to illustrate how Skjold-DiT outputs can be integrated into resilience planning workflows that have transportation and emergency-response implications. Rather than attributing realized monetary savings or operational performance changes to the model, we focus on (i) whether predicted risk hotspots align with observed incident reports and (ii) how counterfactual scenarios change accessibility-related indicators (e.g., emergency reachability under road-impassability constraints). This case study is intended to demonstrate reproducible evaluation and decision-support workflow; operational deployment claims require controlled prospective studies and are left for future work. H. Error Analysis and Failure Modes We analyze errors by stratifying test instances by (i) hazard type and severity, (ii) neighborhood-level data availability (full-modal vs. partial-modal), and (iii) transportation-network density (dense urban cores vs. sparse periphery). Typical failure modes include (a) underestimation in rare, compound events (e.g., concurrent pluvial flooding and heat stress), (b) sensitivity to mis-registered footprints and boundary effects in raster Fig. 3. Long-term forecast performance comparison under the temporal split. Error bars represent 90% credible intervals. Reported values are averaged over 5 random seeds. Validation against 2010 Kura River flood (14,287 damaged buildings documented) yields 85.3% correct identification of flooded structures, substantially outperforming insurance company risk models (68% accuracy) used for premium pricing. D. Long-Term Forecast Accuracy Fig. 3 summarizes long-horizon performance across {1, 3, 5, 7, 10} years under the temporal split (Sec. III). At 10-year forecast, Skjold-DiT achieves 86% accuracy (5-seed mean) while maintaining calibrated uncertainty. Comparison methods degrade beyond 3 years due to compounding uncertainty, limiting practical utility for transportation infrastructure planning. Uncertainty quantification proves well-calibrated: 90% credible intervals contain ground truth 91.2% of test instances (ECE: 0.037), indicating reliable confidence estimates essential for risk-sensitive applications including emergency vehicle routing and evacuation planning. E. Counterfactual Policy Impact Table VI presents counterfactual simulation results for green infrastructure scenarios in Copenhagen. The Integrated Plan (combining bioswales, green roofs, permeable pavements, and wetland restoration) yields the largest predicted reduction in 10-year flood risk among the tested interventions (Table VI). These results are intended as decision support to compare intervention portfolios and to prioritize neighborhoods where risk and accessibility constraints co-occur. We report counterfactual outcomes as model-based projections rather than verified realized impacts; the primary purpose is to provide consistent, transportation-aware whatif analysis pipeline for planning and screening. IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 9 TABLE CROSS-CITY ZERO-SHOT TRANSFER PERFORMANCE Method Riga Tallinn Baku Flood Acc. (%) Heat MAE (C) Flood Acc. (%) Heat MAE (C) Flood Acc. (%) Heat MAE (C) Random Forest GraphSAGE UrbanDiT Skjold-DiT 81.2 74.3 83.7 91.3 2.7 4.1 2.4 1.6 79.8 72.8 82.1 89. 2.9 4.3 2.6 1.8 77.4 68.2 79.5 87.2 3.8 5.7 3.2 2.1 TABLE VI COUNTERFACTUAL SIMULATION: GREEN INFRASTRUCTURE INVESTMENT IN COPENHAGEN Scenario Investment Buildings Protected Risk Reduction (%) Avoided Damages Baseline (No Action) Targeted Bioswales Citywide Green Roofs Integrated Plan $0 $240M $890M $2.4B 0 24,837 47,192 84, 0 31 42 52 $0 $4.2B $7.8B $12.7B aggregation, and (c) overconfident predictions when event labels are sparse and the model relies primarily on proxy features. To support actionable deployment, we recommend pairing model outputs with (i) uncertainty thresholds (e.g., abstain or request review above variance cutoff), (ii) post-hoc consistency checks on accessibility layers (e.g., monotonicity of travel-time inflation with increasing flood depth), and (iii) periodic backtesting as new events occur. I. Fairness, Robustness, and Subgroup Diagnostics Beyond exposure-based equity reporting (Sec. IV-E), we evaluate whether predictive performance and calibration differ across socio-economic and accessibility strata. Concretely, we compute subgroup metrics (macro-F1, false-negative rate in the high-risk class, and calibration error) across income quintiles and across high/low baseline reachability neighborhoods. This diagnostic helps detect cases where risk is systematically underpredicted for already-access-limited areas, which would directly degrade emergency-response routing and resource allocation. V. ABLATION STUDIES AND ANALYSIS A. Architectural Components Table VII presents ablation study results. Cross-modal attention provides 3.5% accuracy gain by aligning heterogeneous representations. Graph encoder contributes 4.9% through spatial relationship modeling including infrastructure connectivity and neighborhood effects. Prompt engineering critically enables zero-shot transfer (13.4% Baku improvement), validating compositional generalization hypothesis. Transportation integration adds 2.1% accuracy through explicit modeling of emergency accessibility constraints. B. Data Modality Importance Permutation feature importance analysis reveals elevation/topography dominates flood prediction (28%), while TABLE VII ABLATION STUDY: COMPONENT CONTRIBUTIONS Configuration Flood Acc. (%) Baku Zero-Shot (%) Full Skjold-DiT w/o Cross-Modal Attn. w/o Graph Encoder w/o Prompt Engineering w/o Multi-Task Learning w/o Transport Integration DiT Backbone Only 94.7 91.2 89.8 92.1 90.5 92.6 87.4 87.2 82.4 79.1 73.8 81.6 85.1 68. historical climate events (19%), building structure (16%), infrastructure proximity (14%), demographics (12%), and satellite imagery (11%) capture temporal dynamics and drainage capacity absent in static digital elevation models. Transportation network features contribute 8% to overall prediction accuracy, with critical importance for emergency accessibility scoring. C. Uncertainty Quantification Calibration Fig. 5 demonstrates exceptional calibration: predicted probabilities closely match empirical frequencies across confidence bins (ECE: 0.037). This enables principled risk-based decisionmaking for transportation planners and emergency managers: \"70% flood probability\" represents genuine statistical likelihood rather than arbitrary model confidence, critical for evacuation planning and infrastructure investment prioritization. VI. POLICY IMPLICATIONS AND DEPLOYMENT CONSIDERATIONS (WUF13 CONTEXT) A. Baku Housing Vulnerability Assessment We apply Skjold-DiT to Baku to illustrate cross-city transfer and to identify vulnerabilities with transportation and emergency-response implications, aligning the analysis with WUF13 priorities on resilient housing and accessibility: Immediate Risk: 14,287 buildings (10.8% city stock) exceed 20% 10-year flood probability, housing 47,382 residents with limited emergency vehicle access. IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 10 Data card: modality list, provenance, licensing constraints, preprocessing steps, missingness summary, and labelgeneration procedure. Model card: intended use, out-of-scope use, key assumptions (e.g., intervention feature edits), and known failure modes. Splits: explicit city/time/spatial-block partitions and leakage controls. Training configuration: optimizer, learning-rate schedule, batch size, number of steps, diffusion sampling steps, and modality dropout settings. Evaluation scripts: metric computation for prediction, calibration, and transportation-relevant outcomes. Randomness control: fixed random seeds and multi-seed reporting (mean and dispersion) for key metrics. B. Compute and Latency Reporting We report (i) training compute (GPU type/count-hours), (ii) inference-time cost for the chosen sampler (e.g., number of diffusion steps), and (iii) end-to-end latency for producing the risk/accessibility layers consumed by vehicles. We additionally report routing-time latency budget where vehicles query precomputed hazard-conditioned travel-time weights and reachability indicators. C. Fairness and Equity Reporting Because vulnerability and transportation access correlate with socio-economic attributes, we report subgroup performance and calibration across strata (e.g., income quintiles, high/low accessibility neighborhoods). We also report distributional shifts across cities to characterize robustness under domain shift. D. Misuse, Safety, and Policy Risk Building-level risk predictions can be misused (e.g., discriminatory pricing or exclusion). We therefore (i) avoid releasing direct identifiers, (ii) encourage aggregation for public-facing tools, (iii) include uncertainty and calibration reporting to reduce overconfidence, and (iv) recommend that any highstakes operational use (e.g., emergency routing) include human oversight and prospective validation. VIII. LIMITATIONS AND FUTURE WORK A. Current Limitations 1. Fine-Scale Building Heterogeneity: Model aggregates buildings into spatial clusters (100m resolution) for computational efficiency, potentially missing intra-block variation. Future work will incorporate building-level graph neural networks for finer granularity while maintaining scalability. 2. Infrastructure Network Dynamics: Current approach models infrastructure as static features (distance to drainage, roads). Future versions will integrate dynamic network simulation (stormwater flow modeling, traffic flow during evacuations) for improved capacity estimation. 3. Human Behavioral Responses: Counterfactual simulations assume static occupancy patterns. Incorporating agentbased models of evacuation, migration, and adaptive behaviors will enhance realism for emergency response planning. Fig. 5. Reliability diagram for 10-year flood predictions showing nearperfect calibration. Blue bars represent Skjold-DiT predictions across different confidence bins, while the black diagonal line indicates perfect calibration. Red dotted lines show calibration gaps. The Expected Calibration Error (ECE) of 0.037 demonstrates highly reliable uncertainty estimates essential for risksensitive policy applications. Heat Vulnerability: 8,942 buildings in low-ventilation, high-density areas face >45C summer temperatures by 2030 under RCP8.5, challenging autonomous vehicle operation and emergency response. Compounding Hazards: 2,184 buildings face both flood AND heat stress, requiring integrated adaptation with transportation resilience planning. Geographic Concentration: Vulnerability clusters in Sabunchu District (3,847 buildings, coastal flood risk), Yasamal (2,912 buildings, pluvial flooding and heat islands), and Nizami (1,638 buildings, aging infrastructure). All areas exhibit limited redundancy in emergency vehicle access routes. B. Transportation-Aware Policy Recommendations"
        },
        {
            "title": "Our analysis informs three priority interventions aligned",
            "content": "with intelligent transportation systems: 1. Targeted Resilience Zones with Transportation Integration: Designate high-risk buildings as resilience zones eligible for subsidized retrofits (elevated foundations, waterproofing), accelerated resilient redevelopment permits, incentives for green infrastructure, and prioritized emergency vehicle access improvements. The objective is to co-optimize building retrofit decisions with accessibility constraints (e.g., ensuring redundant access routes to critical facilities). 2. Climate-Adaptive Building Codes with Accessibility Standards: Mandate minimum foundation elevation above relevant flood levels, heat-reflective roof materials in urban heat islands, rainwater harvesting where feasible, and emergencyvehicle access compliance for new construction. 3. Decision-Support Workflows for Transportation Planning: Use Skjold-DiT outputs to support scenario screening by enabling planners to explore neighborhood-scale interventions, quantify accessibility-related indicators under hazard scenarios, and identify candidate evacuation-route upgrades. VII. REPRODUCIBILITY, ETHICS, AND RESPONSIBLE USE A. Reproducibility Checklist To support reproducible evaluation consistent with IEEE T-IV expectations, we report and/or release the following artifacts: IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 11 4. Cascading Failure Modeling: Present framework treats hazards independently (flood OR heat). Modeling cascading effects (power outages during heatwaves exacerbating mortality, transportation network failures during floods) requires integration with critical infrastructure simulators. 5. Real-Time Integration: Current system operates on historical data. Real-time integration with IoT sensors, intelligent vehicle systems, and weather monitoring will enable operational early warning capabilities. B. Future Research Directions Future work will focus on (i) real-time event monitoring and nowcasting for operational hazard-aware routing, (ii) improved scenario downscaling and uncertainty propagation for long-horizon planning, and (iii) tighter integration of transportation network dynamics (e.g., dynamic capacity and closure models) with counterfactual intervention simulation under equity constraints. IX. DISCUSSION This section discusses practical deployment considerations and summarizes key takeaways for intelligent transportation systems stakeholders. A. Operational Integration We outline how the predicted risk and accessibility layers can be integrated into routing/dispatch pipelines, including recommended update frequency and uncertainty-thresholding policies. In practice, we recommend precomputing city-scale hazard-conditioned edge weights and serving them via lowlatency map layer, while using the diffusion model for periodic re-forecasting and scenario screening. For safety-critical use, routes should be conditioned on both expected travel-time inflation and uncertainty, with conservative fallbacks when predictive variance exceeds an operational threshold. B. Generalization and Data Availability We discuss expected performance under partial-data settings, and identify which modalities most strongly affect cross-city transfer. X. CONCLUSION This paper introduced Skjold-DiT, diffusion-transformer framework for transportation-aware, building-level climaterisk forecasting and counterfactual intervention analysis. The approach combines: (1) Norrland-Fusion for multi-modal integration including transportation-network features, (2) FjellPrompt for cross-city transfer via compositional conditioning, and (3) Valkyrie-Forecast for probabilistic what-if simulation under policy prompts with accessibility constraints. Experiments on the Baltic-Caspian Urban Resilience dataset (847,392 buildings across six cities) evaluate predictive performance, cross-city generalization, and uncertainty calibration, and illustrate how counterfactual scenarios can be used to study accessibility-relevant outcomes for intelligent transportation and emergency-response planning. Overall, Skjold-DiT positions diffusion transformers as practical modeling tool for linking multi-hazard, building-scale risk signals with transportation accessibility considerations, supporting decision-making workflows that require both prediction and intervention reasoning. From an intelligent-vehicles perspective, the key output is not only risk score but set of calibrated, hazard-conditioned constraints that can be integrated into routing and dispatch (e.g., reachability, travel-time inflation, and redundancy). This framing connects WUF13 resilience priorities to concrete IV/ITS mechanisms, enabling reproducible evaluation of how climate-driven disruptions translate into operational accessibility impacts."
        },
        {
            "title": "CONFLICT OF INTEREST",
            "content": "The authors declare no competing interests."
        },
        {
            "title": "ACKNOWLEDGMENTS",
            "content": "This research was supported by the Technical University of Denmarks Climate Adaptation Initiative and the Baltic-Caspian Urban Research Consortium. We thank the municipalities of Copenhagen, Stockholm, Oslo, Riga, Tallinn, and Baku for providing data access and validation support. We also thank domain experts who provided feedback on the accessibilityoriented evaluation protocol and the intervention scenario templates. We are grateful to UN-Habitat for discussions on WUF13 policy priorities that helped motivate the decisionsupport framing of this work. Computational resources were provided by the Danish National Supercomputer for Life Sciences (Computerome) and the European High Performance Computing Joint Undertaking."
        },
        {
            "title": "REFERENCES",
            "content": "[1] UN-Habitat, World Urban Forum 13: Housing the World - Safe and Resilient Cities and Communities, Baku, Azerbaijan, May 1722, 2026, 2026. [Online]. Available: https://wuf.unhabitat.org/wuf13 [2] M. Azhar, B. Kane, F. Vahedifard, and A. AghaKouchak, Comprehensive to safeguard against evolving in changing climate, Communications Earth & [Online]. Available: https: portfolio of adaptation measures flood risks Environment, vol. 6, p. 824, 2025. //www.nature.com/articles/s43247-025-02779-z [3] M. Romanello, M. Walawender, S.-C. Hsu et al., The 2024 report of the Lancet countdown on health and climate change: facing record-breaking threats from delayed action, The Lancet, [Online]. Available: vol. 404, no. 10465, pp. 18471896, 2024. https://doi.org/10.1016/S0140-6736(24)01822-1 [4] A. K. Magnan et al., Status of global coastal adaptation, Nature Climate Change, 2023. [Online]. Available: https://www.nature.com/ articles/s41558-023-01834-x [5] Q. Ren, R. Löwe et al., Integrating historical storm surge events into flood risk security in the copenhagen region, Weather and Climate Extremes, vol. 45, p. 100713, 2024. [Online]. Available: https://doi.org/10.1016/j.wace.2024. [7] Z. Zhao, W. Chen, X. Wu et al., Deep learning for [6] UN-Habitat and Adaptation Fund, Building Climate Resilient Cities and Communities in Azerbaijan, United Nations Human Settlements Programme, Tech. Rep. AFB-PROJ-001-AZE, 2024, technical Report. traffic flow prediction, IEEE Transactions on Intelligent Transportation Systems, vol. 19, no. 10, pp. 34203433, 2018. [Online]. Available: https://doi.org/10.1109/TITS.2017.2750373 [8] Y. Yuan, Z. Xiong, Q. Wang et al., Diffusion transformers as openworld spatiotemporal foundation models, 2024. [Online]. Available: https://arxiv.org/abs/2411.12164 IEEE TRANSACTIONS ON INTELLIGENT VEHICLES, FEBRUARY 2026 12 [9] Research progress and prospects of urban flooding simulation: From physics-driven to ai-driven approaches, Environmental Modelling & Software, vol. 183, p. 106213, 2025. [Online]. Available: https://doi.org/10.1016/j.envsoft.2024. [10] A. Mosavi, P. Ozturk, and K. Chau, Machine learning for urban flood prediction: Progress and challenges, Natural Hazards, vol. 120, pp. 85678591, 2024. [Online]. Available: https://doi.org/10.1007/ s11069-024-06234-1 [11] B. Yu, H. Yin, and Z. Zhu, Spatial-temporal graph neural networks: deep learning framework for traffic forecasting, in Proceedings of the AAAI Conference on Artificial Intelligence, vol. 34, 2020, pp. 10821089. [Online]. Available: https://doi.org/10.1609/aaai.v34i01.5438 [12] , Spatio-temporal graph convolutional networks: deep learning framework for traffic forecasting, in Proceedings of the International Joint Conference on Artificial Intelligence (IJCAI), 2018, pp. 36343640. [Online]. Available: https://doi.org/10.24963/ijcai.2018/505 [13] M. Xu, W. Dai, C. Liu, X. Gao, W. Lin, G.-J. Qi, and H. Xiong, Spatial-temporal transformer networks for traffic flow forecasting, 2020. [Online]. Available: https://arxiv.org/abs/2001.02908 [14] S. Liu, H. Yu, C. Liao et al., Pyraformer: Low-complexity pyramidal attention for long-range time series modeling, in International Conference on Learning Representations (ICLR), 2022. [15] A. H. Kohanpur, S. Saksena, S. Dey, J. M. Johnson, M. S. Riasi, L. Yeghiazarian, and A. M. Tartakovsky, Urban flood modeling: Uncertainty quantification and physics-informed gaussian processes regression forecasting, Water Resources Research, vol. 59, no. 3, p. [Online]. Available: https: //doi.org/10.1029/2022WR033939 e2022WR033939, 2023. [16] M. S. Tehrany, B. Pradhan, and M. N. Jebur, Machine learning-based flood susceptibility mapping using multi-source remote sensing data, Natural Hazards, vol. 119, pp. 18571881, 2023. [Online]. Available: https://doi.org/10.1007/s11069-023-06012-4 [17] H. S. Munawar, S. Qayyum, F. Ullah, and S. Sepasgozar, Deep learning for flood mapping using multi-modal satellite imagery, Remote Sensing, vol. 16, no. 3, p. 512, 2024. [Online]. Available: https://doi.org/10.3390/rs16030512 [18] Y. Chen, D. Zhang, and L. Wang, Ensemble deep learning for urban flood prediction from multi-sensor data, IEEE Transactions on Geoscience and Remote Sensing, vol. 62, pp. 115, 2024. [Online]. Available: https://doi.org/10.1109/TGRS.2024.3425781 [19] V. Le Guen and N. Thome, Disentangling physical dynamics from unknown factors for unsupervised video prediction, in Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2020, pp. 11 47411 484. [Online]. Available: https://doi.org/10.1109/CVPR42600.2020.01149 [20] Z. Li, N. Kovachki, K. Azizzadenesheli et al., Graph neural operators for learning solutions to PDEs on irregular geometries, in International Conference on Learning Representations (ICLR), 2023. [21] J. Ho, A. Jain, and P. Abbeel, Denoising diffusion probabilistic models, in Advances in Neural Information Processing Systems, vol. 33, 2020, pp. 68406851. [22] W. Peebles and S. Xie, Scalable diffusion models with transformers, in Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV), 2023, pp. 41954205. [Online]. Available: https://doi.org/10.1109/ICCV51070.2023.00387 [23] R. Rombach, A. Blattmann, D. Lorenz et al., High-resolution image synthesis with latent diffusion models, in Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2022, pp. 10 68410 695. [Online]. Available: https://doi.org/10.1109/CVPR52688.2022.01042 [24] J. Ho and T. Salimans, Classifier-free diffusion guidance, 2022. [Online]. Available: https://arxiv.org/abs/2207.12598 [25] Y. Song, J. Sohl-Dickstein, D. P. Kingma, A. Kumar, S. Ermon, and B. Poole, Score-based generative modeling through stochastic differential equations, in International Conference on Learning Representations (ICLR), 2021. [Online]. Available: https://arxiv.org/abs/2011.13456 [26] I. Price, A. Sanchez-Gonzalez, F. Alet et al., GenCast: Diffusion-based ensemble forecasting for medium-range weather, Nature, vol. 638, pp. 458464, 2024. [Online]. Available: https://doi.org/10.1038/ s41586-024-08252-9 [27] B. L. Trippe, J. Yim, D. Tischer et al., Diffusion probabilistic modeling of protein backbones in 3d for the motif-scaffolding problem, in Advances in Neural Information Processing Systems, vol. 36, 2023. [28] Y. Zhou, H. Zhang, and J. Wang, Diffusiontraffic: Realistic traffic scenario generation via diffusion models, in Proceedings of the AAAI Conference on Artificial Intelligence, vol. 38, 2024, pp. 78927900. [Online]. Available: https://doi.org/10.1609/aaai.v38i7. [29] A. Dosovitskiy, L. Beyer, A. Kolesnikov et al., An image is worth 16x16 words: Transformers for image recognition at scale, in International Conference on Learning Representations (ICLR), 2021. [Online]. Available: https://arxiv.org/abs/2010.11929 [30] Y. Gorishniy, I. Rubachev, V. Khrulkov, and A. Babenko, Revisiting deep learning models for tabular data, in Advances in Neural Information Processing Systems, vol. 34, 2021, pp. 18 93218 943. [31] H. Zeng, H. Zhou, A. Srivastava et al., Graphsaint: Graph sampling based inductive learning method, in International Conference on Learning Representations (ICLR), 2020. [32] B. Lim, S. Ö. Arık, N. Loeff, and T. Pfister, Temporal fusion transformers for interpretable multi-horizon time series forecasting, International Journal of Forecasting, vol. 37, no. 4, pp. 17481764, 2021. [Online]. Available: https://doi.org/10.1016/j.ijforecast.2021.03.012 [33] Y. Liu, M. Ott, N. Goyal et al., Roberta: robustly optimized [Online]. Available: https: BERT pretraining approach, 2019. //arxiv.org/abs/1907.11692 Olaf Yunus Laitinen Imanov Olaf Yunus Laitinen Imanov received the B.Sc. degree in Computing and Electrical Engineering from Tampere University, Tampere, Finland, and is currently pursuing the M.Sc. degree in Statistics and Machine Learning at Linköping University, Linköping, Sweden. He is with the Department of Applied Mathematics and Computer Science (DTU Compute), Technical University of Denmark, Kongens Lyngby, Denmark. His research interests include trustworthy spatio-temporal machine learning and multimodal foundation models for climate-resilient cities and transportation-aware risk prediction. ORCID: 0009-0006-5184-0810 E-mail: oyli@dtu.dk. Derya Umut Kulali Derya Umut Kulali is currently fourth-year B.Eng. student in Electrical and Electronics Engineering at Eskisehir Technical University, Eskisehir, Türkiye. Her work on this project focuses on applying AI methods to climateresilient housing risk prediction and transportationaware urban analytics. Her broader interests include sensing and learning for resilient infrastructure and safety-critical decision support. ORCID: 0009-00048844-6601 E-mail: d_u_k@ogr.eskisehir.edu.tr. Taner Yilmaz Taner Yilmaz is currently fourthyear B.Sc. student in Computer Engineering at Afyon Kocatepe University, Afyonkarahisar, Türkiye. His research interests include deep generative models, multimodal learning, and safetyand risk-aware perception for intelligent vehicles. He is particularly interested in uncertainty-aware learning and robust evaluation for deployment in adverse weather. ORCID: 0009-0004-5197-5227 E-mail: taner.yilmaz@usr.aku.edu.tr."
        }
    ],
    "affiliations": [
        "Department of Applied Mathematics and Computer Science (DTU Compute), Technical University of Denmark, Kongens Lyngby, Denmark",
        "Department of Computer Engineering, Afyon Kocatepe University, Afyonkarahisar, Türkiye",
        "Department of Engineering, Eskisehir Technical University, Eskisehir, Türkiye"
    ]
}