[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2410.21333/extracted/5987228/figures/main_fig.png",
                "caption": "Figure 1:Tasks evaluated for reductions in performance from CoT prompting. Implicit Statistal Learning (ISL): Classification of strings generated by an artificial grammar. Face Recognition (FR): Recognition of a face from a set that shares similar descriptions. Classification of Data with Exceptions (CDE): Learning labels in the presence of exceptions. Natural Language Inference (NLI): Recognizing a logical inconsistency. Spatial intuitions (SI): Tilting water glasses. Working Memory (WM): Aggregating features for a decision. Humans show reductions in performance when engaging in verbal thinking in all tasks, we show that the first three have similar effects on LLMs and VLMs, while the last three differ between humans and models in meaningful ways.",
                "position": 154
            }
        ]
    },
    {
        "header": "2Related work",
        "images": []
    },
    {
        "header": "3Approach: When thinking reduces human performance",
        "images": []
    },
    {
        "header": "4Experiments",
        "images": []
    },
    {
        "header": "5Discussion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix AImplicit Statistical Learning Task",
        "images": [
            {
                "img": "https://arxiv.org/html/2410.21333/extracted/5987228/figures/fsg_original.png",
                "caption": "Figure 2:The FSG used inFallshore & Schooler (1993)andReber & Lewis (1977), two classic studies on artificial grammar learning. This FSG was used the generate strings for all participants in both studies. We form our dataset using FSGs that follow a similar structure.",
                "position": 1759
            },
            {
                "img": "https://arxiv.org/html/2410.21333/extracted/5987228/figures/fsg_ours.png",
                "caption": "Figure 3:The potential FSGs used in our dataset. Directed edges that always exist are in black, while the others that could exist are dashed and in gray. Bi-directional arrows denote two potential directed arrows. The letters on each edge represent a random sample.",
                "position": 1816
            }
        ]
    },
    {
        "header": "Appendix BFacial recognition task",
        "images": [
            {
                "img": "https://arxiv.org/html/2410.21333/extracted/5987228/figures/face_example.png",
                "caption": "Figure 4:An example of the six images generated for a problem. The first row contains one of the pair of generated images. The first image in the second row contains the other image in the pair, and the remaining four images are incorrect answers generated from this image.",
                "position": 1983
            }
        ]
    },
    {
        "header": "Appendix CData with exceptions task",
        "images": [
            {
                "img": "https://arxiv.org/html/2410.21333/x1.png",
                "caption": "Figure 5:Aggregate learning curve (number of correct objects classified out of 10) for GPT-4o prompted via direct prompting and chain-of-thought over 15 iterations. Direct prompting attains perfection very quickly, whereas chain-of-thought prompting results in stagnation.",
                "position": 2236
            }
        ]
    },
    {
        "header": "Appendix DLogical inconsistency task",
        "images": []
    },
    {
        "header": "Appendix ESpatial intuition task",
        "images": [
            {
                "img": "https://arxiv.org/html/2410.21333/extracted/5987228/figures/water_example_real.png",
                "caption": "Figure 6:An example of the water problem presented to large multimodal models. The glass on the left is filled with water, and the task is to determine which letter choice the empty glass should be filled to such that when the two glasses tilt to the same angle, water reaches each of their rims at the same time.",
                "position": 2382
            }
        ]
    },
    {
        "header": "Appendix FWorking memory preference task",
        "images": []
    }
]