[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.10440/x1.png",
                "caption": "Figure 1:Performance ofLLaVA-o1and other models across six multimodal reasoning benchmarks.AlthoughLLaVA-o1is fine-tuned from the Llama-3.2-11B-Vision-Instruct[40]model (which has the lowest average score), it outperforms many larger open-source models and even some closed-source models. Detailed benchmark results are shown in Table7.",
                "position": 91
            },
            {
                "img": "https://arxiv.org/html/2411.10440/x2.png",
                "caption": "Figure 2:Comparison of the base model andLLaVA-o1.As shown, the base model Llama-3.2-11B-Vision-Instruct exhibits obvious flaws in reasoning, with several errors occurring throughout the reasoning process. In contrast,LLaVA-o1begins by outlining the problem, interprets relevant information from the image, proceeds with a step-by-step reasoning process, and ultimately reaches a well-supported conclusion.",
                "position": 94
            }
        ]
    },
    {
        "header": "2Related Works",
        "images": []
    },
    {
        "header": "3Proposed Method",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.10440/x3.png",
                "caption": "Figure 3:Process flow for generating theLLaVA-o1-100kdataset.We prompt GPT-4o to generate responses in separate stages, and filter its outputs to ensure quality.",
                "position": 260
            },
            {
                "img": "https://arxiv.org/html/2411.10440/x4.png",
                "caption": "Figure 4:An illustration of inference approaches.Best-of-N search generatesN𝑁Nitalic_Ncomplete responses and selects the best one among them; Sentence-level Beam Search generates multiple candidate options for each sentence and chooses the best one. In contrast, our Stage-level Beam Search generates candidates for each reasoning stage (e.g., summary, caption, reasoning, and conclusion) and selects the best option at each stage. Best-of-N search operates at a coarse level, while Sentence-level Beam Search is overly granular, and our method achieves an optimal balance and achieves the best performance.",
                "position": 347
            },
            {
                "img": "https://arxiv.org/html/2411.10440/x5.png",
                "caption": "Figure 5:Comparison ofLLaVA-o1performance with and without stage-level beam search.Our stage-level beam search is effective in selecting better reasoning during model inference.",
                "position": 350
            }
        ]
    },
    {
        "header": "4Post-Training Performance",
        "images": []
    },
    {
        "header": "5Inference Time Scaling",
        "images": []
    },
    {
        "header": "6Comparison to State-of-the-Art VLMs",
        "images": []
    },
    {
        "header": "7Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]