[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/strawberry_2.jpg",
                "caption": "Figure 1:A classic ‘strawberry’ question reasoned by our Marco-o1 model: “How many ‘r’s are in ‘strawberry’.”",
                "position": 95
            }
        ]
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Marco Reasoning Datasets",
        "images": []
    },
    {
        "header": "3Solution Space Expansion via MCTS",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/intro_2.jpg",
                "caption": "Figure 2:The overview of Marco-o1.",
                "position": 204
            }
        ]
    },
    {
        "header": "4Reasoning Action Strategy",
        "images": []
    },
    {
        "header": "5Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/results.jpg",
                "caption": "Figure 3:The main results of Marco-o1.",
                "position": 382
            },
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/cot-step.jpg",
                "caption": "Figure 4:MCTS Expands the Solution Space for Correct Answers. Comparison between Marco-o1-CoT (left) and Marco-o1-MCTS (step) (right) on the MGSM dataset. While Marco-o1-CoT failed to provide the correct answer, integrating MCTS with step-level actions allowed the model to explore a broader solution space, increasing the likelihood of arriving at the correct solution.",
                "position": 394
            },
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/step-ministep32.jpg",
                "caption": "Figure 5:Finer Granularity with mini-steps Enhances Problem-Solving. Comparison between Marco-o1-MCTS (step) (left) and Marco-o1-MCTS (mini-step of 32 tokens) (right) on the MGSM dataset. The step-level action strategy did not yield the correct answer, but by using a finer-grained mini-step of 32 tokens, the model successfully navigated the solution space to find the correct answer, demonstrating the effectiveness of increased action granularity.",
                "position": 397
            },
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/ministep64-step.jpg",
                "caption": "Figure 6:Optimal Action Granularity Depends on Problem Complexity. Comparison between Marco-o1-MCTS (mini-step of 64 tokens) (left) and Marco-o1-MCTS (step) (right) on the MGSM dataset. The model with a mini-step of 64 tokens failed to find the correct answer, whereas using step-level actions enabled the model to correctly solve the problem. This highlights that we cannot draw definitive conclusions about which action strategy is superior. We believe that as the reward becomes more accurate, the larger solution space provided by MCTS will demonstrate greater potential.",
                "position": 400
            }
        ]
    },
    {
        "header": "6Case Study on Translation Tasks",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/translation.jpg",
                "caption": "Figure 7:Demonstration of translation task using Marco-o1 of a colloquial expression “This shoe has a comfortable sole and is highly recommended for purchase”.",
                "position": 416
            },
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/trans-case-1.jpg",
                "caption": "Figure 8:Translation comparison of a colloquial expression “It’s so beautiful that it’s captivating, the upper part has a distinctly Korean style, the soft and fluffy material is perfectly thick, and it’s complemented by a base layer, creating a unique and everyday-wear outfit”.",
                "position": 419
            },
            {
                "img": "https://arxiv.org/html/2411.14405/extracted/6016353/assets/trans-case-2.jpg",
                "caption": "Figure 9:Translation comparison of a colloquial expression “It’s so beautiful! And it’s so cheap, super straight and doesn’t curl. Buy it, buy it!”.",
                "position": 422
            }
        ]
    },
    {
        "header": "7Conclusions and Future Work",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]