[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.00771/x1.png",
                "caption": "Figure 1:Illustration of the superiority of CityGaussianV2. (a) Our method reconstructs large-scale complex scenes with accurate geometry from multi-view RGB images, restoring intricate structures of woods, buildings, and roads. (b) “Ours-coarse“ denotes training 2DGS with our optimization algorithm. This strategy accelerates 2DGS reconstruction in terms of both rendering quality (PSNR, SSIM) and geometry accuracy (F1 score). (c) Our optimized parallel training pipeline reduces the training time and memory by 25% and 50% respectively, while achieving better geometric quality. We report mean quality metrics inGauU-Scene(Xiong et al.,2024)here, with the best performance in each column highlighted inbold.",
                "position": 74
            }
        ]
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Related Works",
        "images": []
    },
    {
        "header": "3Method",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.00771/x2.png",
                "caption": "Figure 2:Illustration of our optimization mechanism. We densify Gaussians exclusively according to the gradient of SSIM loss. This helps remove large and blurry Gaussians and accelerate convergence. Meanwhile, we disable the densification of Gaussians with extreme elongation to avoid the Gaussian count explosion shown inFig.3. We also supervise the rendered depth with that predicted by Depth Anything V2(Yang et al.,2024). This helps improve both rendering and geometry quality.",
                "position": 152
            },
            {
                "img": "https://arxiv.org/html/2411.00771/x3.png",
                "caption": "Figure 3:Illustration of the motivation and effectiveness of our Elongation Filter. We take the reconstruction ofRubble(Turki et al.,2022)scene as an example. On the left, we highlight the collection of Gaussian primitives with high gradient or extreme elongation. There is a significant overlap between two collections. By restricting densification of these sand-like points, we prevent out-of-memory (OOM) errors caused by an explosion in Gaussian count, enabling a steady count evolution analogous to CityGaussian(Liu et al.,2024)in parallel tuning, as depicted on the right.",
                "position": 201
            },
            {
                "img": "https://arxiv.org/html/2411.00771/x4.png",
                "caption": "Figure 4:Illustration of pipeline modification. The pipeline of CityGS(Liu et al.,2024)(dashed boxes and arrows) is compared with ours. We successfully removed time-consuming post-pruning and distillation, while enabling storage compression for 2DGS.",
                "position": 230
            }
        ]
    },
    {
        "header": "4Geometric evaluation protocols",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.00771/x5.png",
                "caption": "Figure 5:Illustration of the evaluation process.",
                "position": 269
            }
        ]
    },
    {
        "header": "5Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.00771/x6.png",
                "caption": "Figure 6:Qualitative comparison of surface reconstruction quality. Here “Russian“ and “Modern“ denote the Russian Building and Modern Building scene ofGauU-Scene, respectively. And “Aerial“ denotes aerial view ofMatrixCity. The messy results of GOF are mainly attributed to the near-ground shell-like mesh. Due to the page limit, we leave further qualitative comparison with GOF and visualization at street view in the Appendix.",
                "position": 288
            },
            {
                "img": "https://arxiv.org/html/2411.00771/x7.png",
                "caption": "Figure 7:Qualitative comparison of rendering quality. Here “Russian“ and “Modern“ denote the Russian Building and Modern Building scene ofGauU-Scene, respectively. “Aerial“ denotes the aerial view ofMatrixCity. Due to the page limit, we leave the street view in the Appendix.",
                "position": 307
            }
        ]
    },
    {
        "header": "6Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix AAdditional Qualitative Comparison",
        "images": [
            {
                "img": "https://arxiv.org/html/2411.00771/x8.png",
                "caption": "Figure 8:Qualitative comparison of meshes generated from GOF and our CityGaussianV2.",
                "position": 1345
            },
            {
                "img": "https://arxiv.org/html/2411.00771/x9.png",
                "caption": "Figure 9:Qualitative comparison of results on the street view ofMatrixCity.",
                "position": 1348
            },
            {
                "img": "https://arxiv.org/html/2411.00771/x10.png",
                "caption": "Figure 10:Qualitative ablation of 7K iteration results among different methods.",
                "position": 1351
            }
        ]
    },
    {
        "header": "Appendix BAdditional Quantitative Results",
        "images": []
    },
    {
        "header": "Appendix CMore Implementation Details",
        "images": []
    },
    {
        "header": "Appendix DDiscussion",
        "images": []
    }
]