[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2502.05979/x1.png",
                "caption": "Figure 1.VFX Creatoris an efficient framework based on a Video Diffusion Transformer, enabling spatial and temporal control for visual effect (VFX) video generation. With minimal training data, a plug-and-play mask control module allows precise instance-level manipulation, while the integration of tokenized start-end motion timestamps with text space provides fine-grained temporal control over the VFX rhythm.Project Page:https://vfx-creator0.github.io/",
                "position": 90
            }
        ]
    },
    {
        "header": "1.Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2502.05979/x2.png",
                "caption": "Figure 2.Overview of our proposed Open-VFX Dataset. (a) demonstrates diverse input inference images in the dataset, including humans, animals, objects, and various scenes across single and multiple components. (b) shows the text descriptions of the proposed 15 VFXs, and (c) presents an example (Explode it) VFX.",
                "position": 199
            }
        ]
    },
    {
        "header": "2.Related Work",
        "images": []
    },
    {
        "header": "3.Dataset",
        "images": [
            {
                "img": "https://arxiv.org/html/2502.05979/x3.png",
                "caption": "Figure 3.More examples of our Open-VFX dataset, including 10 VFXs and diverse reference images.",
                "position": 238
            },
            {
                "img": "https://arxiv.org/html/2502.05979/x4.png",
                "caption": "Figure 4.Pipeline of VFX Creator.We introduce two novel modules: (a) Spatial Controlled LoRA Adapter. This module integrates a mask-conditioned ControlNet with LoRA, injecting mask sequences into the model to enable instance-level spatial manipulation. (b) Temporal Controlled LoRA Adapter. We explore two strategies for incorporating temporal control: module I involves tokenizing start-end motion timestamps and embedding them into the diffusion process alongside the text space, while module II integrates temporal mask with timestep embeddings to guide the diffusion process.",
                "position": 248
            }
        ]
    },
    {
        "header": "4.Network",
        "images": []
    },
    {
        "header": "5.EXPERIMENT",
        "images": [
            {
                "img": "https://arxiv.org/html/2502.05979/x5.png",
                "caption": "Figure 5.Qualitative comparisons of VFX video generation on two different visual effects between our method, DynamiCrafter, LTX-Video, CogVideoX-5B, and Pika.",
                "position": 403
            },
            {
                "img": "https://arxiv.org/html/2502.05979/x6.png",
                "caption": "Figure 6.Qualitative results of spatial controllable VFX video generation of our method on two different visual effects. Users can precisely specify the animated instance by clicking points or dropping boxes to obtain the mask.",
                "position": 511
            },
            {
                "img": "https://arxiv.org/html/2502.05979/extracted/6194424/Figs/evaluation_metrics_comparison.png",
                "caption": "Figure 7.User Study. Our VF Creator demonstrates superior human preference compared to other methods",
                "position": 670
            }
        ]
    },
    {
        "header": "6.Limitation",
        "images": []
    },
    {
        "header": "7.Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix ADefinations of visual effects",
        "images": []
    },
    {
        "header": "Appendix BQuantitative results of mixed training",
        "images": []
    },
    {
        "header": "Appendix CMore Controlled Qualitative results",
        "images": [
            {
                "img": "https://arxiv.org/html/2502.05979/x7.png",
                "caption": "Figure 8.More spatial controlled VFX generation results of our method on two different visual effects.",
                "position": 1907
            },
            {
                "img": "https://arxiv.org/html/2502.05979/x8.png",
                "caption": "Figure 9.More qualitative comparison results of VFX video generation on two different visual effects between our method, DynamiCrafter, LTX-Video, CogVideoX-5B, and Pika.",
                "position": 1910
            },
            {
                "img": "https://arxiv.org/html/2502.05979/x9.png",
                "caption": "Figure 10.More temporal controlled VFX generation results of our method.",
                "position": 1913
            }
        ]
    },
    {
        "header": "Appendix DMore Qualitative comparison results",
        "images": []
    }
]