[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.05978/extracted/6258787/Figure/teaser_0308.png",
                "caption": "Figure 1:Given a portrait image, our model can generate compelling, realistic, and vivid animation videos with control over text and voice, ensuring temporal coherence and perceptual quality even under significant head pose variations and diverse portrait styles.",
                "position": 91
            }
        ]
    },
    {
        "header": "1INTRODUCTION",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.05978/x1.png",
                "caption": "Figure 2:Overview of MagicInfinite.MagicInfinite employs a hybrid dual-to-single-stream denoising network with Audio Cross-Attention in final blocks. MLLM encodes static portrait and text into tokens, concatenated for T2V, refined, and denoised. Wav2Vec encodes audio, resampled by an Audio Encoder, and guided by a Face Region Mask for precise lip sync and adaptive loss.",
                "position": 154
            }
        ]
    },
    {
        "header": "2RELATED WORK",
        "images": []
    },
    {
        "header": "3METHOD",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.05978/x2.png",
                "caption": "Figure 3:The overview of our modified DMD2. We employed a curriculum learning strategy to gradually reduce the weight of the base loss while progressively increasing the weight of the SDS loss, effectively avoiding abrupt shifts in learning objectives. Furthermore, we adopted a two-fold to three-fold CFG attenuation strategy in the calculation of the real data distribution, which significantly enhances the motion dynamics of the generated video.",
                "position": 298
            },
            {
                "img": "https://arxiv.org/html/2503.05978/x3.png",
                "caption": "Figure 4:Qualitative experimental results of MagicInfinite",
                "position": 371
            }
        ]
    },
    {
        "header": "4EXPERIMENT",
        "images": []
    },
    {
        "header": "5Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]