[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23368/x1.png",
                "caption": "Figure 1:Existing commercial closed-source VDMs fail to generate physically plausible motion, whereas our video generation framework is able to achieve this by incorporating external physical prior knowledge.",
                "position": 82
            }
        ]
    },
    {
        "header": "2Related Work",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23368/x2.png",
                "caption": "Figure 2:The illustration of our physically plausible image-to-video generation pipeline. Our pipeline consists of two stages. In the first stage, the VLM generates a coarse-grained, physically plausible motion trajectory based on the provided input conditions. In the second stage, We simulate a synthetic video using the predicted trajectory to provide the motion condition. We then extract the optical flow from this video and convert it into structured noise. These conditions are fed into a motion controllable image-to-video diffusion model, and ultimately generates a physically plausible video.",
                "position": 134
            },
            {
                "img": "https://arxiv.org/html/2503.23368/x3.png",
                "caption": "Figure 3:The illustration of chain-of-thought reasoning in the VLM for generating a coarse-grained motion trajectory. First off, the VLM determines the corresponding physical laws and its context for the given scene. Then, the VLM performs step-by-step reasoning to predict the physically plausible motions of objects in image space, leveraging physical context and chain-of-thought prompting. Finally, the VLM predicts bounding boxes according to real-world physics.",
                "position": 168
            }
        ]
    },
    {
        "header": "3Method",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23368/x4.png",
                "caption": "Figure 4:Visual comparisons of physically plausible video generation results from our framework, CogVideoX-I2V-5B[60], LTX-Video-I2V[14]and SVD-XT[5].",
                "position": 277
            }
        ]
    },
    {
        "header": "4Empirical Analysis and Disscusion",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23368/x5.png",
                "caption": "Figure 5:Visual comparisons of physically plausible video generation results from our framework, CogVideoX-I2V-5B, LTX-Video-I2V, SVD-XT and SG-I2V[35]in the Physics-IQ dataset.",
                "position": 486
            }
        ]
    },
    {
        "header": "5Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix ACoarse-Level Motion Planning Details",
        "images": []
    },
    {
        "header": "Appendix BExperiment Details",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23368/x6.png",
                "caption": "Figure 6:Physics-Aware Reasoning Template for Rigid Body Motion",
                "position": 1573
            },
            {
                "img": "https://arxiv.org/html/2503.23368/x7.png",
                "caption": "Figure 7:Physics-Aware Reasoning Template for fluid dynamics and thermodynamics.",
                "position": 1576
            },
            {
                "img": "https://arxiv.org/html/2503.23368/x8.png",
                "caption": "Figure 8:More examples of generated videos related to fluid dynamics and thermodynamics.",
                "position": 1579
            },
            {
                "img": "https://arxiv.org/html/2503.23368/x9.png",
                "caption": "Figure 9:More examples of generated videos related to thermodynamics.",
                "position": 1582
            },
            {
                "img": "https://arxiv.org/html/2503.23368/x10.png",
                "caption": "Figure 10:More examples of generated videos related to fluid dynamics.",
                "position": 1585
            },
            {
                "img": "https://arxiv.org/html/2503.23368/x11.png",
                "caption": "Figure 11:More examples of generated videos related to optics.",
                "position": 1588
            }
        ]
    },
    {
        "header": "Appendix CMore Qualitative Results",
        "images": []
    }
]