[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23361/x1.png",
                "caption": "Figure 1:Overall workflow of stochastic error ascent (SEA). We search for a closed-weight model’s unknown knowledge iteratively from a given knowledge base until we reach the budget. The result from SEA can be further used to analyze the model’s unknown categories and error patterns.",
                "position": 104
            }
        ]
    },
    {
        "header": "2Related work",
        "images": []
    },
    {
        "header": "3Vulnerability Discovery for Large Language Models",
        "images": []
    },
    {
        "header": "4Comparing Stochastic Error Ascent with Baselines",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23361/x2.png",
                "caption": "Figure 2:Comparison of errors discovered by ACD, AutoBencher, and SEA. We compare ACD with SEA among the same budget while comparing AutoBencher among the same question size. For ACD, we summarized the number of failed tasks, and for SEA, we summarized the number of source errors. We let AutoBencher create 13 benchmarks, each of which takes one of the Wikipedia categories as an interesting topic. We let SEA search the same number of questions according to each model.o1-minifailed on ACD due to the violation of the prompt usage policy from OpenAI.",
                "position": 308
            }
        ]
    },
    {
        "header": "5Analyzing Stochastic Error Ascent",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23361/x3.png",
                "caption": "Figure 3:Per-step errorTE⁢(fclose)subscript𝑇𝐸subscript𝑓closeT_{E}(f_{\\text{close}})italic_T start_POSTSUBSCRIPT italic_E end_POSTSUBSCRIPT ( italic_f start_POSTSUBSCRIPT close end_POSTSUBSCRIPT )and cumulative errorT𝒮⁢(fclose)subscript𝑇𝒮subscript𝑓closeT_{{\\mathcal{S}}}(f_{\\text{close}})italic_T start_POSTSUBSCRIPT caligraphic_S end_POSTSUBSCRIPT ( italic_f start_POSTSUBSCRIPT close end_POSTSUBSCRIPT )for each model. We observe that the errors of all models are positively related to step, indicating SEA can gradually and continually find the model’s knowledge deficiencies from the knowledge base.",
                "position": 334
            },
            {
                "img": "https://arxiv.org/html/2503.23361/x4.png",
                "caption": "Figure 4:Ablation studies on the component contribution of SEA. We compare SEA with its two variants: without source pruning (i.e., pass the lines 10 and 11 in Alg.1) and random selection (i.e., pass the lines 9, 10, and 11 in Alg.1). We observe that each component contributes equally to SEA.",
                "position": 337
            }
        ]
    },
    {
        "header": "6Analyzing LLMs from the Discovery Results",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23361/x5.png",
                "caption": "Figure 5:Comparison of cross-validation between each model. X-axis indicates the subset provider (i.e.,𝒮^^𝒮\\hat{{\\mathcal{S}}}over^ start_ARG caligraphic_S end_ARGprovider; sourced from experiments in Fig.3), and Y-axis denotes the testee. We summarize two results: (1) correlation between testee result and provider result, and (2) accuracy of testee on each provider’s results. The higher the correlation, the more similar the answers of the two models are. Similarly, the higher the testee’s accuracy, the more challenging the provider’s question.",
                "position": 353
            },
            {
                "img": "https://arxiv.org/html/2503.23361/x6.png",
                "caption": "Figure 6:Error distribution of each testee model. We search with thesame initial setfrom thirteen categories of Wikipedia. We visualize the results by t-SNE without a clustering algorithm. Each point in the figure denotes the corresponding model’s source errorp∈𝒫source𝑝subscript𝒫sourcep\\in{\\mathcal{P}}_{\\text{source}}italic_p ∈ caligraphic_P start_POSTSUBSCRIPT source end_POSTSUBSCRIPT. Different colors denote different models, and different markers denote different categories. We can observe natural clusters of each model discovered by SEA according to their knowledge omission areas.",
                "position": 368
            },
            {
                "img": "https://arxiv.org/html/2503.23361/x7.png",
                "caption": "Table 1:Error patterns for models in cluster 3 and 5 in Fig.6. We aggregate error patterns from the question level to the paragraph level and finally to the model level.",
                "position": 371
            }
        ]
    },
    {
        "header": "7Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix AFuture works",
        "images": []
    },
    {
        "header": "Appendix BCost Analysis",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.23361/x7.png",
                "caption": "Table 2:Question generation cost, inference cost, and output tokens at inference time across 20 steps (results in Fig.3; 20,000 questions in total). We can see a significant gap between reasoning models (DeepSeek-R1,R1-Distill-Llama-70B, ando1-mini) and other non-reasoning models.",
                "position": 1186
            },
            {
                "img": "https://arxiv.org/html/2503.23361/x7.png",
                "caption": "Figure 7:Error distribution of each testee model. We search with thesame random initial setfrom Wikipediawithout specifying specific topics. We visualize the results by t-SNE without a clustering algorithm. Each point in the figure denotes the corresponding model’s source errorp∈𝒫source𝑝subscript𝒫sourcep\\in{\\mathcal{P}}_{\\text{source}}italic_p ∈ caligraphic_P start_POSTSUBSCRIPT source end_POSTSUBSCRIPT. Different colors denote different models, and different markers denote different categories.",
                "position": 1243
            }
        ]
    },
    {
        "header": "Appendix CExtra Analysis and Case Studies",
        "images": []
    },
    {
        "header": "Appendix DPrompt of SEA",
        "images": []
    }
]