[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.04388/extracted/6257630/sections/main_fig.jpg",
                "caption": "Figure 1:More Documents, Same Length.We create various sets containing the same questions but differing in the number of distractor documents. Each set includes a multi-hop question, all of the supporting documents that contain the information to answer the question (pink), and varying distractor documents (blue). We begin with a 20-document version (left) and then reduce the number of documents while maintaining a fixed context size. When fewer documents are used, the remaining documents are extended (blue without text) so that concatenating them yields the same total length.",
                "position": 89
            },
            {
                "img": "https://arxiv.org/html/2503.04388/extracted/6257630/figures/plots_febuary/combining_all_models_reorder_original_docs.png",
                "caption": "Figure 2:Increasing the number of retrieved document can hurt performance.In retrieval setups with fixed context windows, adding more documents could reduce performance by up to 10 percent. Two models (Llama-\n3.1 and Gemma-2) showed worse performance, while Qwen-2 remained unaffected. The smaller versions of the LLMs (7–9B) show a similar trend as their larger counterparts but the effect is weaker. The hues of the bars represent the amount of retrieved documents.",
                "position": 98
            }
        ]
    },
    {
        "header": "2Multi-Document Evaluation with Controlled Token Count",
        "images": [
            {
                "img": "https://arxiv.org/html/2503.04388/extracted/6257630/figures/plots_febuary/combining_all_models_reorder_replaced.png",
                "caption": "Figure 3:The effects of adding non-related documents.When adding irrelevant documents, LLMs’ performance improves.",
                "position": 165
            }
        ]
    },
    {
        "header": "3Evaluation",
        "images": []
    },
    {
        "header": "4Conclusions",
        "images": []
    },
    {
        "header": "5Limitations",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]