[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.19630/x1.png",
                "caption": "Figure 1:Comparison of the average accuracy scores for diagnosis and recommendation, as well as the average interaction rounds, between DoctorAgent-RL and other models.",
                "position": 142
            }
        ]
    },
    {
        "header": "2Related Work",
        "images": []
    },
    {
        "header": "3Method",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.19630/x2.png",
                "caption": "Figure 2:The multi-agent collaborative reinforcement learning framework for DoctorAgent-RL. During the rollout stage, multi-turn interactions are conducted between the doctor agent and the patient agent.",
                "position": 398
            }
        ]
    },
    {
        "header": "4Experiments",
        "images": []
    },
    {
        "header": "5Conclusion and future work",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix",
        "images": []
    },
    {
        "header": "Appendix AComparison of Diagnostic Consultation Paradigms",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.19630/x3.png",
                "caption": "Figure 4:Comparison of diagnostic consultation paradigms. (A) Single-Turn Consultation: Direct diagnosis based on initial query without follow-up interactions, prone to misdiagnosis due to insufficient symptom clarification. (B) SFT Multi-Turn Consultation: Implements basic multi-turn dialogue through supervised fine-tuning but lacks adaptive optimization. (C) SFT-RL Multi-Turn Consultation: Integrates RL with real-world feedback to dynamically optimize questioning strategies, enabling context-aware symptom investigation (e.g., pain nature, duration, triggers) and reducing diagnostic errors through iterative interaction.",
                "position": 1441
            }
        ]
    },
    {
        "header": "Appendix BDetails of MTMedDialog",
        "images": []
    },
    {
        "header": "Appendix CPrompts for Evaluation Metrics",
        "images": []
    },
    {
        "header": "Appendix DPrompt for Doctor Agent",
        "images": []
    },
    {
        "header": "Appendix EPrompt for Patient Agent",
        "images": []
    },
    {
        "header": "Appendix FDetailed Comparative Performance Evaluation of Multi-Model Approaches on MTMedDialog",
        "images": []
    },
    {
        "header": "Appendix GDetailed Description of the Dialogue Flow in DoctorAgent-RL",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.19630/x4.png",
                "caption": "Figure 10:An example of dialogue flow among Doctor and Patient in DoctorAgent-RL.",
                "position": 2068
            }
        ]
    },
    {
        "header": "Appendix HSettings of RL training in DoctorAgent-RL",
        "images": []
    }
]