[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.10831/extracted/6452473/figures/fig1.jpg",
                "caption": "Figure 1.General User Models take as input completely unstructured interaction data (top), transforming these observations into structured propositions about a user (center). Together, these propositions create ageneral user model(GUM). We instantiate our user model in an assistant (Gumbo) that proactively discovers and executes suggestions on a user’s behalf (bottom).",
                "position": 268
            }
        ]
    },
    {
        "header": "1.Introduction",
        "images": []
    },
    {
        "header": "2.Related Work",
        "images": []
    },
    {
        "header": "3.General User Models",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.10831/extracted/6452473/figures/figure2.jpg",
                "caption": "Figure 2.General User Models can ground user queries in a broader context. In this example, the user is writing an Applications section for this paper. Given a severely underspecified query, the General User Model marshalls relevant context—the draft the user has been working on, the section the user is referring to, the applications the user has already considered—and generates a highly contextualized response.",
                "position": 408
            }
        ]
    },
    {
        "header": "4.Applications of General User Models",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.10831/extracted/6452473/figures/horizonfigure.jpg",
                "caption": "Figure 3.GUMBO is an assistant designed to proactively surface and execute helpful suggestions for users. We builtGUMinto a custom desktop app. (A) The Suggestions page displays suggestions to the user, each of which the system has attempted to complete as much as possible on its own. In this figure, GUMBO suggested that the author recruit participants for the GUM user study and put together a detailed strategy plan in the background. Users can hit ”Start Chat” to talk to GUMBO in more detail. (B) The Memory page allows users to view the raw propositions in their GUM, and edit, delete, or add propositions.",
                "position": 491
            },
            {
                "img": "https://arxiv.org/html/2505.10831/extracted/6452473/figures/final_pipeline.jpg",
                "caption": "Figure 4.The GUM pipeline observes user behavior via unstructured inputs (e.g., screenshots), audits updates for privacy violations using contextual integrity, constructs propositions with associated confidence scores, retrieves contextually similar propositions, and revises the model. Each step iteratively refines GUM’s understanding of the user.",
                "position": 595
            }
        ]
    },
    {
        "header": "5.Constructing a General User Model",
        "images": []
    },
    {
        "header": "6.Evaluating General User\nModels:Accuracy and Calibration",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.10831/extracted/6452473/figures/win_rates.jpg",
                "caption": "Figure 5.Relative to ablations, propositions from the fullGUMarchitecture are preferred by users. Additionally, retrieval and revision depend heavily on each other. Without retrieving relevant propositions, the revise module is unable to correctly adjust propositions. Ablating retrieval causes win rates to fall significantly.",
                "position": 863
            },
            {
                "img": "https://arxiv.org/html/2505.10831/extracted/6452473/figures/calibration_plot.png",
                "caption": "Figure 6.GUMs are generally well calibrated. When errors occur,GUMs areunderconfidentin their propositions—the actual model’s predictions lie above perfect calibration. In the user modeling setting, this is ideal. We should underestimate propositions to avoid eroding user trust.",
                "position": 895
            }
        ]
    },
    {
        "header": "7.Evaluating General User Models:Privacy Audit Module",
        "images": []
    },
    {
        "header": "8.Evaluating General User Models:End-to-End viaGumbo",
        "images": []
    },
    {
        "header": "9.Discussion",
        "images": []
    },
    {
        "header": "10.Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix ACode",
        "images": []
    },
    {
        "header": "Appendix BAbridged Prompts",
        "images": []
    },
    {
        "header": "Appendix CSurvey Questions",
        "images": []
    },
    {
        "header": "Appendix DInterview Questions",
        "images": []
    },
    {
        "header": "Appendix EScreen Observer Outputs",
        "images": []
    }
]