[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Related Works",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.10167/extracted/6441699/Figures/quxai_lit.png",
                "caption": "Figure 1:Citation network map illustrating the relationships and thematic clustering of key research papers relevant to the QuXAI framework, hybrid quantum-classical models, and explainable AI in quantum machine learning. Node size represent citation counts or other metrics, and edges indicate citation links or strong thematic overlap.",
                "position": 160
            }
        ]
    },
    {
        "header": "3Methodology",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.10167/extracted/6441699/Figures/quxai_workflow.png",
                "caption": "Figure 2:Overall workflow of the QuXAI framework, illustrating the sequential stages from data preparation, through hybrid quantum-classical model (HQML) training and evaluation, to feature importance explanation using Q-MEDLEY and subsequent visualization of the results. The training stage depicts distinct paths for amplitude-encoded and kernel-based HQML models. The complete pipeline is detailed in Algorithm2.",
                "position": 210
            }
        ]
    },
    {
        "header": "4Results",
        "images": [
            {
                "img": "https://arxiv.org/html/2505.10167/extracted/6441699/Figures/qmedley_res_iris.png",
                "caption": "Figure 3:Q-MEDLEY scores for ten different amplitude-encoded HQML models trained on the Noisy Iris dataset. Each panel shows the importance attributed by Q-MEDLEY to each input feature for a specific HQML model type.",
                "position": 499
            },
            {
                "img": "https://arxiv.org/html/2505.10167/extracted/6441699/Figures/qmedley_res_wine.png",
                "caption": "Figure 4:Q-MEDLEY scores for ten different amplitude-encoded HQML models trained on the Noisy Wine dataset. Each panel displays Q-MEDLEY scores, highlighting the relative importance of input features for various HQML model architectures.",
                "position": 505
            },
            {
                "img": "https://arxiv.org/html/2505.10167/extracted/6441699/Figures/recall.png",
                "caption": "Figure 5:Recall@3 comparison of explainers (DCI, PI (k=5), Q-MEDLEY, TreeSHAP) on the Noisy Iris dataset for Decision Tree and Random Forest models, considering the top 3 identified features.",
                "position": 518
            },
            {
                "img": "https://arxiv.org/html/2505.10167/extracted/6441699/Figures/rank_corr.png",
                "caption": "Figure 6:Spearman Rank Correlation heatmap comparing feature importance rankings from different explainers (DCI, PI (k=5), Q-MEDLEY, LogRegL1) against ground truth importances from Decision Tree and Random Forest models on the Noisy Iris Dataset.",
                "position": 524
            }
        ]
    },
    {
        "header": "5Discussion",
        "images": []
    },
    {
        "header": "6Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]