[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1.Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2508.21334/x1.png",
                "caption": "Figure 1.Top: NDCG score distribution of two handpicked, non-overlapping user groups from our experiment and for all individual users of the two groups. Circles denote outliers. Bottom: Fairness score (Gini) for groups and individuals. The lower the Gini score, the fairer. Fairness is better between groups than across all individuals as both groups have similar average NDCG, but within-group variance is high, which means that recommendation quality varies widely across users (see the boxplots).",
                "position": 111
            }
        ]
    },
    {
        "header": "2.Methodology",
        "images": []
    },
    {
        "header": "3.Empirical Analysis",
        "images": [
            {
                "img": "https://arxiv.org/html/2508.21334/",
                "caption": "Table 2.Effectiveness (Eff) and fairness (Fair) scores at cut-offk=10k=10for intersectional groups (Grp.) and for individuals (Ind.) of LLMRecs with non-sensitive (NS) and sensitive (S) prompts. AllFairscores are computed with NDCG. All measures range in [0,1], except for theGrp.measures below the grey lines. The bestEff/Fairscores are bolded.\nDarker green marks scores closer to the bestEff/Fairper measure.↑⁣/⁣↓\\uparrow/\\downarrowmeans the higher/lower the better.",
                "position": 366
            },
            {
                "img": "https://arxiv.org/html/2508.21334/",
                "caption": "Figure 2.Agreement (Kendall’sτ\\tau) of NDCG-based measures for individualFair(yy-axis) and groupFair(xx-axis) in ranking LLMRecs. User groups are based on 3 sensitive attributes. Due to 8-way ties,τ\\taucannot be computed for Min (JobRec).",
                "position": 1523
            },
            {
                "img": "https://arxiv.org/html/2508.21334/x3.png",
                "caption": "Figure 3.NDCG-based Group (Grp) and individual (Ind)Fairscores of GLM-4-9B (NS-prompt). Grp (aa) is the meanFairscores across all ways of grouping users when consideringaaattribute(s). Fora∈{1,2}a\\in\\{1,2\\}, the # of ways to group users is three each. Fora=3a=3, there is only one way to group users.",
                "position": 1555
            },
            {
                "img": "https://arxiv.org/html/2508.21334/x4.png",
                "caption": "Figure 4.NDCG-based individual, between- and within-group unfairness of GLM-4-9B (NS-prompt) for all ways of grouping users in JobRec and LFM-1B.",
                "position": 1559
            },
            {
                "img": "https://arxiv.org/html/2508.21334/x5.png",
                "caption": "",
                "position": 1562
            }
        ]
    },
    {
        "header": "4.Discussion and Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]