[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2508.13562/x1.png",
                "caption": "Figure 1:Illustration of SMPLify and motivation of our work. IK and FK denote inverse kinematics and forward kinematics, respectively. Opt. refers to optimized items. The high computational cost of the iterative process and the reliance on human priors motivate the development of a data-driven and non-iterative approach.",
                "position": 104
            }
        ]
    },
    {
        "header": "2Related Work",
        "images": []
    },
    {
        "header": "3Method",
        "images": [
            {
                "img": "https://arxiv.org/html/2508.13562/x2.png",
                "caption": "Figure 2:Overview of Learnable SMPLify. The framework first constructs a human-centric coordinate system from the initial joints and uses it to normalize both the initial and target joints into the same reference frame. Then, a neural solver, comprised of a joint feature extractor and a regressor, takes the normalized joints along with the initial SMPL parameters to predict residual pose parameters.",
                "position": 277
            }
        ]
    },
    {
        "header": "4Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2508.13562/x3.png",
                "caption": "Figure 3:Qualitative evaluation on sequential inference. Predicted (white) and ground-truth meshes (red) are overlaid for visual comparison. Each row displays samples from a single sequence.",
                "position": 738
            },
            {
                "img": "https://arxiv.org/html/2508.13562/x4.png",
                "caption": "Figure 4:Qualitative results of plug-in post-processing. The left and right columns present the results based on GVHMR and SMPLest-X, respectively. Significant errors are marked with red circles. Faces are mosaicked for ethical considerations. Best viewed when zoomed in.",
                "position": 741
            }
        ]
    },
    {
        "header": "5Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix ANeural Solver Architecture",
        "images": []
    },
    {
        "header": "Appendix BExperiment",
        "images": []
    }
]