[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.21268/x1.png",
                "caption": "Figure 1:Overview of the Variance-Aware Sampling (VAS) framework.",
                "position": 181
            }
        ]
    },
    {
        "header": "2Related Work",
        "images": []
    },
    {
        "header": "3Variance-Aware Sampling Framework",
        "images": []
    },
    {
        "header": "4Theory",
        "images": []
    },
    {
        "header": "5Data Curation",
        "images": []
    },
    {
        "header": "6Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.21268/x2.png",
                "caption": "Figure 2:Training efficiency of Variance-Aware Sampling (VAS).\nThe plots compare three settings: full VAS sampling (λ=1.0\\lambda=1.0,orange), mixed sampling with half VAS and half random (λ=0.5\\lambda=0.5,blue), and the vanilla baseline (purple).Left:Actor gradient norm, reflecting the magnitude of gradient signals during training.Middle:Policy gradient clip fraction, indicating the proportion of updates reaching the clipping boundary.Right:Validation accuracy, showing convergence speed and final performance.",
                "position": 1063
            },
            {
                "img": "https://arxiv.org/html/2509.21268/x3.png",
                "caption": "Figure 3:Dynamics of Variance Promotion Score (VPS) during training.\nThe top row illustrates the distribution of VPS values across data points at different training steps.\nThe bottom row shows transition matrices of VPS assignments between consecutive update intervals, where each cell indicates the number of data points moving from a source bin (vertical axis) at the earlier step to a target bin (horizontal axis) at the later step.\nThe arrows indicate the direction from lower to higher VPS bins, facilitating interpretation of upward or downward transitions.",
                "position": 1117
            },
            {
                "img": "https://arxiv.org/html/2509.21268/x4.png",
                "caption": "Figure 4:Qualitative demonstration of MMR1’s reasoning process on a MathVerse problem. The figure illustrates the input question, the model’s step-by-step thinking process, and the final answer. The reasoning is logically structured, including problem analysis, solution planning, execution, verification, and alternative approaches, ultimately arriving at the correct answer (140∘140^{\\circ}).",
                "position": 1140
            }
        ]
    },
    {
        "header": "7Conclusion and Limitation",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix AVariance–Progress Theory",
        "images": []
    },
    {
        "header": "Appendix BFine-Grained Math Type Definitions",
        "images": []
    },
    {
        "header": "Appendix CDetailed Hyper-parameters",
        "images": []
    },
    {
        "header": "Appendix DSystem Prompt",
        "images": []
    }
]