[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "IIntroduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.15061/x1.png",
                "caption": "Figure 1:Difference between the executor and the collaborator.The executor passively follows instructions, which may lead to failure.\nIn contrast, the collaborator actively communicates with the user to understand the intended instruction and successfully complete the task.",
                "position": 97
            }
        ]
    },
    {
        "header": "IIRelated Work",
        "images": []
    },
    {
        "header": "IIIMethod",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.15061/x2.png",
                "caption": "Figure 2:The Ask-to-Clarify framework.We train the Ask-to-Clarify framework using a two-stage knowledge-insulation strategy.\nFirst, we fine-tune the collaboration component (VLM) with ambiguity-solving dialogue data to enable clarification ability.\nNext, we freeze the collaboration component and integrate the action component (diffusion expert), fine-tuning the diffusion expert to generate low-level actions while preserving interaction ability.\nThe signal token (Sig. token) is supervised during training as part of the VLM’s output, but is only used at inference time.",
                "position": 243
            },
            {
                "img": "https://arxiv.org/html/2509.15061/x3.png",
                "caption": "Figure 3:The signal detector of the Ask-to-Clarify framework.The signal detector functions as a router for the seamless switching of the Ask-to-Clarify framework between collaboration and actions.",
                "position": 332
            }
        ]
    },
    {
        "header": "IVExperiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.15061/x4.png",
                "caption": "Figure 4:Examples of our tasks.The figure shows one task for each general type: “Put the Apple on the plate” (top), “Pour the water from the Green cup onto the plate” (middle), “Stack the Yellow block on top of the Blue block” (bottom).",
                "position": 361
            }
        ]
    },
    {
        "header": "VConclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]