[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.19768/x1.png",
                "caption": "Figure 1:Summary of the performance–cost trade-off across different VLMs on historical documents, measured on the fullChurro-DStest set.Churrooutperforms the 3B-parameter Qwen 2.5 VL by 21.3%. It also outperforms the second-best model (Gemini 2.5 Pro) by 4.1% while being 15.5 times more cost-effective. Costs for closed models are measured with the 50% batching discount offered by providers. The costs of open-weight models are estimated followingPoznanski et al. (2025).",
                "position": 129
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x2.png",
                "caption": "(a)Printed",
                "position": 152
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x2.png",
                "caption": "(a)Printed",
                "position": 155
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x3.png",
                "caption": "(b)Handwritten",
                "position": 161
            }
        ]
    },
    {
        "header": "2Related Work",
        "images": []
    },
    {
        "header": "3TheChurro-DSDataset",
        "images": []
    },
    {
        "header": "4Experiments and Results",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.19768/images/churro.png",
                "caption": "Table 1:Normalized Levenshtein similarity scores of models evaluated on theprintedsubset of theChurro-DStest set (higher is better). Columns represent language clusters arranged alphabetically from left to right: Bangla, Bulgarian, Czech, German, English, Finnish, French, Hindi, Japanese, Latin, Dutch, Polish, Romanian, Sanskrit, Slovenian, Spanish, Swedish, Chinese, and the average across all language clusters. Within each system category, models are sorted by average similarity (highest to lowest).",
                "position": 363
            },
            {
                "img": "https://arxiv.org/html/2509.19768/images/churro.png",
                "caption": "Table 2:Normalized Levenshtein similarity scores of models evaluated on thehandwrittensubset of theChurro-DStest set (higher is better). Columns represent language clusters arranged alphabetically from left to right: Arabic, Catalan, German, Greek, English, Persian, French, Hebrew, Italian, Japanese, Khmer, Latin, Dutch, Norwegian, Portuguese, Sanskrit, Spanish, Swedish, Turkish, Vietnamese, Chinese, and the average across all language clusters. Within each system category, models are sorted by average similarity (highest to lowest).",
                "position": 1204
            }
        ]
    },
    {
        "header": "5Conclusion",
        "images": []
    },
    {
        "header": "Limitations",
        "images": []
    },
    {
        "header": "Ethical Considerations",
        "images": []
    },
    {
        "header": "Acknowledgement",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix AChurro-DSDetails",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.19768/x4.png",
                "caption": "Figure 3:Distribution of Qwen 2.5 VL tokens in the gold text. Log-scale x-axis. Red dashed line shows the median.",
                "position": 5100
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x5.png",
                "caption": "Figure 4:Plot of image dimensions inChurro-DS. Each point shows the width and height of a single image. Note that we resize large images to fit inside a 2500×\\times2500 pixel box while maintaining their original aspect ratio.",
                "position": 5103
            }
        ]
    },
    {
        "header": "Appendix BSystem Details",
        "images": []
    },
    {
        "header": "Appendix CAdditional Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.19768/x6.png",
                "caption": "Figure 5:The effect of document length on normalized Levenshtein similarity. Here we show this effect for Gemini 2.5 Pro on the left andChurroon the right.",
                "position": 6065
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x7.png",
                "caption": "",
                "position": 6068
            }
        ]
    },
    {
        "header": "Appendix DExample System Outputs",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.19768/x8.png",
                "caption": "Figure 6:Document example where the unusual reading order causes the zero-shot VLM to make major mistakes.444The English translation of the gold text is: “In the eighth year of the Guimao cycle, the 10th year of the Song dynasty’s Chunxi reign, in the first month of spring, Wu Lüxin was appointed as general to lead a campaign against Ailao. In the eleventh month, on the day of Renwu, a solar eclipse occurred. In the ninth year of Jiachen, the 11th year of Chunxi, in the third month of spring, Champa sent tribute, including three items from Siam. Merchants from Qi and neighboring countries came to Yuntun Garrison to offer goods and request permission to trade. In the tenth month, the Meng people and others rebelled and fought among themselves. In the 10th year of Yisi, the 12th year of Chunxi, in the first month of spring, civil service examinations were held for scholars aged fifteen and above. Those proficient in poetry and classical texts were admitted to study at the imperial court; thirty candidates, including Pei Guokai and Deng Yan, were selected. The rest remained in school. In the seventh month of autumn, the King of Jiankang, Long Yi, was ordered to lead an expedition against the southern tribes, which were subsequently pacified.”",
                "position": 6091
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x9.png",
                "caption": "Figure 7:A Classical Chinese document where the zero-shot VLM is not able to recognize the smaller text.666The English translation of the gold text is: “To understand the harmony of Heaven and Earth is to discern signs of disorder. Each of the twelve earthly branches has its corresponding wind, and when the winds deviate from their natural rhythm, it is a sign that order is failing. In the eighteenth year of Duke Xiang, the state of Chu attacked Zheng. The musician Shi Kuang first sang of the north wind, then of the south wind. The south wind lacked strength and coherence, and Shi Kuang declared that Chu would not succeed. Indeed, many Chu soldiers suffered from cold, confirming the signs of disrupted harmony. To address such disruptions and govern effectively, five roles are established to offer counsel and maintain order. These roles help interpret omens and seasonal patterns, ensuring that state affairs proceed in accordance with cosmic and political balance. Among them are three minor emissaries and two senior diviners, appointed to advise the king. The Inner Historian manages eight categories of royal decrees: granting rank, bestowing emoluments, dismissal, appointment, execution, birth, reward, and confiscation. The Grand Minister also conveys royal edicts and serves as a secondary authority, helping oversee the laws and administrative affairs of the state. These officials work together to uphold governance, interpret laws, and plan state policy.”",
                "position": 6107
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x10.png",
                "caption": "Figure 8:A 20th-century Danish postcard that begins on the right side of the page, which causes mistakes even inChurropredictions.",
                "position": 6118
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x11.png",
                "caption": "Figure 9:19th-century English",
                "position": 6128
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x12.png",
                "caption": "Figure 10:A 19th-century German letter where the zero-shot VLM exhibits repetitive degeneration.",
                "position": 6141
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x13.png",
                "caption": "Figure 11:A Latin manuscript where both models exhibit repetitive degeneration.",
                "position": 6144
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x14.png",
                "caption": "Figure 12:A 19th-century transitional Romanian book where the zero-shot VLM is unable to recognize Latin characters.",
                "position": 6154
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x15.png",
                "caption": "Figure 13:Middle High German",
                "position": 6164
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x16.png",
                "caption": "Figure 14:18th-century Dutch letter, bound",
                "position": 6167
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x17.png",
                "caption": "Figure 15:17th-century Dutch print",
                "position": 6170
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x18.png",
                "caption": "Figure 16:18th-century Dutch letter with marginalia",
                "position": 6173
            },
            {
                "img": "https://arxiv.org/html/2509.19768/x19.png",
                "caption": "Figure 17:19th–20th-century Norwegian letter",
                "position": 6176
            }
        ]
    },
    {
        "header": "Appendix EList of 155 Sources Used to CreateChurro-DS",
        "images": []
    }
]