[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.04441/x1.png",
                "caption": "Figure 1:(a)DEXOPis a passive exoskeleton that links human hand movements to passive robotic hand movements through mechanical linkages. (b)DEXOPenables humans to collect task demonstrations of diverse and highly dexterous tasks. (c) Data collected byDEXOPcan be used to train policies that transfer to robots.",
                "position": 107
            }
        ]
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Related Work",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.04441/x2.png",
                "caption": "Figure 2:Hardware overview: (a) Variants ofDEXOP:DEXOP-12(4 fingers and 12 DOF), the most advancedDEXOP;DEXOP-9without the ring finger (3 fingers and 9 DOF); andDEXOP-7without abduction joints on index and middle fingers (3 fingers, 7 DOF, and co-designed with EyeSight hand). (b) Illustration of a human hand controlling theDEXOP-9to grasp a ball, along with the tactile sensor readings and robotic hand pose.",
                "position": 182
            }
        ]
    },
    {
        "header": "3Hardware Design",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.04441/x3.png",
                "caption": "Figure 3:A depiction of joints in a human hand’s kinematic chain. The blue joints are presented inDEXOP-12.",
                "position": 194
            },
            {
                "img": "https://arxiv.org/html/2509.04441/x4.png",
                "caption": "Figure 4:(a) Exploded view of theDEXOP-12system. (b) Top: Annotated view of the 4-bar linkages coupling the index, middle and ring fingers of the robot hand and exoskeleton. Bottom: Annotated view of the rotary linkage system coupling the thumb of the robot hand and exoskeleton. For a detailed explanation, please refer to text in Section3.2.",
                "position": 242
            }
        ]
    },
    {
        "header": "4Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.04441/x5.png",
                "caption": "Figure 5:Illustration of evaluation tasks.Drilling: the user must pick up a drill standing upright on a table, then insert the drill bit into an M2 screw head and tighten it by actuating the drill.Bottle opening: with the bottle placed within the workspace of the hand, the user grasps the bottle and then uses the thumb to unscrew the cap.Box Packaging:the user approaches the an open box, and folds the side flaps before closing the top flap by folding the the securing flap into the box.Bulb installation: the task is composed of three parts, a lamp base, a light bulb, and a light shade. The user picks and screws the light bulb into the lamp base before placing the light shade over the entire assembly.",
                "position": 471
            },
            {
                "img": "https://arxiv.org/html/2509.04441/figures/human_study.png",
                "caption": "Figure 6:Comparison of task throughput of the drilling, bulb installation, box packaging and bottle opening tasks with TeleOP system,DEXOPand human hand.DEXOPachieves much higher throughput than TeleOP.",
                "position": 507
            },
            {
                "img": "https://arxiv.org/html/2509.04441/x6.png",
                "caption": "Figure 7:Various tasks illustrating the dexterity thatDEXOPcan achieve. Arrows in the figure denote the motion of the object or its part being manipulated.",
                "position": 525
            }
        ]
    },
    {
        "header": "5Preliminary Policy Learning Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.04441/x7.png",
                "caption": "Figure 8:(a) A Unitree H1 with EyeSight hands used for policy evaluation. (b) TheDEXOPand AirExo setup, used for both teleop andDEXOPdata collection. (c) The views from the left and right wrist cameras mounted on the exoskeleton system.",
                "position": 572
            },
            {
                "img": "https://arxiv.org/html/2509.04441/x8.png",
                "caption": "Figure 9:Illustration of our task for policy learning. Wrist camera images highlighted in green showcase successful actions for each stage, while images in red show different failure modes, such as misaligning the light bulb during insertion. Each of the six stages is shown in states after their respective actions have been performed successfully.",
                "position": 582
            },
            {
                "img": "https://arxiv.org/html/2509.04441/x9.png",
                "caption": "Figure 10:(a) Success rates of policies trained on mixedDEXOPand TeleOP data, broken down by task step. Note that these are cumulative success rates, where performance in earlier stages affects the outcomes of subsequent stages. (b) Speed comparison of data collection forDEXOPand TeleOP, averaged time for each trajectory by task step. Error bars denote the standard error of the mean.",
                "position": 703
            }
        ]
    },
    {
        "header": "6Discussion",
        "images": []
    },
    {
        "header": "References",
        "images": [
            {
                "img": "https://arxiv.org/html/2509.04441/x10.png",
                "caption": "Figure S1:(a) Blue joints represent the kinematic chain of theDEXOP-9. (b) Blue joints represent the kinematic chain of theDEXOP-7. Orange joints are the missing joints compared to human hand kinematics.",
                "position": 1622
            },
            {
                "img": "https://arxiv.org/html/2509.04441/figures/finger_kinematic.png",
                "caption": "Figure S2:Illustration of attaching distal and proximal phalanges of human finger to wearable exoskeleton onDEXOP-7, which provides force feedback at each finger segment.",
                "position": 1628
            },
            {
                "img": "https://arxiv.org/html/2509.04441/x11.png",
                "caption": "Figure S3:(a) The thumb on passive robotic hand without and with co-designing with the actual robotic hand. (b) The middle finger on the passive robotic hand without and with co-designing with the actual robotic hand.",
                "position": 1647
            },
            {
                "img": "https://arxiv.org/html/2509.04441/x12.png",
                "caption": "Figure S4:Fingernails (top left) assist in picking up small objects. Abduction joints (bottom left) enable in-hand reorientation and gripping between fingers. Adjustable finger cots (top right) adapt the exoskeleton to different finger lengths. The palm pad (bottom right) secures objects during whole-hand manipulation.",
                "position": 1662
            }
        ]
    },
    {
        "header": "Supplementary",
        "images": []
    }
]