[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Related Work",
        "images": []
    },
    {
        "header": "3TC-LoRA: Temporally Modulated Conditional LoRA",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.09561/x1.png",
                "caption": "Figure 1:The TC-LoRA framework for dynamic, context-aware conditional control.(a)Our method is formulated within a standard conditional diffusion framework, in which a text prompt together with an input condition (e.g., a depth map or an edge sketch) guides the generation process from an initial noise image.(b)We introduce a dynamic weight conditioning mechanism where a hypernetwork—the only trainable component—generates the LoRA adapter weights (𝐁\\mathbf{B}or𝐀\\mathbf{A}) on-the-fly. This dynamic weight update is then used to modify the behavior of the frozen pretrained weights (W0W_{0}) of the base model, allowing for a state-aware adaptation at each step.",
                "position": 162
            },
            {
                "img": "https://arxiv.org/html/2510.09561/x2.png",
                "caption": "Figure 2:Qualitative Comparison:Each example set comprises a text prompt (top), a depth condition (left image), and the corresponding generation results obtained using ControlNet (middle image) and TC-LoRA conditioning (right image). Specifically, we compare Cosmos-Transfer1alhaija2025cosmos-tagainst Cosmos-Predict1 + TC-LoRA. Overall, TC-LoRA exhibits improved fidelity in adhering to the spatial condition.",
                "position": 206
            }
        ]
    },
    {
        "header": "4Experimental Results",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix",
        "images": []
    },
    {
        "header": "Appendix AHypernetwork Architecture",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.09561/x3.png",
                "caption": "Figure 3:Hypernetwork Design",
                "position": 634
            }
        ]
    },
    {
        "header": "Appendix BTraining Objective",
        "images": []
    },
    {
        "header": "Appendix CAdditional Experimental Details and Results",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.09561/x4.png",
                "caption": "Figure 4:Effect of TC-LoRA: (a) and (b) show images generated from the given text promptwithout conditioning. With the condition input shown in (c), the generation process can be conditioned accordingly, demonstrating TC-LoRA’s role in enabling spatial correction through LoRA. Panels (d), (e), and (f) present visualization results at different TC-LoRA post-training durations. After 150k iterations, the generated image is well aligned with the condition in (c).",
                "position": 712
            }
        ]
    },
    {
        "header": "Appendix DOn the Distinction Between Activation Conditioning and Weight Conditioning",
        "images": []
    }
]