[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Preliminaries",
        "images": []
    },
    {
        "header": "3Method",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.19779/diagram.png",
                "caption": "Figure 1:Overview of AdaSPEC distillation process: AdaSPEC selects the most training-effective tokens and distills on these tokens.",
                "position": 242
            }
        ]
    },
    {
        "header": "4Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.19779/analysis.png",
                "caption": "Figure 2:Comparative analysis of AdaSPEC and DistillSpec performance across multiple metrics on GSM8K (a, c, e) and CNN/Daily Mail (b, d, f) datasets:(a-b) Task-level acceptance rate distributions showing AdaSPEC’s superior performance across tasks. (c-d) Logit margin distributions demonstrating AdaSPEC’s improved prediction confidence with higher positive margins and lower negative margins. (e-f) Token-level KL divergence distributions indicating better draft-target model alignment for AdaSPEC with consistently lower divergence values. The results demonstrate AdaSPEC’s more effective knowledge transfer and improved draft-target model alignment compared to DistillSpec across different evaluation metrics.",
                "position": 425
            },
            {
                "img": "https://arxiv.org/html/2510.19779/1.png",
                "caption": "Figure 3:Comparison of prediction errors between AdaSPEC and DistillSpec on GSM8K and CNN/Daily Mail Datasets:Tokens highlighted in blue represent errors made by both methods, while tokens highlighted in red indicate errors unique to the corresponding method. As can be seen, AdaSPEC‘s errors form nearly a subset of DistillSpec’s errors, demonstrating the effectiveness of AdaSPEC’s selective training approach in reducing inference discrepancies.",
                "position": 435
            },
            {
                "img": "https://arxiv.org/html/2510.19779/ablation.png",
                "caption": "Figure 4:Impact of token selection ratiokkon acceptance rate for GSM8K:Results show a general trend where lowerkkvalues (0.2-0.4) yield higher acceptance rates.",
                "position": 566
            }
        ]
    },
    {
        "header": "5Dicussion",
        "images": []
    },
    {
        "header": "6Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix ATechnical Appendices and Supplementary Material",
        "images": []
    }
]