[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.06917/x1.png",
                "caption": "Figure 1:The timing diagram ofShanks.\nAs the user speaks, their speech is segmented into chunks for everytc​h​u​n​kt_{chunk}seconds and streamed to the SLM.\nAfter receiving an input chunk,Shanksgenerates the thinking tokens, which might include calling external tools or determining to interrupt the user.\nWhen the user is speaking theii-th speech chunkSiS_{i},Shanksgenerates the(i−1)(i-1)-th thinking chunkRi−1R_{i-1}, achieving thinking while listening.\nWhen the current speech chunkSiS_{i}is fully spoken by the user,Shanksstops the thinking forRi−1R_{i-1}, adds the latest speechSiS_{i}and the previous reasoningRi−1R_{i-1}to its context, and begins theii-th thinking chunkRiR_{i}.",
                "position": 116
            }
        ]
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Method: Simultaneous Hearing and Thinking with Chunked Input Speech",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.06917/x2.png",
                "caption": "Figure 2:Illustration of the training data.SiS_{i}: the speech for theii-th user speech chunk;RiR_{i}: theii-th thinking block afterSiS_{i};OO: the final response block;AiA_{i}: the API call responses after the speech chunkSiS_{i}.\nBlocks in dashed lines do not contribute to the training loss, while blocks in solid lines are included for loss calculation.\n(a) The general training sequence: Alternating between user speech block and SLM thinking token chunks (Section2.2), followed by a final response chunk.\n(b) Training data with interruption: Alternating between user speech blocks and the thinking token chunks, while the last thinking chunk includes a special token[INTERRUPT].\n(c) Training data with API calls: Similar to (a), while each thinking chunk may be separated into two blocksRi−1R_{i-1}andRi−2R_{i-2}by the API call responseAiA_{i}.",
                "position": 249
            }
        ]
    },
    {
        "header": "3Task Introduction",
        "images": []
    },
    {
        "header": "4Compared Methods",
        "images": []
    },
    {
        "header": "5Experiment Results",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.06917/x3.png",
                "caption": "Figure 3:An example from the interruption scenario in Section3.2.\nThe chunks in red are the transcriptions of a user describing a math problem and attempting to solve it step-by-step.\nThe thinking chunks (in green) and interruption response (in orange) are generated byShanks-E2E.\nFor each time slot fromn​tchunknt_{\\rm chunk}to(n+1)​tchunk(n+1)t_{\\rm chunk}, the chunks in green (SLM thinking chunks) and orange (output response) happensequentially, while the user speech chunk (in red) happens concurrent to other blocks in the same time slot.",
                "position": 695
            },
            {
                "img": "https://arxiv.org/html/2510.06917/x4.png",
                "caption": "Figure 4:An example user query from ComplexFuncBench (in red), including the unspoken thinking process (in green) and the spoken final response (in orange) fromShanks-E2E.\nFor each time slot fromn​tchunknt_{\\rm chunk}to(n+1)​tchunk(n+1)t_{\\rm chunk}, the chunks in green (SLM thinking chunks), blue (API call responses), and orange (output response) happensequentially, while the user speech chunk (in red) happens concurrent to other blocks in the same time slot.\nThet=Tt=Tmeans the time when the user’s speech terminates.",
                "position": 795
            }
        ]
    },
    {
        "header": "6Related Works",
        "images": []
    },
    {
        "header": "7Conclusion, Limitations, and Future Work",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix AEncoding the User Speech",
        "images": []
    },
    {
        "header": "Appendix BDetails in Training",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.06917/x5.png",
                "caption": "Figure 5:The interruption latency forShanks. The bars in red are the results on the wrong subset, while the bars in green are the results on the correct subset.\nOne can observe that the red bars are mostly positive, meaning that the model tends to interrupt after the first error occurs.",
                "position": 1619
            }
        ]
    },
    {
        "header": "Appendix CDetails in Evaluation",
        "images": []
    }
]