[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.19808/x1.png",
                "caption": "Figure 1:Pico-Banana-400K dataset overview. The pipeline (bottom) shows how diverse OpenImages inputs are edited using Nano-Banana and quality-filtered by Gemini-2.5-Pro, with failed attempts automatically retried. The dataset comprises 386K examples across single-turn SFT (66.8%), preference pairs (14.5%), and multi-turn sequences (18.7%), organized by our comprehensive edit taxonomy (top left).",
                "position": 81
            }
        ]
    },
    {
        "header": "2Dataset Construction",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.19808/x2.png",
                "caption": "Figure 2:Example single-turn text-guided image edits from the Pico-Banana-400K dataset.Each pair shows the edited result (right) and its corresponding original image (left).\nThe dataset spans diverse edit types, including photometric adjustments, object-level manipulations, stylistic transformations, and scene or lighting modifications.\nThese examples illustrate the visual diversity, realism, and high instruction fidelity achieved by the Nano-Banana editing model.",
                "position": 114
            },
            {
                "img": "https://arxiv.org/html/2510.19808/x3.png",
                "caption": "Figure 3:Distribution of image editing instruction content.",
                "position": 464
            },
            {
                "img": "https://arxiv.org/html/2510.19808/img/example_pos_nega.png",
                "caption": "Figure 4:Preference triplet example.From left to right: theoriginalimage, the natural-languageinstruction(center panel) requesting relocation of the pink–white straws into the leftmost glasses, and two model outputs: asuccessful editthat satisfies the instruction and preserves scene context, and afailed editthat violates the instruction (incorrect placement/geometry).\nSuch (success, failure) pairs are retained as preference data for alignment studies.",
                "position": 537
            },
            {
                "img": "https://arxiv.org/html/2510.19808/x4.png",
                "caption": "Figure 5:Multi-turn image editing example.Starting from the original pumpkin image, the model first applies a vintage film grain effect, replaces the dark background with a haunted house scene, transforms the entire setting into a snowy winter landscape, and finally adjusts the global lighting to a warm, golden-hour glow, producing the final image on the right.",
                "position": 572
            }
        ]
    },
    {
        "header": "3Dataset Analysis",
        "images": [
            {
                "img": "https://arxiv.org/html/2510.19808/img/success_rate_lollipop_vertical_notitle_noparens_nogrid.png",
                "caption": "Figure 6:Per–edit type success rates.",
                "position": 589
            }
        ]
    },
    {
        "header": "4Related Work",
        "images": []
    },
    {
        "header": "5Conclusion",
        "images": []
    },
    {
        "header": "Acknowledgment",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix ASystem Prompt for Edit Instruction Generation",
        "images": []
    },
    {
        "header": "Appendix BSystem Prompt used by Gemini-2.5-Pro as a Judge",
        "images": []
    }
]