[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "Introduction",
        "images": []
    },
    {
        "header": "Related Work",
        "images": [
            {
                "img": "https://arxiv.org/html/2511.13524/x1.png",
                "caption": "Figure 1:An overview of the FreeAskWorld framework and its data generation pipeline is presented. The system incorporates scene randomization techniques to enhance environmental diversity. The data generation module produces the FreeAskWorld dataset through this pipeline. People simulation module for modeling realistic human behaviors within virtual scenes, as well as an instruction generation module for producing navigation directives used in the Direction Inquiry Task within the simulator.",
                "position": 186
            }
        ]
    },
    {
        "header": "FreeAskWorld: Simulator Design",
        "images": [
            {
                "img": "https://arxiv.org/html/2511.13524/Pictures/OccupancyMapGenerationContrastAndSameStore.jpg",
                "caption": "Figure 2:Comparison Between the Original Mesh Model and the Generated Occupancy Heatmap. The black and red bounding signs represent the same store A and B in different positions, a layout designed to assess the navigation capabilities of humans or robots in complex environments.",
                "position": 248
            },
            {
                "img": "https://arxiv.org/html/2511.13524/x2.png",
                "caption": "Figure 3:The People Simulation works as follows: a large language model creates diverse character profiles and schedules, which the high-level planner uses to select activities based on time. These activities are passed to the middle-level planner, which breaks them into subtasks and manages them with a finite state machine. Low-level planners handle navigation and basic behaviors, using A* for global paths and the Social Force Model to avoid obstacles locally.",
                "position": 251
            }
        ]
    },
    {
        "header": "Direction Inquiry Task",
        "images": []
    },
    {
        "header": "FreeAskWorld Dataset",
        "images": [
            {
                "img": "https://arxiv.org/html/2511.13524/Pictures/FinalSyhteticDataPic.jpg",
                "caption": "Figure 4:Six Main Types of Synthetic Data",
                "position": 523
            }
        ]
    },
    {
        "header": "Experiments",
        "images": []
    },
    {
        "header": "Conclusion",
        "images": []
    },
    {
        "header": "Acknowledgments",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]