[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.11004/x1.png",
                "caption": "Figure 1:An illustrative example of model responses before and afterNAACL. By explicitly training the model to assess passage- and group-level utility prior to answering,NAACLenables more reliable confidence expression under noisy retrieval, as reflected by consistently reduced ECE. The performance plots report results on NQ forLlama-3.1-8B-InstructandDeepSeek-R1-Distill-Llama-8B, where SFT corresponds to the Label-only SFT setting in Table6.1, and illustrate howNAACLpromotes more transparent and grounded human–computer interaction in real-world scenarios.",
                "position": 274
            }
        ]
    },
    {
        "header": "2Related Work",
        "images": []
    },
    {
        "header": "3Task Formalization",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.11004/x2.png",
                "caption": "Table 1:Real-world RAG results across four datasets demonstrate consistently poor calibration. Notably, average ECE exceeds 0.4, highlighting severe misalignment between verbal confidence and empirical correctness.",
                "position": 411
            }
        ]
    },
    {
        "header": "4Experiment",
        "images": []
    },
    {
        "header": "5Analysis",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.11004/x2.png",
                "caption": "Figure 2:Calibration performance ofLlama-3.1-8B-InstructandDeepSeek-R1-Distill-Llama-8Bon NQ and Bamboogle under controlled noise settings. The plots display ECE, AUROC, and Average Confidence across four retrieval settings:Gold-only,Gold+Irrelevant(Irr),Gold+Relevant(Rel), andGold+Counterfactual(Cf). Results show that introducing noise, particularly counterfactual passages, substantially degrades calibration performance.",
                "position": 630
            }
        ]
    },
    {
        "header": "6Method",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.11004/x3.png",
                "caption": "Figure 3:Overview of theNAACLdata pipeline with three stages: RAG Passage Construction, Training Response Generation, and Multi-stage Data Filtering. Specifically, In the Training Response Generation stage, the model takes a queryqqand a set of retrieved passages𝒫\\mathcal{P}(wherek=3k=3) as input (denoted as Input: Q+3P). It then generates a reasoning trace containing passage-level and group-level judgmentsJp,JgJ_{p},J_{g}(denoted as P Type), followed by the predicted answera^\\hat{a}(A) and the verbal confidence scorec^\\hat{c}(C). Finally, the pipeline produces 2K high-quality trajectories used for fine-tuning.",
                "position": 686
            },
            {
                "img": "https://arxiv.org/html/2601.11004/x4.png",
                "caption": "Table 2:Calibration performance of various models on four datasets. Scores inboldindicate the best performance, whileunderlinedscores denote the second-best. Results show thatNAACLsubstantially improves calibration and consistently outperforms several baselines, without sacrificing accuracy, as evidenced in AppendixB.5.",
                "position": 707
            }
        ]
    },
    {
        "header": "7Conclusion",
        "images": []
    },
    {
        "header": "Limitations",
        "images": []
    },
    {
        "header": "Ethics Statements",
        "images": []
    },
    {
        "header": "Acknowledgements",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix ADetailed Experiment Setup",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.11004/x4.png",
                "caption": "Figure 4:Reliability Diagram for HotpotQA: comparison of CoT prompt with base model (upper row) and SFT models (lower row). Each subplot displays accuracy v.s. confidence, with the diagonal dashed line representing perfect calibration.",
                "position": 3003
            }
        ]
    },
    {
        "header": "Appendix BAdditional Experiment Results",
        "images": []
    },
    {
        "header": "Appendix CDiscussions",
        "images": []
    }
]