[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.21337/figures/qwenasr-intro.png",
                "caption": "Figure 1:Qwen3-ASR family includes all-in-one ASR models with advantages in multilingual, noisy speech recognition, singing voice recognition and inference efficiency, so as to a novel multilingual speech forced alignment model for predicting timestamps of words or sentences in ASR results.",
                "position": 102
            }
        ]
    },
    {
        "header": "2Qwen3-ASR",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.21337/x1.png",
                "caption": "Figure 2:Architecture of AuT (left) and the overview of Qwen3-ASR (right).",
                "position": 147
            },
            {
                "img": "https://arxiv.org/html/2601.21337/figures/qwen3asr_fa.png",
                "caption": "Table 1:Features of the Qwen3-ASR model family. Qwen3-ASR-1.7B and Qwen3-ASR-0.6B support 52 languages and dialects, comprising 30 languages and 22 Chinese dialects. Qwen3-ForcedAligner-0.6B supports 11 languages. Seq. Len. denotes the maximum audio length for single inference in seconds, and NAR denotes non-autoregressive inference.",
                "position": 209
            }
        ]
    },
    {
        "header": "3Qwen3-ForcedAligner",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.21337/figures/qwen3asr_fa.png",
                "caption": "Figure 3:Illustration of Qwen3-ForcedAligner-0.6B. During training, randomly masked timestamp slots with are dynamically inserted into the token sequence to represent word or character boundaries. The combined sequence is fed into Qwen3-0.6B LLM, and a timestamp prediction layer predicts the corresponding timestamp indices for each slot. Supervision is applied with cross‑entropy loss on synchronously aligned label and output sequences.",
                "position": 734
            }
        ]
    },
    {
        "header": "4Experiments",
        "images": []
    },
    {
        "header": "5Conclusion",
        "images": []
    },
    {
        "header": "6Authors",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix",
        "images": []
    }
]