[
    {
        "header": "Abstract",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.10909/x1.png",
                "caption": "",
                "position": 82
            }
        ]
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Related Work",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.10909/x2.png",
                "caption": "Figure 2:LLM-assisted fine-grained motion annotation pipeline, compared with existing dataset.Given motions with high level action descriptions, we instruct LLM to decompose the actions into part level descriptions and align with corresponding temporal windows. This gives the most important body part text and corresponding motions needed to learn essential motion elements.",
                "position": 149
            }
        ]
    },
    {
        "header": "3FrankenStein Dataset Construction",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.10909/x3.png",
                "caption": "Figure 3:Overview of our FrankenMotion.\nOur model is a transformer-based diffusion model that can be input conditioned on a) sequence level prompt, b) action-level prompt and c) part-level prompt. After training with our paired data of motion and structured multi-granularity text annotations, it learns the essential motion elements and how to compose them into complex motions.",
                "position": 283
            }
        ]
    },
    {
        "header": "4FrankenMotion: Part-Based Spatiotemporal Composition",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.10909/x4.png",
                "caption": "Figure 4:Qualitative comparison with baselines. Prior methods cannot compose parts into realistic motion (STMC[37]), generates repetitive motions (DART[68]), or do not follow the intricate details like “turn around” (UniMotion[20]). Our method faithfully composes the complex parts into one realistic motion while also following precisely the detailed body part prompts and high level semantics.",
                "position": 524
            }
        ]
    },
    {
        "header": "5Experiments",
        "images": []
    },
    {
        "header": "6Conclusion and Limitation",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]