[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.08321/x1.png",
                "caption": "Figure 1:Illustration of traditional framework of visual text generation and three additional generation patterns of our method. Please note that the text content, layout and implicit attributes can be adaptively generated by VLM according to instruction.",
                "position": 88
            },
            {
                "img": "https://arxiv.org/html/2601.08321/x2.png",
                "caption": "Figure 2:Some results produced by our UM-Text, presenting its powerful effects on tasks such as image editing, image translation, and poster design.\nPlease note that the bounding boxes of text are adaptively generated by UM-Text model.",
                "position": 97
            },
            {
                "img": "https://arxiv.org/html/2601.08321/x3.png",
                "caption": "Figure 3:The framework of UM-Text for multi-lingual visual text generation and editing.\nThe UM-Encoder integrates multiple modality embeddings as the condition of visual text generation.\nThe mask in input and loss function is transformed from the predicted layout of UM-Designer.\nPlease note our single model supports diverse downstream applications based on the instructions.",
                "position": 147
            }
        ]
    },
    {
        "header": "2Related Work",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.08321/x4.png",
                "caption": "Figure 4:The illustration of three training stages for UM-Text optimization.",
                "position": 180
            }
        ]
    },
    {
        "header": "3Methodology",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.08321/x5.png",
                "caption": "Figure 5:Qualitative comparison of UM-Text and state-of-the-art models in visual text editing task.",
                "position": 237
            }
        ]
    },
    {
        "header": "4Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.08321/x6.png",
                "caption": "Figure 6:Compare UM-Text and ChatGPT4o in multi-turn image editing using natural language instructions, specifically in poster design, image editing, and image translation.",
                "position": 648
            }
        ]
    },
    {
        "header": "5Conclusion",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]