[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": []
    },
    {
        "header": "2Results",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.19149/figures/fig1_architecture_v2.png",
                "caption": "Figure 1:Application of GPCR-Filter and overview of its architecture.(a)Workflow illustrating how GPCR-Filter integrates into GPCR modulator discovery. After ligand preparation and initial structure-based virtual screening, GPCR-Filter uses only GPCR sequences to further refine docking outputs and prioritize candidates for downstream activation assays.(b)Schematic of the GPCR-Filter architecture. GPCR sequences are embedded into per-residue representations using a pretrained protein language model, while ligand SMILES are encoded into per-atom features through a molecular graph neural network. A cross-attention module couples ligand and receptor representations, and the fused features are aggregated to produce a final interaction probability.",
                "position": 139
            },
            {
                "img": "https://arxiv.org/html/2601.19149/figures/fig2_splits_overview.png",
                "caption": "Figure 2:Dataset split strategies and performance overview.(a)Random Split: Each GPCR (receptor icon) and its ligands are randomly assigned to training and testing sets. Both receptors and ligands can appear in both sets, simulating a fully mixed in-distribution evaluation.(b)Intra-Target Split: Each receptor is present in both training and testing, but its associated ligands are divided into mutually exclusive subsets. This evaluates generalization to unseen ligands for the same receptor.(c)Inter-Target Split: The receptor set is partitioned into disjoint training and held-out target subsets (e.g., 9:1). Validation examples are drawn from the held-out subset to keep target identities disjoint between training and evaluation.\nOn the right, the ROC curves illustrate the discriminative performance of GPCR-Filter and baseline models under the three data partitioning protocols. Receptor and ligand icons are for schematic illustration only, with color denoting training or testing samples.",
                "position": 157
            },
            {
                "img": "https://arxiv.org/html/2601.19149/figures/fig4_pocket_analysis_v3.png",
                "caption": "Figure 3:Binding-pocket analysis across two GPCR complexes.(a–c)correspond toPDB 9bsb;(d–f)correspond toPDB 9jcl.(a,d)Model prediction scores under the three evaluation settings (Random, Intra-target, Inter-target). All predicted probabilities exceed 0.5, indicating consistent positive predictions across splits.(b,e)Top-20 attended residues ranked under the three evaluation settings. Each entry is reported asindex–residue; highlighted cells indicate residues that are repeatedly prioritized across splits.(c,f)Spatial mapping of theInter-Targetmodel’s Top-20 attended residues onto the corresponding structure and binding pocket.\nInset panels show the ligand in sticks and the pocket region enlarged (red box), illustrating which high-attention residues lie within the crystallographic binding site.All residue indices correspond to the numbering used in the PDB sequences.",
                "position": 164
            },
            {
                "img": "https://arxiv.org/html/2601.19149/figures/fig3_5HT1A_validation_v2.png",
                "caption": "Figure 4:Experimental validation of GPCR-Filter-predicted agonists on the 5-HT1Areceptor.(a)Chemical structures of 5-HT and the four validated hits.(b)Single-concentration screening at 30μ\\muM using a GloSensor-cAMP assay. Bars represent luminescence (LUM) values for individual compounds; dashed lines denote Forskolin (black, baseline) and 5-HT (red, canonical agonist). Four compounds prioritized by GPCR-Filter (D24, D29, D34, D47) exhibited reduced LUM, indicative of receptor activation.(c)Normalized concentration–response curves for 5-HT and the four hits, showing comparable or higher maximal effects (Emax) but right-shifted potencies (higher EC50), indicating increased efficacy but lower potency relative to 5-HT.\nTogether, these results confirm that GPCR-Filter successfully identified four true agonists activating 5-HT1Ain a dose-dependent manner.",
                "position": 245
            }
        ]
    },
    {
        "header": "3Discussion",
        "images": []
    },
    {
        "header": "4Methods",
        "images": []
    },
    {
        "header": "References",
        "images": [
            {
                "img": "https://arxiv.org/html/2601.19149/figures/app1_binned_frequency.png",
                "caption": "",
                "position": 897
            },
            {
                "img": "https://arxiv.org/html/2601.19149/x1.png",
                "caption": "",
                "position": 908
            }
        ]
    },
    {
        "header": "Appendix",
        "images": []
    }
]