[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2602.16699/x1.png",
                "caption": "Figure 1:Given the same task, a coding agent may either verify assumptions via intermediate checks carefully (right) or attempt a direct solution as soon as possible (left). The optimal choice depends on uncertainty and specific cost constraints. Calibrate-Then-Act (CTA) materializes this information for better decision-making.",
                "position": 131
            }
        ]
    },
    {
        "header": "2The Environment Exploration Problem",
        "images": []
    },
    {
        "header": "3Calibrating Agent Environment Exploration",
        "images": [
            {
                "img": "https://arxiv.org/html/2602.16699/x2.png",
                "caption": "Figure 2:Standard agentic decision loop (left) and proposed methodCTAwith estimated priors (right). In CTA, we learn a prior estimator from training data and condition the agent on estimatedp^\\hat{p}at inference and/or training time, inducing more optimal decision making through explicit reasoning over prior probabilities.",
                "position": 191
            }
        ]
    },
    {
        "header": "4Toy Setting: Pandora’s Box Problem",
        "images": []
    },
    {
        "header": "5Real Exploration Scenarios",
        "images": []
    },
    {
        "header": "6Calibrate-Then-Act: Inducing More Optimal Exploration with Explicit Priors",
        "images": []
    },
    {
        "header": "7Experiment Setup",
        "images": []
    },
    {
        "header": "8Results",
        "images": [
            {
                "img": "https://arxiv.org/html/2602.16699/x3.png",
                "caption": "Figure 3:Model’s retrieval decision with respect to their confidence levelkdak_{\\text{da}}and retrieval discount factorγ\\gamma.\nEach dot corresponds to one question: green indicates the model directly answers, and red indicates it retrieves.\nThe dashed line marks the oracle threshold: red region retrieves, green region directly answers. Models with calibrated priors closely align with the oracle decision rule, exhibiting more cost-aware retrieval behavior.",
                "position": 713
            },
            {
                "img": "https://arxiv.org/html/2602.16699/x4.png",
                "caption": "Figure 4:Action pattern distribution for prompting and RL-trained agents, with and without calibrated priors, across relative cost parametersρ\\rho. Each stacked bar shows the proportion of decision traces corresponding to different action patterns, with the rewardRRlabeled above. Annotated percentages indicate the fraction of tasks where the agent attempts code execution before any unit tests.",
                "position": 892
            },
            {
                "img": "https://arxiv.org/html/2602.16699/x5.png",
                "caption": "Figure 5:Pareto frontier of average reward under varying costs. Static strategies (test-first or code-first) achieve high reward only in limited regimes, whereasCTA-RLwith estimated priors consistently attains Pareto-optimal performance across cost settings.",
                "position": 895
            }
        ]
    },
    {
        "header": "9Related Work",
        "images": []
    },
    {
        "header": "10Conclusion",
        "images": []
    },
    {
        "header": "Acknowledgments",
        "images": []
    },
    {
        "header": "Impact Statement",
        "images": []
    },
    {
        "header": "References",
        "images": []
    },
    {
        "header": "Appendix AQualitative trace analysis of Pandora’s Box Problem",
        "images": []
    },
    {
        "header": "Appendix BExperiment details forQA",
        "images": []
    },
    {
        "header": "Appendix CDataset Construction Details for Task: Coding with Selective Testing",
        "images": []
    },
    {
        "header": "Appendix DOracle Strategy for Pandora’s Box Problem",
        "images": []
    },
    {
        "header": "Appendix EPrompt templates",
        "images": []
    },
    {
        "header": "Appendix FCase study: Cost-Aware Decision Traces inCodewithCTA-RLandRL",
        "images": []
    }
]