[
    {
        "header": "Abstract",
        "images": []
    },
    {
        "header": "1.Introduction",
        "images": [
            {
                "img": "https://arxiv.org/html/2602.07035/x1.png",
                "caption": "Figure 1.LLM-based Search Agent (ReAct) vs. dLLM-based Search Agent (ReAct and P-ReAct). Top & Middle: Standard ReAct paradigm suffers from high latency due to serial thinking and tool-calling regions generation and tool response waiting, while vanilla dLLMs fail due to tool-calling format errors. Bottom: P-ReAct prioritize tool-calling generation, enabling the model to keep thinking during tool execution.",
                "position": 160
            }
        ]
    },
    {
        "header": "2.Related Work",
        "images": []
    },
    {
        "header": "3.Preliminary",
        "images": [
            {
                "img": "https://arxiv.org/html/2602.07035/x2.png",
                "caption": "Figure 2.DLLM-Searcher includes training process and inference process. In training, both Agentic SFT and Agentic VRPO use Block Attention and Agentic Noising to compute the Agentic ELBO, which serves to estimatelog⁡πθ​(y∣x)\\log\\pi_{\\theta}(y\\mid x). In inference, we employ the P-ReAct agent paradigm . We pre-fill special boundary tokens and apply an additional confidence bias to encourage the model to decode thetool_callregion with priority.",
                "position": 325
            }
        ]
    },
    {
        "header": "4.Our Approach: DLLM-Searcher",
        "images": []
    },
    {
        "header": "5.Experiments",
        "images": [
            {
                "img": "https://arxiv.org/html/2602.07035/picture/RQ2.png",
                "caption": "Figure 3.Accuracy and average end-to-end latency comparison of DLLM-Searcher under P-ReAct and ReAct paradigms on multi-hop QA tasks.",
                "position": 1086
            },
            {
                "img": "https://arxiv.org/html/2602.07035/picture/RQ3.png",
                "caption": "Figure 4.Comparison of accuracy changes on multi-hop QA tasks between DLLM-Searcher and Qwen3 series models when switching from ReAct to P-ReAct.",
                "position": 1097
            }
        ]
    },
    {
        "header": "6.Conclusion",
        "images": []
    },
    {
        "header": "7.Acknowledgements",
        "images": []
    },
    {
        "header": "References",
        "images": []
    }
]